{
  "id": "2020.iwslt-1.22",
  "title": "Generating Fluent Translations from Disfluent Text Without Access to Fluent References: {IIT} {B}ombay@{IWSLT}2020",
  "authors": [
    "Saini, Nikhil  and\nKhatri, Jyotsana  and\nJyothi, Preethi  and\nBhattacharyya, Pushpak"
  ],
  "year": "2020",
  "venue": "Proceedings of the 17th International Conference on Spoken Language Translation",
  "abstract": "Machine translation systems perform reasonably well when the input is well-formed speech or text. Conversational speech is spontaneous and inherently consists of many disfluencies. Producing fluent translations of disfluent source text would typically require parallel disfluent to fluent training data. However, fluent translations of spontaneous speech are an additional resource that is tedious to obtain. This work describes the submission of IIT Bombay to the Conversational Speech Translation challenge at IWSLT 2020. We specifically tackle the problem of disfluency removal in disfluent-to-fluent text-to-text translation assuming no access to fluent references during training. Common patterns of disfluency are extracted from disfluent references and a noise induction model is used to simulate them starting from a clean monolingual corpus. This synthetically constructed dataset is then considered as a proxy for labeled data during training. We also make use of additional fluent text in the target language to help generate fluent translations. This work uses no fluent references during training and beats a baseline model by a margin of 4.21 and 3.11 BLEU points where the baseline uses disfluent and fluent references, respectively. Index Terms- disfluency removal, machine translation, noise induction, leveraging monolingual data, denoising for disfluency removal.",
  "keywords": [
    "bleu",
    "we",
    "training",
    "translation",
    "many disfluencies",
    "2020 machine translation systems",
    "text",
    "however fluent translations",
    "disfluencies",
    "text conversational speech",
    "work",
    "language",
    "fluent translations",
    "model",
    "machine"
  ],
  "url": "https://aclanthology.org/2020.iwslt-1.22/",
  "provenance": {
    "collected_at": "2025-06-05 07:56:44",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}