{
  "id": "2020.winlp-1.31",
  "title": "Long-Tail Predictions with Continuous-Output Language Models",
  "authors": [
    "Dudy, Shiran  and\nBedrick, Steven"
  ],
  "year": "2020",
  "venue": "Proceedings of the Fourth Widening Natural Language Processing Workshop",
  "abstract": "Neural language models typically employ a categorical approach to prediction and training, leading to well-known computational and numerical limitations. An under-explored alternative approach is to perform prediction directly against a continuous word embedding space, which according to recent research is more akin to how lexemes are represented in the brain. Choosing this method opens the door for for large-vocabulary, language models and enables substantially smaller and simpler computational complexities. In this research we explore a different important trait - the continuous output prediction models reach low-frequency vocabulary words which we show are often ignored by the categorical model. Such words are essential, as they can contribute to personalization and user vocabulary adaptation. In this work, we explore continuous-space language modeling in the context of a word prediction task over two different textual domains (newswire text and biomedical journal articles). We investigate both traditional and adversarial training approaches, and report results using several different embedding spaces and decoding mechanisms. We find that our continuous-prediction approach outperforms the standard categorical approach in terms of term diversity, in particular with rare words.",
  "keywords": [
    "we",
    "complexities",
    "training",
    "continuous-space language modeling",
    "word",
    "text",
    "large-vocabulary language models",
    "language models",
    "work",
    "continuous-output language models",
    "language",
    "several different embedding spaces",
    "model",
    "modeling",
    "term"
  ],
  "url": "https://aclanthology.org/2020.winlp-1.31/",
  "provenance": {
    "collected_at": "2025-06-05 07:59:14",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}