{
  "id": "2020.nuse-1.10",
  "title": "Exploring aspects of similarity between spoken personal narratives by disentangling them into narrative clause types",
  "authors": [
    "Saldias, Belen  and\nRoy, Deb"
  ],
  "year": "2020",
  "venue": "Proceedings of the First Joint Workshop on Narrative Understanding, Storylines, and Events",
  "abstract": "Sharing personal narratives is a fundamental aspect of human social behavior as it helps share our life experiences. We can tell stories and rely on our background to understand their context, similarities, and differences. A substantial effort has been made towards developing storytelling machines or inferring characters’ features. However, we don’t usually find models that compare narratives. This task is remarkably challenging for machines since they, as sometimes we do, lack an understanding of what similarity means. To address this challenge, we first introduce a corpus of real-world spoken personal narratives comprising 10,296 narrative clauses from 594 video transcripts. Second, we ask non-narrative experts to annotate those clauses under Labov’s sociolinguistic model of personal narratives (i.e., action, orientation, and evaluation clause types) and train a classifier that reaches 84.7% F-score for the highest-agreed clauses. Finally, we match stories and explore whether people implicitly rely on Labov’s framework to compare narratives. We show that actions followed by the narrator’s evaluation of these are the aspects non-experts consider the most. Our approach is intended to help inform machine learning methods aimed at studying or representing personal narratives.",
  "keywords": [
    "our background",
    "classifier",
    "we",
    "it",
    "the narrator s evaluation",
    "their context similarities",
    "learning",
    "i",
    "background",
    "-",
    "stories",
    "action",
    "machine learning methods",
    "similarities",
    "model"
  ],
  "url": "https://aclanthology.org/2020.nuse-1.10/",
  "provenance": {
    "collected_at": "2025-06-05 07:57:54",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}