{
  "id": "2020.bionlp-1.4",
  "title": "Improving Biomedical Analogical Retrieval with Embedding of Structural Dependencies",
  "authors": [
    "Paullada, Amandalynne  and\nPercha, Bethany  and\nCohen, Trevor"
  ],
  "year": "2020",
  "venue": "Proceedings of the 19th SIGBioMed Workshop on Biomedical Language Processing",
  "abstract": "Inferring the nature of the relationships between biomedical entities from text is an important problem due to the difficulty of maintaining human-curated knowledge bases in rapidly evolving fields. Neural word embeddings have earned attention for an apparent ability to encode relational information. However, word embedding models that disregard syntax during training are limited in their ability to encode the structural relationships fundamental to cognitive theories of analogy. In this paper, we demonstrate the utility of encoding dependency structure in word embeddings in a model we call Embedding of Structural Dependencies (ESD) as a way to represent biomedical relationships in two analogical retrieval tasks: a relationship retrieval (RR) task, and a literature-based discovery (LBD) task meant to hypothesize plausible relationships between pairs of entities unseen in training. We compare our model to skip-gram with negative sampling (SGNS), using 19 databases of biomedical relationships as our evaluation data, with improvements in performance on 17 (LBD) and 18 (RR) of these sets. These results suggest embeddings encoding dependency path information are of value for biomedical analogy retrieval.",
  "keywords": [
    "encode",
    "theories",
    "we",
    "fields",
    "biomedical analogical retrieval",
    "syntax",
    "dependency path information",
    "training",
    "structural dependencies",
    "neural",
    "biomedical analogy retrieval",
    "our evaluation data",
    "dependencies",
    "retrieval",
    "rapidly evolving fields"
  ],
  "url": "https://aclanthology.org/2020.bionlp-1.4/",
  "provenance": {
    "collected_at": "2025-06-05 07:54:48",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}