{
  "id": "2020.ngt-1.2",
  "title": "Learning to Generate Multiple Style Transfer Outputs for an Input Sentence",
  "authors": [
    "Lin, Kevin  and\nLiu, Ming-Yu  and\nSun, Ming-Ting  and\nKautz, Jan"
  ],
  "year": "2020",
  "venue": "Proceedings of the Fourth Workshop on Neural Generation and Translation",
  "abstract": "Text style transfer refers to the task of rephrasing a given text in a different style. While various methods have been proposed to advance the state of the art, they often assume the transfer output follows a delta distribution, and thus their models cannot generate different style transfer results for a given input text. To address the limitation, we propose a one-to-many text style transfer framework. In contrast to prior works that learn a one-to-one mapping that converts an input sentence to one output sentence, our approach learns a one-to-many mapping that can convert an input sentence to multiple different output sentences, while preserving the input content. This is achieved by applying adversarial training with a latent decomposition scheme. Specifically, we decompose the latent representation of the input sentence to a style code that captures the language style variation and a content code that encodes the language style-independent content. We then combine the content code with the style code for generating a style transfer output. By combining the same content code with a different style code, we generate a different style transfer output. Extensive experimental results with comparisons to several text style transfer approaches on multiple public datasets using a diverse set of performance metrics validate effectiveness of the proposed approach.",
  "keywords": [
    "code",
    "we",
    "training",
    "latent",
    "transfer",
    "text",
    "metrics",
    "language",
    "performance metrics validate effectiveness",
    "approach",
    "state",
    "effectiveness",
    "framework",
    "adversarial",
    "the proposed approach"
  ],
  "url": "https://aclanthology.org/2020.ngt-1.2/",
  "provenance": {
    "collected_at": "2025-06-05 07:56:57",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}