{
  "id": "2020.acl-main.283",
  "title": "Hyperbolic Capsule Networks for Multi-Label Classification",
  "authors": [
    "Chen, Boli  and\nHuang, Xin  and\nXiao, Lin  and\nJing, Liping"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Although deep neural networks are effective at extracting high-level features, classification methods usually encode an input into a vector representation via simple feature aggregation operations (e.g. pooling). Such operations limit the performance. For instance, a multi-label document may contain several concepts. In this case, one vector can not sufficiently capture its salient and discriminative content. Thus, we propose Hyperbolic Capsule Networks (HyperCaps) for Multi-Label Classification (MLC), which have two merits. First, hyperbolic capsules are designed to capture fine-grained document information for each label, which has the ability to characterize complicated structures among labels and documents. Second, Hyperbolic Dynamic Routing (HDR) is introduced to aggregate hyperbolic capsules in a label-aware manner, so that the label-level discriminative information can be preserved along the depth of neural networks. To efficiently handle large-scale MLC datasets, we additionally present a new routing method to adaptively adjust the capsule number during routing. Extensive experiments are conducted on four benchmark datasets. Compared with the state-of-the-art methods, HyperCaps significantly improves the performance of MLC especially on tail labels.",
  "keywords": [
    "deep",
    "deep neural networks",
    "we",
    "classification",
    "neural",
    "multi-label classification",
    "a vector representation",
    "information",
    "manner",
    "vector",
    "neural networks",
    "a label-aware manner",
    "e g",
    "salient",
    "multi-label classification mlc"
  ],
  "url": "https://aclanthology.org/2020.acl-main.283/",
  "provenance": {
    "collected_at": "2025-06-05 07:46:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}