{
  "id": "2020.iwslt-1.8",
  "title": "End-to-End Speech-Translation with Knowledge Distillation: {FBK}@{IWSLT}2020",
  "authors": [
    "Gaido, Marco  and\nDi Gangi, Mattia A.  and\nNegri, Matteo  and\nTurchi, Marco"
  ],
  "year": "2020",
  "venue": "Proceedings of the 17th International Conference on Spoken Language Translation",
  "abstract": "This paper describes FBK’s participation in the IWSLT 2020 offline speech translation (ST) task. The task evaluates systems’ ability to translate English TED talks audio into German texts. The test talks are provided in two versions: one contains the data already segmented with automatic tools and the other is the raw data without any segmentation. Participants can decide whether to work on custom segmentation or not. We used the provided segmentation. Our system is an end-to-end model based on an adaptation of the Transformer for speech data. Its training process is the main focus of this paper and it is based on: i) transfer learning (ASR pretraining and knowledge distillation), ii) data augmentation (SpecAugment, time stretch and synthetic data), iii)combining synthetic and real data marked as different domains, and iv) multi-task learning using the CTC loss. Finally, after the training with word-level knowledge distillation is complete, our ST models are fine-tuned using label smoothed cross entropy. Our best model scored 29 BLEU on the MuST-CEn-De test set, which is an excellent result compared to recent papers, and 23.7 BLEU on the same data segmented with VAD, showing the need for researching solutions addressing this specific data condition.",
  "keywords": [
    "end",
    "bleu",
    "we",
    "training",
    "translation",
    "cross",
    "it",
    "loss",
    "23 7 bleu",
    "word",
    "learning",
    "i",
    "the transformer",
    "transformer",
    "process"
  ],
  "url": "https://aclanthology.org/2020.iwslt-1.8/",
  "provenance": {
    "collected_at": "2025-06-05 07:56:33",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}