{
  "id": "2020.nuse-1.3",
  "title": "Improving the Identification of the Discourse Function of News Article Paragraphs",
  "authors": [
    "Banisakher, Deya  and\nYarlott, W. Victor  and\nAldawsari, Mohammed  and\nRishe, Naphtali  and\nFinlayson, Mark"
  ],
  "year": "2020",
  "venue": "Proceedings of the First Joint Workshop on Narrative Understanding, Storylines, and Events",
  "abstract": "Identifying the discourse structure of documents is an important task in understanding written text. Building on prior work, we demonstrate an improved approach to automatically identifying the discourse function of paragraphs in news articles. We start with the hierarchical theory of news discourse developed by van Dijk (1988) which proposes how paragraphs function within news articles. This discourse information is a level intermediate between phrase- or sentence-sized discourse segments and document genre, characterizing how individual paragraphs convey information about the events in the storyline of the article. Specifically, the theory categorizes the relationships between narrated events and (1) the overall storyline (such as Main Events, Background, or Consequences) as well as (2) commentary (such as Verbal Reactions and Evaluations). We trained and tested a linear chain conditional random field (CRF) with new features to model van Dijk’s labels and compared it against several machine learning models presented in previous work. Our model significantly outperformed all baselines and prior approaches, achieving an average of 0.71 F1 score which represents a 31.5% improvement over the previously best-performing support vector machine model.",
  "keywords": [
    "support",
    "chain",
    "field",
    "we",
    "it",
    "information",
    "learning",
    "the hierarchical theory",
    "vector",
    "background",
    "text",
    "0 71 f1 score",
    "main events background",
    "function",
    "work"
  ],
  "url": "https://aclanthology.org/2020.nuse-1.3/",
  "provenance": {
    "collected_at": "2025-06-05 07:57:49",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}