{
  "id": "2020.acl-main.763",
  "title": "Multi-Label and Multilingual News Framing Analysis",
  "authors": [
    "Aky{\\\"u}rek, Afra Feyza  and\nGuo, Lei  and\nElanwar, Randa  and\nIshwar, Prakash  and\nBetke, Margrit  and\nWijaya, Derry Tanti"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "News framing refers to the practice in which aspects of specific issues are highlighted in the news to promote a particular interpretation. In NLP, although recent works have studied framing in English news, few have studied how the analysis can be extended to other languages and in a multi-label setting. In this work, we explore multilingual transfer learning to detect multiple frames from just the news headline in a genuinely low-resource context where there are few/no frame annotations in the target language. We propose a novel method that can leverage elementary resources consisting of a dictionary and few annotations to detect frames in the target language. Our method performs comparably or better than translating the entire target language headline to the source language for which we have annotated data. This work opens up an exciting new capability of scaling up frame analysis to many languages, even those without existing translation technologies. Lastly, we apply our method to detect frames on the issue of U.S. gun violence in multiple languages and obtain exciting insights on the relationship between different frames of the same problem across different countries with different languages.",
  "keywords": [
    "different countries",
    "we",
    "translation",
    "existing translation technologies",
    "technologies",
    "transfer",
    "analysis",
    "countries",
    "work",
    "language",
    "nlp",
    "multi",
    "violence",
    "different frames",
    "low"
  ],
  "url": "https://aclanthology.org/2020.acl-main.763/",
  "provenance": {
    "collected_at": "2025-06-05 07:52:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}