{
  "id": "2020.bea-1.5",
  "title": "CIMA}: A Large Open Access Dialogue Dataset for Tutoring",
  "authors": [
    "Stasaski, Katherine  and\nKao, Kimberly  and\nHearst, Marti A."
  ],
  "year": "2020",
  "venue": "Proceedings of the Fifteenth Workshop on Innovative Use of NLP for Building Educational Applications",
  "abstract": "One-to-one tutoring is often an effective means to help students learn, and recent experiments with neural conversation systems are promising. However, large open datasets of tutoring conversations are lacking. To remedy this, we propose a novel asynchronous method for collecting tutoring dialogue via crowdworkers that is both amenable to the needs of deep learning algorithms and reflective of pedagogical concerns. In this approach, extended conversations are obtained between crowdworkers role-playing as both students and tutors. The CIMA collection, which we make publicly available, is novel in that students are exposed to overlapping grounded concepts between exercises and multiple relevant tutoring responses are collected for the same input. CIMA contains several compelling properties from an educational perspective: student role-players complete exercises in fewer turns during the course of the conversation and tutor players adopt strategies that conform with some educational conversational norms, such as providing hints versus asking questions in appropriate contexts. The dataset enables a model to be trained to generate the next tutoring utterance in a conversation, conditioned on a provided action strategy.",
  "keywords": [
    "deep",
    "tutoring conversations",
    "some educational conversational norms",
    "a conversation",
    "conversations",
    "we",
    "dialogue",
    "means",
    "neural",
    "properties",
    "learning",
    "the conversation",
    "strategies",
    "tutoring dialogue",
    "deep learning algorithms"
  ],
  "url": "https://aclanthology.org/2020.bea-1.5/",
  "provenance": {
    "collected_at": "2025-06-05 07:54:31",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}