{
  "id": "2020.sigmorphon-1.18",
  "title": "Linguist vs. Machine: Rapid Development of Finite-State Morphological Grammars",
  "authors": [
    "Beemer, Sarah  and\nBoston, Zak  and\nBukoski, April  and\nChen, Daniel  and\nDickens, Princess  and\nGerlach, Andrew  and\nHopkins, Torin  and\nAnand Jawale, Parth  and\nKoski, Chris  and\nMalhotra, Akanksha  and\nMishra, Piyush  and\nMuradoglu, Saliha  and\nSang, Lan  and\nShort, Tyler  and\nShreevastava, Sagarika  and\nSpaulding, Elizabeth  and\nUmada, Testumichi  and\nXiang, Beilei  and\nYang, Changbing  and\nHulden, Mans"
  ],
  "year": "2020",
  "venue": "Proceedings of the 17th SIGMORPHON Workshop on Computational Research in Phonetics, Phonology, and Morphology",
  "abstract": "Sequence-to-sequence models have proven to be highly successful in learning morphological inflection from examples as the series of SIGMORPHON/CoNLL shared tasks have shown. It is usually assumed, however, that a linguist working with inflectional examples could in principle develop a gold standard-level morphological analyzer and generator that would surpass a trained neural network model in accuracy of predictions, but that it may require significant amounts of human labor. In this paper, we discuss an experiment where a group of people with some linguistic training develop 25+ grammars as part of the shared task and weigh the cost/benefit ratio of developing grammars by hand. We also present tools that can help linguists triage difficult complex morphophonological phenomena within a language and hypothesize inflectional class membership. We conclude that a significant development effort by trained linguists to analyze and model morphophonological patterns are required in order to surpass the accuracy of neural models.",
  "keywords": [
    "the accuracy",
    "series",
    "we",
    "training",
    "neural",
    "it",
    "sequence",
    "the series",
    "ratio",
    "accuracy",
    "language",
    "model",
    "machine",
    "human",
    "class"
  ],
  "url": "https://aclanthology.org/2020.sigmorphon-1.18/",
  "provenance": {
    "collected_at": "2025-06-05 07:58:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}