{
  "id": "2020.acl-main.115",
  "title": "P}uzz{L}ing {M}achines: {A} {C}hallenge on {L}earning {F}rom {S}mall {D}ata",
  "authors": [
    "{\\c{S}}ahin, G{\\\"o}zde G{\\\"u}l  and\nKementchedjhieva, Yova  and\nRust, Phillip  and\nGurevych, Iryna"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Deep neural models have repeatedly proved excellent at memorizing surface patterns from large datasets for various ML and NLP benchmarks. They struggle to achieve human-like thinking, however, because they lack the skill of iterative reasoning upon knowledge. To expose this problem in a new light, we introduce a challenge on learning from small data, PuzzLing Machines, which consists of Rosetta Stone puzzles from Linguistic Olympiads for high school students. These puzzles are carefully designed to contain only the minimal amount of parallel text necessary to deduce the form of unseen expressions. Solving them does not require external information (e.g., knowledge bases, visual signals) or linguistic expertise, but meta-linguistic awareness and deductive skills. Our challenge contains around 100 puzzles covering a wide range of linguistic phenomena from 81 languages. We show that both simple statistical algorithms and state-of-the-art deep neural models perform inadequately on this challenge, as expected. We hope that this benchmark, available athttps://ukplab.github.io/PuzzLing-Machines/, inspires further efforts towards a new paradigm in NLP—one that is grounded in human-like reasoning and understanding.",
  "keywords": [
    "deep",
    "form",
    "rom",
    "we",
    "ing",
    "neural",
    "information",
    "visual",
    "m",
    "text",
    "nlp benchmarks",
    "knowledge",
    "nlp",
    "human",
    "our challenge"
  ],
  "url": "https://aclanthology.org/2020.acl-main.115/",
  "provenance": {
    "collected_at": "2025-06-05 07:43:46",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}