{
  "id": "2020.acl-main.7",
  "title": "Guiding Variational Response Generator to Exploit Persona",
  "authors": [
    "Wu, Bowen  and\nLi, MengYuan  and\nWang, Zongsheng  and\nChen, Yifu  and\nWong, Derek F.  and\nFeng, Qihang  and\nHuang, Junhong  and\nWang, Baoxun"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Leveraging persona information of users in Neural Response Generators (NRG) to perform personalized conversations has been considered as an attractive and important topic in the research of conversational agents over the past few years. Despite of the promising progress achieved by recent studies in this field, persona information tends to be incorporated into neural networks in the form of user embeddings, with the expectation that the persona can be involved via End-to-End learning. This paper proposes to adopt the personality-related characteristics of human conversations into variational response generators, by designing a specific conditional variational autoencoder based deep model with two new regularization terms employed to the loss function, so as to guide the optimization towards the direction of generating both persona-aware and relevant responses. Besides, to reasonably evaluate the performances of various persona modeling approaches, this paper further presents three direct persona-oriented metrics from different perspectives. The experimental results have shown that our proposed methodology can notably improve the performance of persona-aware response generation, and the metrics are reasonable to evaluate the results.",
  "keywords": [
    "deep",
    "end",
    "two new regularization terms",
    "variational response generators",
    "conversations",
    "autoencoder",
    "field",
    "neural response generators",
    "this field persona information",
    "form",
    "generators",
    "the optimization",
    "three direct persona-oriented metrics",
    "persona-aware response generation",
    "neural"
  ],
  "url": "https://aclanthology.org/2020.acl-main.7/",
  "provenance": {
    "collected_at": "2025-06-05 07:42:21",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}