{
  "id": "2020.acl-main.318",
  "title": "A Graph-based Coarse-to-fine Method for Unsupervised Bilingual Lexicon Induction",
  "authors": [
    "Ren, Shuo  and\nLiu, Shujie  and\nZhou, Ming  and\nMa, Shuai"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Unsupervised bilingual lexicon induction is the task of inducing word translations from monolingual corpora of two languages. Recent methods are mostly based on unsupervised cross-lingual word embeddings, the key to which is to find initial solutions of word translations, followed by the learning and refinement of mappings between the embedding spaces of two languages. However, previous methods find initial solutions just based on word-level information, which may be (1) limited and inaccurate, and (2) prone to contain some noise introduced by the insufficiently pre-trained embeddings of some words. To deal with those issues, in this paper, we propose a novel graph-based paradigm to induce bilingual lexicons in a coarse-to-fine way. We first build a graph for each language with its vertices representing different words. Then we extract word cliques from the graphs and map the cliques of two languages. Based on that, we induce the initial word translation solution with the central words of the aligned cliques. This coarse-to-fine approach not only leverages clique-level information, which is richer and more accurate, but also effectively reduces the bad effect of the noise in the pre-trained embeddings. Finally, we take the initial solution as the seed to learn cross-lingual embeddings, from which we induce bilingual lexicons. Experiments show that our approach improves the performance of bilingual lexicon induction compared with previous methods.",
  "keywords": [
    "word translations",
    "we",
    "graph",
    "translation",
    "the insufficiently pre-trained embeddings",
    "cross",
    "information",
    "the pre-trained embeddings",
    "word",
    "learning",
    "fine",
    "cross-lingual embeddings",
    "the embedding spaces",
    "embeddings",
    "language"
  ],
  "url": "https://aclanthology.org/2020.acl-main.318/",
  "provenance": {
    "collected_at": "2025-06-05 07:46:29",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}