{
  "id": "2020.acl-main.195",
  "title": "M}obile{BERT}: a Compact Task-Agnostic {BERT} for Resource-Limited Devices",
  "authors": [
    "Sun, Zhiqing  and\nYu, Hongkun  and\nSong, Xiaodan  and\nLiu, Renjie  and\nYang, Yiming  and\nZhou, Denny"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Natural Language Processing (NLP) has recently achieved great success by using huge pre-trained models with hundreds of millions of parameters. However, these models suffer from heavy model sizes and high latency such that they cannot be deployed to resource-limited mobile devices. In this paper, we propose MobileBERT for compressing and accelerating the popular BERT model. Like the original BERT, MobileBERT is task-agnostic, that is, it can be generically applied to various downstream NLP tasks via simple fine-tuning. Basically, MobileBERT is a thin version of BERT_LARGE, while equipped with bottleneck structures and a carefully designed balance between self-attentions and feed-forward networks. To train MobileBERT, we first train a specially designed teacher model, an inverted-bottleneck incorporated BERT_LARGE model. Then, we conduct knowledge transfer from this teacher to MobileBERT. Empirical studies show that MobileBERT is 4.3x smaller and 5.5x faster than BERT_BASE while achieving competitive results on well-known benchmarks. On the natural language inference tasks of GLUE, MobileBERT achieves a GLUE score of 77.7 (0.6 lower than BERT_BASE), and 62 ms latency on a Pixel 4 phone. On the SQuAD v1.1/v2.0 question answering task, MobileBERT achieves a dev F1 score of 90.0/79.2 (1.5/2.1 higher than BERT_BASE).",
  "keywords": [
    "attentions",
    "self-attentions and feed-forward networks",
    "question",
    "bert_large",
    "we",
    "natural language processing nlp",
    "natural",
    "the popular bert model",
    "simple fine-tuning",
    "it",
    "basically mobilebert",
    "self",
    "a compact task-agnostic bert",
    "mobilebert",
    "bert_large model"
  ],
  "url": "https://aclanthology.org/2020.acl-main.195/",
  "provenance": {
    "collected_at": "2025-06-05 07:44:50",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}