{
  "id": "2020.fever-1.1",
  "title": "Simple Compounded-Label Training for Fact Extraction and Verification",
  "authors": [
    "Nie, Yixin  and\nBauer, Lisa  and\nBansal, Mohit"
  ],
  "year": "2020",
  "venue": "Proceedings of the Third Workshop on Fact Extraction and VERification (FEVER)",
  "abstract": "Automatic fact checking is an important task motivated by the need for detecting and preventing the spread of misinformation across the web. The recently released FEVER challenge provides a benchmark task that assesses systems’ capability for both the retrieval of required evidence and the identification of authentic claims. Previous approaches share a similar pipeline training paradigm that decomposes the task into three subtasks, with each component built and trained separately. Although achieving acceptable scores, these methods induce difficulty for practical application development due to unnecessary complexity and expensive computation. In this paper, we explore the potential of simplifying the system design and reducing training computation by proposing a joint training setup in which a single sequence matching model is trained with compounded labels that give supervision for both sentence selection and claim verification subtasks, eliminating the duplicate computation that occurs when models are designed and trained separately. Empirical results on FEVER indicate that our method: (1) outperforms the typical multi-task learning approach, and (2) gets comparable results to top performing systems with a much simpler training setup and less training computation (in terms of the amount of data consumed and the number of model parameters), facilitating future works on the automatic fact checking task and its practical usage.",
  "keywords": [
    "extraction",
    "both the retrieval",
    "we",
    "training",
    "retrieval",
    "sequence",
    "model",
    "multi",
    "supervision",
    "approach",
    "the web",
    "comparable results",
    "duplicate",
    "paradigm",
    "previous"
  ],
  "url": "https://aclanthology.org/2020.fever-1.1/",
  "provenance": {
    "collected_at": "2025-06-05 07:55:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}