{
  "id": "2020.acl-main.634",
  "title": "Diversifying Dialogue Generation with Non-Conversational Text",
  "authors": [
    "Su, Hui  and\nShen, Xiaoyu  and\nZhao, Sanqiang  and\nXiao, Zhou  and\nHu, Pengwei  and\nZhong, Randy  and\nNiu, Cheng  and\nZhou, Jie"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Neural network-based sequence-to-sequence (seq2seq) models strongly suffer from the low-diversity problem when it comes to open-domain dialogue generation. As bland and generic utterances usually dominate the frequency distribution in our daily chitchat, avoiding them to generate more interesting responses requires complex data filtering, sampling techniques or modifying the training objective. In this paper, we propose a new perspective to diversify dialogue generation by leveragingnon-conversationaltext. Compared with bilateral conversations, non-conversational text are easier to obtain, more diverse and cover a much broader range of topics. We collect a large-scale non-conversational corpus from multi sources including forum comments, idioms and book snippets. We further present a training paradigm to effectively incorporate these text via iterative back translation. The resulting model is tested on two conversational datasets from different domains and is shown to produce significantly more diverse responses without sacrificing the relevance with context.",
  "keywords": [
    "a large-scale non-conversational corpus",
    "conversations",
    "the training objective",
    "we",
    "leveragingnon-conversationaltext",
    "dialogue",
    "conversationaltext",
    "training",
    "translation",
    "bilateral conversations non-conversational text",
    "neural",
    "it",
    "iterative back translation",
    "dialogue generation",
    "sequence"
  ],
  "url": "https://aclanthology.org/2020.acl-main.634/",
  "provenance": {
    "collected_at": "2025-06-05 07:50:41",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}