{
  "id": "2020.acl-main.599",
  "title": "Document Modeling with Graph Attention Networks for Multi-grained Machine Reading Comprehension",
  "authors": [
    "Zheng, Bo  and\nWen, Haoyang  and\nLiang, Yaobo  and\nDuan, Nan  and\nChe, Wanxiang  and\nJiang, Daxin  and\nZhou, Ming  and\nLiu, Ting"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Natural Questions is a new challenging machine reading comprehension benchmark with two-grained answers, which are a long answer (typically a paragraph) and a short answer (one or more entities inside the long answer). Despite the effectiveness of existing methods on this benchmark, they treat these two sub-tasks individually during training while ignoring their dependencies. To address this issue, we present a novel multi-grained machine reading comprehension framework that focuses on modeling documents at their hierarchical nature, which are different levels of granularity: documents, paragraphs, sentences, and tokens. We utilize graph attention networks to obtain different levels of representations so that they can be learned simultaneously. The long and short answers can be extracted from paragraph-level representation and token-level representation, respectively. In this way, we can model the dependencies between the two-grained answers to provide evidence for each other. We jointly train the two sub-tasks, and our experiments show that our approach significantly outperforms previous systems at both long and short answer criteria.",
  "keywords": [
    "hierarchical",
    "answer",
    "graph attention networks",
    "natural",
    "machine",
    "entities",
    "token",
    "-",
    "dependencies",
    "their dependencies",
    "the dependencies",
    "attention",
    "we",
    "their hierarchical nature",
    "graph"
  ],
  "url": "https://aclanthology.org/2020.acl-main.599/",
  "provenance": {
    "collected_at": "2025-06-05 07:50:13",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}