{
  "id": "2020.acl-demos.37",
  "title": "MMPE}: {A} {M}ulti-{M}odal {I}nterface using {H}andwriting, {T}ouch {R}eordering, and {S}peech {C}ommands for {P}ost-{E}diting {M}achine {T}ranslation",
  "authors": [
    "Herbig, Nico  and\nPal, Santanu  and\nD{\\\"u}wel, Tim  and\nMeladaki, Kalliopi  and\nMonshizadeh, Mahsa  and\nHnatovskiy, Vladislav  and\nKr{\\\"u}ger, Antonio  and\nvan Genabith, Josef"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics: System Demonstrations",
  "abstract": "The shift from traditional translation to post-editing (PE) of machine-translated (MT) text can save time and reduce errors, but it also affects the design of translation interfaces, as the task changes from mainly generating text to correcting errors within otherwise helpful translation proposals. Since this paradigm shift offers potential for modalities other than mouse and keyboard, we present MMPE, the first prototype to combine traditional input modes with pen, touch, and speech modalities for PE of MT. Users can directly cross out or hand-write new text, drag and drop words for reordering, or use spoken commands to update the text in place. All text manipulations are logged in an easily interpretable format to simplify subsequent translation process research. The results of an evaluation with professional translators suggest that pen and touch interaction are suitable for deletion and reordering tasks, while speech and multi-modal combinations of select & speech are considered suitable for replacements and insertions. Overall, experiment participants were enthusiastic about the new modalities and saw them as useful extensions to mouse & keyboard, but not as a complete substitute.",
  "keywords": [
    "the new modalities",
    "we",
    "otherwise helpful translation proposals",
    "translation",
    "it",
    "c",
    "format",
    "an evaluation",
    "m",
    "pen",
    "traditional translation",
    "i",
    "text",
    "pe",
    "speech modalities"
  ],
  "url": "https://aclanthology.org/2020.acl-demos.37/",
  "provenance": {
    "collected_at": "2025-06-05 07:53:10",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}