{
  "id": "2020.bea-1.18",
  "title": "Automated Scoring of Clinical Expressive Language Evaluation Tasks",
  "authors": [
    "Wang, Yiyi  and\nPrud{'}hommeaux, Emily  and\nAsgari, Meysam  and\nDolata, Jill"
  ],
  "year": "2020",
  "venue": "Proceedings of the Fifteenth Workshop on Innovative Use of NLP for Building Educational Applications",
  "abstract": "Many clinical assessment instruments used to diagnose language impairments in children include a task in which the subject must formulate a sentence to describe an image using a specific target word. Because producing sentences in this way requires the speaker to integrate syntactic and semantic knowledge in a complex manner, responses are typically evaluated on several different dimensions of appropriateness yielding a single composite score for each response. In this paper, we present a dataset consisting of non-clinically elicited responses for three related sentence formulation tasks, and we propose an approach for automatically evaluating their appropriateness. We use neural machine translation to generate correct-incorrect sentence pairs in order to create synthetic data to increase the amount and diversity of training data for our scoring model. Our scoring model uses transfer learning to facilitate automatic sentence appropriateness evaluation. We further compare custom word embeddings with pre-trained contextualized embeddings serving as features for our scoring model. We find that transfer learning improves scoring accuracy, particularly when using pretrained contextualized embeddings.",
  "keywords": [
    "custom word embeddings",
    "neural machine translation",
    "pre-trained contextualized embeddings",
    "semantic",
    "we",
    "syntactic and semantic knowledge",
    "translation",
    "training",
    "neural",
    "a complex manner responses",
    "word",
    "learning",
    "transfer",
    "transfer learning",
    "manner"
  ],
  "url": "https://aclanthology.org/2020.bea-1.18/",
  "provenance": {
    "collected_at": "2025-06-05 07:54:41",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}