{
  "id": "2020.acl-main.207",
  "title": "SPECTER}: Document-level Representation Learning using Citation-informed Transformers",
  "authors": [
    "Cohan, Arman  and\nFeldman, Sergey  and\nBeltagy, Iz  and\nDowney, Doug  and\nWeld, Daniel"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Representation learning is a critical ingredient for natural language processing systems. Recent Transformer language models like BERT learn powerful textual representations, but these models are targeted towards token- and sentence-level training objectives and do not leverage information on inter-document relatedness, which limits their document-level representation power. For applications on scientific documents, such as classification and recommendation, accurate embeddings of documents are a necessity. We propose SPECTER, a new method to generate document-level embedding of scientific papers based on pretraining a Transformer language model on a powerful signal of document-level relatedness: the citation graph. Unlike existing pretrained language models, Specter can be easily applied to downstream applications without task-specific fine-tuning. Additionally, to encourage further research on document-level models, we introduce SciDocs, a new evaluation benchmark consisting of seven document-level tasks ranging from citation prediction, to document classification and recommendation. We show that Specter outperforms a variety of competitive baselines on the benchmark.",
  "keywords": [
    "scientific documents",
    "variety",
    "natural language processing systems",
    "transformers",
    "objectives",
    "we",
    "accurate embeddings",
    "graph",
    "training",
    "recent transformer language models",
    "classification",
    "natural",
    "information",
    "a transformer language model",
    "learning"
  ],
  "url": "https://aclanthology.org/2020.acl-main.207/",
  "provenance": {
    "collected_at": "2025-06-05 07:44:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}