{
  "id": "2020.bionlp-1.5",
  "title": "D}e{S}pin: a prototype system for detecting spin in biomedical publications",
  "authors": [
    "Koroleva, Anna  and\nKamath, Sanjay  and\nBossuyt, Patrick  and\nParoubek, Patrick"
  ],
  "year": "2020",
  "venue": "Proceedings of the 19th SIGBioMed Workshop on Biomedical Language Processing",
  "abstract": "Improving the quality of medical research reporting is crucial to reduce avoidable waste in research and to improve the quality of health care. Despite various initiatives aiming at improving research reporting – guidelines, checklists, authoring aids, peer review procedures, etc. – overinterpretation of research results, also known as spin, is still a serious issue in research reporting. In this paper, we propose a Natural Language Processing (NLP) system for detecting several types of spin in biomedical articles reporting randomized controlled trials (RCTs). We use a combination of rule-based and machine learning approaches to extract important information on trial design and to detect potential spin. The proposed spin detection system includes algorithms for text structure analysis, sentence classification, entity and relation extraction, semantic similarity assessment. Our algorithms achieved operational performance for the these tasks, F-measure ranging from 79,42 to 97.86% for different tasks. The most difficult task is extracting reported outcomes. Our tool is intended to be used as a semi-automated aid tool for assisting both authors and peer reviewers to detect potential spin. The tool incorporates a simple interface that allows to run the algorithms and visualize their output. It can also be used for manual annotation and correction of the errors in the outputs. The proposed tool is the first tool for spin detection. The tool and the annotated dataset are freely available.",
  "keywords": [
    "extraction",
    "semantic",
    "we",
    "classification",
    "pin",
    "natural",
    "it",
    "information",
    "learning",
    "analysis",
    "processing",
    "text",
    "reviewers",
    "language",
    "nlp"
  ],
  "url": "https://aclanthology.org/2020.bionlp-1.5/",
  "provenance": {
    "collected_at": "2025-06-05 07:54:49",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}