{
  "id": "2020.acl-main.308",
  "title": "What Was Written vs. Who Read It: News Media Profiling Using Text Analysis and Social Media Context",
  "authors": [
    "Baly, Ramy  and\nKaradzhov, Georgi  and\nAn, Jisun  and\nKwak, Haewoon  and\nDinkov, Yoan  and\nAli, Ahmed  and\nGlass, James  and\nNakov, Preslav"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Predicting the political bias and the factuality of reporting of entire news outlets are critical elements of media profiling, which is an understudied but an increasingly important research direction. The present level of proliferation of fake, biased, and propagandistic content online has made it impossible to fact-check every single suspicious claim, either manually or automatically. Thus, it has been proposed to profile entire news outlets and to look for those that are likely to publish fake or biased content. This makes it possible to detect likely “fake news” the moment they are published, by simply checking the reliability of their source. From a practical perspective, political bias and factuality of reporting have a linguistic aspect but also a social context. Here, we study the impact of both, namely (i) what was written (i.e., what was published by the target medium, and how it describes itself in Twitter) vs. (ii) who reads it (i.e., analyzing the target medium’s audience on social media). We further study (iii) what was written about the target medium (in Wikipedia). The evaluation results show that what was written matters most, and we further show that putting all information sources together yields huge improvements over the current state-of-the-art.",
  "keywords": [
    "the evaluation results",
    "bias",
    "audience",
    "we",
    "current",
    "fake or biased content",
    "it",
    "information",
    "understudied",
    "biased",
    "analysis",
    "i",
    "text",
    "moment",
    "the political bias"
  ],
  "url": "https://aclanthology.org/2020.acl-main.308/",
  "provenance": {
    "collected_at": "2025-06-05 07:46:20",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}