{
  "id": "2020.bea-1.3",
  "title": "Multiple Instance Learning for Content Feedback Localization without Annotation",
  "authors": [
    "Hellman, Scott  and\nMurray, William  and\nWiemerslage, Adam  and\nRosenstein, Mark  and\nFoltz, Peter  and\nBecker, Lee  and\nDerr, Marcia"
  ],
  "year": "2020",
  "venue": "Proceedings of the Fifteenth Workshop on Innovative Use of NLP for Building Educational Applications",
  "abstract": "Automated Essay Scoring (AES) can be used to automatically generate holistic scores with reliability comparable to human scoring. In addition, AES systems can provide formative feedback to learners, typically at the essay level. In contrast, we are interested in providing feedback specialized to the content of the essay, and specifically for the content areas required by the rubric. A key objective is that the feedback should be localized alongside the relevant essay text. An important step in this process is determining where in the essay the rubric designated points and topics are discussed. A natural approach to this task is to train a classifier using manually annotated data; however, collecting such data is extremely resource intensive. Instead, we propose a method to predict these annotation spans without requiring any labeled annotation data. Our approach is to consider AES as a Multiple Instance Learning (MIL) task. We show that such models can both predict content scores and localize content by leveraging their sentence-level score predictions. This capability arises despite never having access to annotation training data. Implications are discussed for improving formative feedback and explainable AES models.",
  "keywords": [
    "feedback",
    "classifier",
    "we",
    "training",
    "natural",
    "a key objective",
    "learning",
    "text",
    "objective",
    "process",
    "learners",
    "human",
    "a classifier",
    "a multiple instance",
    "rubric"
  ],
  "url": "https://aclanthology.org/2020.bea-1.3/",
  "provenance": {
    "collected_at": "2025-06-05 07:54:29",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}