{
  "id": "2020.acl-main.178",
  "title": "Recollection versus Imagination: Exploring Human Memory and Cognition via Neural Language Models",
  "authors": [
    "Sap, Maarten  and\nHorvitz, Eric  and\nChoi, Yejin  and\nSmith, Noah A.  and\nPennebaker, James"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "We investigate the use of NLP as a measure of the cognitive processes involved in storytelling, contrasting imagination and recollection of events. To facilitate this, we collect and release Hippocorpus, a dataset of 7,000 stories about imagined and recalled events. We introduce a measure of narrative flow and use this to examine the narratives for imagined and recalled events. Additionally, we measure the differential recruitment of knowledge attributed to semantic memory versus episodic memory (Tulving, 1972) for imagined and recalled storytelling by comparing the frequency of descriptions of general commonsense events with more specific realis events. Our analyses show that imagined stories have a substantially more linear narrative flow, compared to recalled stories in which adjacent sentences are more disconnected. In addition, while recalled stories rely more on autobiographical events based on episodic memory, imagined stories express more commonsense knowledge based on semantic memory. Finally, our measures reveal the effect of narrativization of memories in stories (e.g., stories about frequently recalled memories flow more linearly; Bartlett, 1932). Our findings highlight the potential of using NLP tools to study the traces of human cognition in language.",
  "keywords": [
    "memories",
    "general commonsense events",
    "nlp tools",
    "semantic",
    "semantic memory",
    "we",
    "neural language models",
    "e g stories",
    "neural",
    "imagined stories",
    "imagined and recalled events",
    "recalled stories",
    "stories",
    "frequently recalled memories",
    "general"
  ],
  "url": "https://aclanthology.org/2020.acl-main.178/",
  "provenance": {
    "collected_at": "2025-06-05 07:44:36",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}