{
  "id": "2020.nli-1.4",
  "title": "Efficient Deployment of Conversational Natural Language Interfaces over Databases",
  "authors": [
    "Colas, Anthony  and\nBui, Trung  and\nDernoncourt, Franck  and\nSinha, Moumita  and\nKim, Doo Soon"
  ],
  "year": "2020",
  "venue": "Proceedings of the First Workshop on Natural Language Interfaces",
  "abstract": "Many users communicate with chatbots and AI assistants in order to help them with various tasks. A key component of the assistant is the ability to understand and answer a user’s natural language questions for question-answering (QA). Because data can be usually stored in a structured manner, an essential step involves turning a natural language question into its corresponding query language. However, in order to train most natural language-to-query-language state-of-the-art models, a large amount of training data is needed first. In most domains, this data is not available and collecting such datasets for various domains can be tedious and time-consuming. In this work, we propose a novel method for accelerating the training dataset collection for developing the natural language-to-query-language machine learning models. Our system allows one to generate conversational multi-term data, where multiple turns define a dialogue session, enabling one to better utilize chatbot interfaces. We train two current state-of-the-art NL-to-QL models, on both an SQL and SPARQL-based datasets in order to showcase the adaptability and efficacy of our created data.",
  "keywords": [
    "efficient",
    "question",
    "we",
    "dialogue",
    "question-answering qa",
    "current",
    "training",
    "chatbot",
    "chatbot interfaces",
    "natural",
    "learning",
    "efficient deployment",
    "manner",
    "chatbots",
    "conversational multi-term data"
  ],
  "url": "https://aclanthology.org/2020.nli-1.4/",
  "provenance": {
    "collected_at": "2025-06-05 07:57:22",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}