{
  "id": "2020.acl-main.555",
  "title": "Leveraging Graph to Improve Abstractive Multi-Document Summarization",
  "authors": [
    "Li, Wei  and\nXiao, Xinyan  and\nLiu, Jiachen  and\nWu, Hua  and\nWang, Haifeng  and\nDu, Junping"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Graphs that capture relations between textual units have great benefits for detecting salient information from multiple documents and generating overall coherent summaries. In this paper, we develop a neural abstractive multi-document summarization (MDS) model which can leverage well-known graph representations of documents such as similarity graph and discourse graph, to more effectively process multiple input documents and produce abstractive summaries. Our model utilizes graphs to encode documents in order to capture cross-document relations, which is crucial to summarizing long documents. Our model can also take advantage of graphs to guide the summary generation process, which is beneficial for generating coherent and concise summaries. Furthermore, pre-trained language models can be easily combined with our model, which further improve the summarization performance significantly. Empirical results on the WikiSum and MultiNews dataset show that the proposed architecture brings substantial improvements over several strong baselines.",
  "keywords": [
    "encode",
    "summarization",
    "we",
    "abstractive multi-document summarization graphs",
    "graph",
    "the summary generation process",
    "salient information",
    "overall coherent summaries",
    "cross",
    "the summarization performance",
    "neural",
    "pre-trained language models",
    "information",
    "coherent and concise summaries",
    "abstractive summaries"
  ],
  "url": "https://aclanthology.org/2020.acl-main.555/",
  "provenance": {
    "collected_at": "2025-06-05 07:49:38",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}