{
  "id": "2020.nuse-1.6",
  "title": "Exploring the Effect of Author and Reader Identity in Online Story Writing: the {STORIESINTHEWILD} Corpus.",
  "authors": [
    "August, Tal  and\nSap, Maarten  and\nClark, Elizabeth  and\nReinecke, Katharina  and\nSmith, Noah A."
  ],
  "year": "2020",
  "venue": "Proceedings of the First Joint Workshop on Narrative Understanding, Storylines, and Events",
  "abstract": "Current story writing or story editing systems rely on human judgments of story quality for evaluating performance, often ignoring the subjectivity in ratings. We analyze the effect of author and reader characteristics and story writing setup on the quality of stories in a short storytelling task. To study this effect, we create and release STORIESINTHEWILD, containing 1,630 stories collected on a volunteer-based crowdsourcing platform. Each story is rated by three different readers, and comes paired with the author’s and reader’s age, gender, and personality. Our findings show significant effects of authors’ and readers’ identities, as well as writing setup, on story writing and ratings. Notably, compared to younger readers, readers age 45 and older consider stories significantly less creative and less entertaining. Readers also prefer stories written all at once, rather than in chunks, finding them more coherent and creative. We also observe linguistic differences associated with authors’ demographics (e.g., older authors wrote more vivid and emotional stories). Our findings suggest that reader and writer demographics, as well as writing setup, should be accounted for in story writing evaluations.",
  "keywords": [
    "evaluations",
    "human",
    "identities",
    "readers identities",
    "storiesinthewild",
    "stories",
    "we",
    "age",
    "1 630 stories",
    "current",
    "authors demographics e",
    "each story",
    "younger",
    "writing",
    "coherent"
  ],
  "url": "https://aclanthology.org/2020.nuse-1.6/",
  "provenance": {
    "collected_at": "2025-06-05 07:57:51",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}