{
  "id": "2020.figlang-1.22",
  "title": "Adaptation of Word-Level Benchmark Datasets for Relation-Level Metaphor Identification",
  "authors": [
    "Zayed, Omnia  and\nMcCrae, John Philip  and\nBuitelaar, Paul"
  ],
  "year": "2020",
  "venue": "Proceedings of the Second Workshop on Figurative Language Processing",
  "abstract": "Metaphor processing and understanding has attracted the attention of many researchers recently with an increasing number of computational approaches. A common factor among these approaches is utilising existing benchmark datasets for evaluation and comparisons. The availability, quality and size of the annotated data are among the main difficulties facing the growing research area of metaphor processing. The majority of current approaches pertaining to metaphor processing concentrate on word-level processing due to data availability. On the other hand, approaches that process metaphors on the relation-level ignore the context where the metaphoric expression. This is due to the nature and format of the available data. Word-level annotation is poorly grounded theoretically and is harder to use in downstream tasks such as metaphor interpretation. The conversion from word-level to relation-level annotation is non-trivial. In this work, we attempt to fill this research gap by adapting three benchmark datasets, namely the VU Amsterdam metaphor corpus, the TroFi dataset and the TSV dataset, to suit relation-level metaphor identification. We publish the adapted datasets to facilitate future research in relation-level metaphor processing.",
  "keywords": [
    "we",
    "current",
    "format",
    "word",
    "difficulties",
    "processing",
    "work",
    "process",
    "attention",
    "evaluation",
    "the attention",
    "the main difficulties",
    "area",
    "expression",
    "future research"
  ],
  "url": "https://aclanthology.org/2020.figlang-1.22/",
  "provenance": {
    "collected_at": "2025-06-05 07:55:50",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}