{
  "id": "2020.bionlp-1.14",
  "title": "Personalized Early Stage {A}lzheimer{'}s Disease Detection: A Case Study of President {R}eagan{'}s Speeches",
  "authors": [
    "Wang, Ning  and\nLuo, Fan  and\nPeddagangireddy, Vishal  and\nSubbalakshmi, Koduvayur  and\nChandramouli, Rajarathnam"
  ],
  "year": "2020",
  "venue": "Proceedings of the 19th SIGBioMed Workshop on Biomedical Language Processing",
  "abstract": "Alzheimer’s disease (AD)-related global healthcare cost is estimated to be $1 trillion by 2050. Currently, there is no cure for this disease; however, clinical studies show that early diagnosis and intervention helps to extend the quality of life and inform technologies for personalized mental healthcare. Clinical research indicates that the onset and progression of Alzheimer’s disease lead to dementia and other mental health issues. As a result, the language capabilities of patient start to decline. In this paper, we show that machine learning-based unsupervised clustering of and anomaly detection with linguistic biomarkers are promising approaches for intuitive visualization and personalized early stage detection of Alzheimer’s disease. We demonstrate this approach on 10 year’s (1980 to 1989) of President Ronald Reagan’s speech data set. Key linguistic biomarkers that indicate early-stage AD are identified. Experimental results show that Reagan had early onset of Alzheimer’s sometime between 1983 and 1987. This finding is corroborated by prior work that analyzed his interviews using a statistical technique. The proposed technique also identifies the exact speeches that reflect linguistic biomarkers for early stage AD.",
  "keywords": [
    "we",
    "interviews",
    "technologies",
    "the language capabilities",
    "learning",
    "patient start",
    "clinical studies",
    "early",
    "intuitive visualization",
    "his interviews",
    "visualization",
    "work",
    "language",
    "studies",
    "machine"
  ],
  "url": "https://aclanthology.org/2020.bionlp-1.14/",
  "provenance": {
    "collected_at": "2025-06-05 07:54:56",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}