{
  "id": "2020.acl-main.117",
  "title": "The {T}ech{QA} Dataset",
  "authors": [
    "Castelli, Vittorio  and\nChakravarti, Rishav  and\nDana, Saswati  and\nFerritto, Anthony  and\nFlorian, Radu  and\nFranz, Martin  and\nGarg, Dinesh  and\nKhandelwal, Dinesh  and\nMcCarley, Scott  and\nMcCawley, Michael  and\nNasr, Mohamed  and\nPan, Lin  and\nPendus, Cezar  and\nPitrelli, John  and\nPujar, Saurabh  and\nRoukos, Salim  and\nSakrajda, Andrzej  and\nSil, Avi  and\nUceda-Sosa, Rosario  and\nWard, Todd  and\nZhang, Rong"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "We introduce TECHQA, a domain-adaptation question answering dataset for the technical support domain. The TECHQA corpus highlights two real-world issues from the automated customer support domain. First, it contains actual questions posed by users on a technical forum, rather than questions generated specifically for a competition or a task. Second, it has a real-world size – 600 training, 310 dev, and 490 evaluation question/answer pairs – thus reflecting the cost of creating large labeled datasets with actual data. Hence, TECHQA is meant to stimulate research in domain adaptation rather than as a resource to build QA systems from scratch. TECHQA was obtained by crawling the IBMDeveloper and DeveloperWorks forums for questions with accepted answers provided in an IBM Technote—a technical document that addresses a specific technical issue. We also release a collection of the 801,998 Technotes available on the web as of April 4, 2019 as a companion resource that can be used to learn representations of the IT domain language.",
  "keywords": [
    "support",
    "hence techqa",
    "techqa",
    "question",
    "we",
    "training",
    "qa dataset",
    "answer",
    "it",
    "the techqa corpus",
    "scratch techqa",
    "language",
    "qa systems",
    "evaluation",
    "forums"
  ],
  "url": "https://aclanthology.org/2020.acl-main.117/",
  "provenance": {
    "collected_at": "2025-06-05 07:43:48",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}