{
  "id": "2020.bionlp-1.18",
  "title": "Benchmark and Best Practices for Biomedical Knowledge Graph Embeddings",
  "authors": [
    "Chang, David  and\nBala{\\v{z}}evi{\\'c}, Ivana  and\nAllen, Carl  and\nChawla, Daniel  and\nBrandt, Cynthia  and\nTaylor, Andrew"
  ],
  "year": "2020",
  "venue": "Proceedings of the 19th SIGBioMed Workshop on Biomedical Language Processing",
  "abstract": "Much of biomedical and healthcare data is encoded in discrete, symbolic form such as text and medical codes. There is a wealth of expert-curated biomedical domain knowledge stored in knowledge bases and ontologies, but the lack of reliable methods for learning knowledge representation has limited their usefulness in machine learning applications. While text-based representation learning has significantly improved in recent years through advances in natural language processing, attempts to learn biomedical concept embeddings so far have been lacking. A recent family of models called knowledge graph embeddings have shown promising results on general domain knowledge graphs, and we explore their capabilities in the biomedical domain. We train several state-of-the-art knowledge graph embedding models on the SNOMED-CT knowledge graph, provide a benchmark with comparison to existing methods and in-depth discussion on best practices, and make a case for the importance of leveraging the multi-relational nature of knowledge graphs for learning biomedical knowledge representation. The embeddings, code, and materials will be made available to the community.",
  "keywords": [
    "code",
    "form",
    "we",
    "graph",
    "natural",
    "ontologies",
    "the snomed-ct knowledge graph",
    "knowledge graphs",
    "learning",
    "biomedical concept embeddings",
    "machine learning applications",
    "the embeddings code",
    "general domain knowledge graphs",
    "processing",
    "text"
  ],
  "url": "https://aclanthology.org/2020.bionlp-1.18/",
  "provenance": {
    "collected_at": "2025-06-05 07:54:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}