{
  "id": "2020.acl-main.49",
  "title": "Integrating Semantic and Structural Information with Graph Convolutional Network for Controversy Detection",
  "authors": [
    "Zhong, Lei  and\nCao, Juan  and\nSheng, Qiang  and\nGuo, Junbo  and\nWang, Ziang"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Identifying controversial posts on social media is a fundamental task for mining public sentiment, assessing the influence of events, and alleviating the polarized views. However, existing methods fail to 1) effectively incorporate the semantic information from content-related posts; 2) preserve the structural information for reply relationship modeling; 3) properly handle posts from topics dissimilar to those in the training set. To overcome the first two limitations, we propose Topic-Post-Comment Graph Convolutional Network (TPC-GCN), which integrates the information from the graph structure and content of topics, posts, and comments for post-level controversy detection. As to the third limitation, we extend our model to Disentangled TPC-GCN (DTPC-GCN), to disentangle topic-related and topic-unrelated features and then fuse dynamically. Extensive experiments on two real-world datasets demonstrate that our models outperform existing methods. Analysis of the results and cases proves that our models can integrate both semantic and structural information with significant generalizability.",
  "keywords": [
    "semantic",
    "we",
    "generalizability",
    "the polarized views",
    "graph",
    "convolutional",
    "significant generalizability",
    "training",
    "the semantic information",
    "information",
    "views",
    "analysis",
    "semantic and structural information",
    "topic",
    "sentiment"
  ],
  "url": "https://aclanthology.org/2020.acl-main.49/",
  "provenance": {
    "collected_at": "2025-06-05 07:42:54",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}