{
  "id": "2020.socialnlp-1.6",
  "title": "Challenges in Emotion Style Transfer: An Exploration with a Lexical Substitution Pipeline",
  "authors": [
    "Helbig, David  and\nTroiano, Enrica  and\nKlinger, Roman"
  ],
  "year": "2020",
  "venue": "Proceedings of the Eighth International Workshop on Natural Language Processing for Social Media",
  "abstract": "We propose the task of emotion style transfer, which is particularly challenging, as emotions (here: anger, disgust, fear, joy, sadness, surprise) are on the fence between content and style. To understand the particular difficulties of this task, we design a transparent emotion style transfer pipeline based on three steps: (1) select the words that are promising to be substituted to change the emotion (with a brute-force approach and selection based on the attention mechanism of an emotion classifier), (2) find sets of words as candidates for substituting the words (based on lexical and distributional semantics), and (3) select the most promising combination of substitutions with an objective function which consists of components for content (based on BERT sentence embeddings), emotion (based on an emotion classifier), and fluency (based on a neural language model). This comparably straight-forward setup enables us to explore the task and understand in what cases lexical substitution can vary the emotional load of texts, how changes in content and style interact and if they are at odds. We further evaluate our pipeline quantitatively in an automated and an annotation study based on Tweets and find, indeed, that simultaneous adjustments of content and emotion are conflicting objectives: as we show in a qualitative analysis motivated by Scherer’s emotion component model, this is particularly the case for implicit emotion expressions based on cognitive appraisal or descriptions of bodily reactions.",
  "keywords": [
    "objectives",
    "classifier",
    "we",
    "force",
    "lexical and distributional semantics",
    "bert sentence embeddings emotion",
    "neural",
    "semantics",
    "transfer",
    "difficulties",
    "analysis",
    "bert",
    "objective",
    "the particular difficulties",
    "function"
  ],
  "url": "https://aclanthology.org/2020.socialnlp-1.6/",
  "provenance": {
    "collected_at": "2025-06-05 07:58:50",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}