{
  "id": "2020.acl-main.670",
  "title": "S}ci{REX}: {A} Challenge Dataset for Document-Level Information Extraction",
  "authors": [
    "Jain, Sarthak  and\nvan Zuylen, Madeleine  and\nHajishirzi, Hannaneh  and\nBeltagy, Iz"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Extracting information from full documents is an important problem in many domains, but most previous work focus on identifying relationships within a sentence or a paragraph. It is challenging to create a large-scale information extraction (IE) dataset at the document level since it requires an understanding of the whole document to annotate entities and their document-level relationships that usually span beyond sentences or even sections. In this paper, we introduce SciREX, a document level IE dataset that encompasses multiple IE tasks, including salient entity identification and document level N-ary relation identification from scientific articles. We annotate our dataset by integrating automatic and human annotations, leveraging existing scientific knowledge resources. We develop a neural model as a strong baseline that extends previous state-of-the-art IE models to document-level IE. Analyzing the model performance shows a significant gap between human performance and current baselines, inviting the community to use our dataset as a challenge to develop document-level IE models. Our data and code are publicly available athttps://github.com/allenai/SciREX.",
  "keywords": [
    "code",
    "extraction",
    "we",
    "current",
    "a large-scale information extraction",
    "neural",
    "existing scientific knowledge resources",
    "it",
    "information",
    "ie dataset",
    "scientific",
    "scientific articles",
    "work",
    "knowledge",
    "salient entity identification"
  ],
  "url": "https://aclanthology.org/2020.acl-main.670/",
  "provenance": {
    "collected_at": "2025-06-05 07:51:11",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}