{
  "id": "2020.acl-main.112",
  "title": "Learning and Evaluating Emotion Lexicons for 91 Languages",
  "authors": [
    "Buechel, Sven  and\nR{\\\"u}cker, Susanna  and\nHahn, Udo"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Emotion lexicons describe the affective meaning of words and thus constitute a centerpiece for advanced sentiment and emotion analysis. Yet, manually curated lexicons are only available for a handful of languages, leaving most languages of the world without such a precious resource for downstream applications. Even worse, their coverage is often limited both in terms of the lexical units they contain and the emotional variables they feature. In order to break this bottleneck, we here introduce a methodology for creating almost arbitrarily large emotion lexicons for any target language. Our approach requires nothing but a source language emotion lexicon, a bilingual word translation model, and a target language embedding model. Fulfilling these requirements for 91 languages, we are able to generate representationally rich high-coverage lexicons comprising eight emotional variables with more than 100k lexical entries each. We evaluated the automatically generated lexicons against human judgment from 26 datasets, spanning 12 typologically diverse languages, and found that our approach produces results in line with state-of-the-art monolingual approaches to lexicon creation and even surpasses human reliability for some languages and variables. Code and data are available athttps://github.com/JULIELab/MEmoLonarchived under DOI 10.5281/zenodo.3779901.",
  "keywords": [
    "code",
    "embedding model",
    "entries",
    "we",
    "the automatically generated lexicons",
    "translation",
    "rich",
    "word",
    "analysis",
    "a centerpiece",
    "julielab",
    "sentiment",
    "language",
    "model",
    "human"
  ],
  "url": "https://aclanthology.org/2020.acl-main.112/",
  "provenance": {
    "collected_at": "2025-06-05 07:43:44",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}