{
  "id": "2020.acl-main.99",
  "title": "Unknown Intent Detection Using {G}aussian Mixture Model with an Application to Zero-shot Intent Classification",
  "authors": [
    "Fan, Lu  and\nYan, Guangfeng  and\nLi, Qimai  and\nLiu, Han  and\nZhang, Xiaotong  and\nLam, Albert Y.S.  and\nWu, Xiao-Ming"
  ],
  "year": "2020",
  "venue": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "User intent classification plays a vital role in dialogue systems. Since user intent may frequently change over time in many realistic scenarios, unknown (new) intent detection has become an essential problem, where the study has just begun. This paper proposes a semantic-enhanced Gaussian mixture model (SEG) for unknown intent detection. In particular, we model utterance embeddings with a Gaussian mixture distribution and inject dynamic class semantic information into Gaussian means, which enables learning more class-concentrated embeddings that help to facilitate downstream outlier detection. Coupled with a density-based outlier detection algorithm, SEG achieves competitive results on three real task-oriented dialogue datasets in two languages for unknown intent detection. On top of that, we propose to integrate SEG as an unknown intent identifier into existing generalized zero-shot intent classification models to improve their performance. A case study on a state-of-the-art method, ReCapsNet, shows that SEG can push the classification performance to a significantly higher level.",
  "keywords": [
    "top",
    "semantic",
    "more class-concentrated embeddings",
    "we",
    "dialogue",
    "shot",
    "classification",
    "means",
    "dynamic class semantic information",
    "outlier",
    "dialogue systems",
    "information",
    "the classification performance",
    "identifier",
    "embeddings"
  ],
  "url": "https://aclanthology.org/2020.acl-main.99/",
  "provenance": {
    "collected_at": "2025-06-05 07:43:33",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}