{
  "id": "2021.starsem-1.14",
  "title": "Disentangling Online Chats with {DAG}-structured {LSTM}s",
  "authors": [
    "Pappadopulo, Duccio  and\nBauer, Lisa  and\nFarina, Marco  and\n{\\.I}rsoy, Ozan  and\nBansal, Mohit"
  ],
  "year": "2021",
  "venue": "Proceedings of *SEM 2021: The Tenth Joint Conference on Lexical and Computational Semantics",
  "abstract": "Many modern messaging systems allow fast and synchronous textual communication among many users. The resulting sequence of messages hides a more complicated structure in which independent sub-conversations are interwoven with one another. This poses a challenge for any task aiming to understand the content of the chat logs or gather information from them. The ability to disentangle these conversations is then tantamount to the success of many downstream tasks such as summarization and question answering. Structured information accompanying the text such as user turn, user mentions, timestamps, is used as a cue by the participants themselves who need to follow the conversation and has been shown to be important for disentanglement. DAG-LSTMs, a generalization of Tree-LSTMs that can handle directed acyclic dependencies, are a natural way to incorporate such information and its non-sequential nature. In this paper, we apply DAG-LSTMs to the conversation disentanglement task. We perform our experiments on the Ubuntu IRC dataset. We show that the novel model we propose achieves state of the art status on the task of recovering reply-to relations and it is competitive on other disentanglement metrics.",
  "keywords": [
    "tree-lstms",
    "conversations",
    "question",
    "directed acyclic dependencies",
    "summarization",
    "we",
    "lstm",
    "these conversations",
    "natural",
    "it",
    "other disentanglement metrics",
    "dependencies",
    "dag-lstms",
    "information",
    "sequence"
  ],
  "url": "https://aclanthology.org/2021.starsem-1.14/",
  "provenance": {
    "collected_at": "2025-06-05 08:23:08",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}