{
  "id": "2021.acl-demo.22",
  "title": "CRSL}ab: An Open-Source Toolkit for Building Conversational Recommender System",
  "authors": [
    "Zhou, Kun  and\nWang, Xiaolei  and\nZhou, Yuanhang  and\nShang, Chenzhan  and\nCheng, Yuan  and\nZhao, Wayne Xin  and\nLi, Yaliang  and\nWen, Ji-Rong"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing: System Demonstrations",
  "abstract": "In recent years, conversational recommender systems (CRSs) have drawn a wide attention in the research community, which focus on providing high-quality recommendations to users via natural language conversations. However, due to diverse scenarios and data formats, existing studies on CRSs lack unified and standardized implementation or comparison. To tackle this challenge, we release an open-source toolkit CRSLab, which provides a unified and extensible framework with highly-decoupled modules to develop CRSs. Based on this framework, we collect 6 commonly used human-annotated CRS datasets and implement 19 models that include advanced techniques such as graph neural networks and pre-training models. Besides, our toolkit provides a series of automatic evaluation protocols and a human-machine interaction interface to evaluate and compare different CRS methods. The project and documents are released athttps://github.com/RUCAIBox/CRSLab.",
  "keywords": [
    "conversations",
    "series",
    "we",
    "graph",
    "conversational recommender system",
    "training",
    "neural",
    "natural",
    "a wide attention",
    "conversational recommender systems crss",
    "unified",
    "pre-training models",
    "existing studies",
    "natural language conversations",
    "automatic evaluation protocols"
  ],
  "url": "https://aclanthology.org/2021.acl-demo.22/",
  "provenance": {
    "collected_at": "2025-06-05 08:09:47",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}