{
  "id": "2021.acl-long.486",
  "title": "PRGC}: Potential Relation and Global Correspondence Based Joint Relational Triple Extraction",
  "authors": [
    "Zheng, Hengyi  and\nWen, Rui  and\nChen, Xi  and\nYang, Yifan  and\nZhang, Yunyan  and\nZhang, Ziheng  and\nZhang, Ningyu  and\nQin, Bin  and\nMing, Xu  and\nZheng, Yefeng"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Joint extraction of entities and relations from unstructured texts is a crucial task in information extraction. Recent methods achieve considerable performance but still suffer from some inherent limitations, such as redundancy of relation prediction, poor generalization of span-based extraction and inefficiency. In this paper, we decompose this task into three subtasks, Relation Judgement, Entity Extraction and Subject-object Alignment from a novel perspective and then propose a joint relational triple extraction framework based on Potential Relation and Global Correspondence (PRGC). Specifically, we design a component to predict potential relations, which constrains the following entity extraction to the predicted relation subset rather than all relations; then a relation-specific sequence tagging component is applied to handle the overlapping problem between subjects and objects; finally, a global correspondence component is designed to align the subject and object into a triple with low-complexity. Extensive experiments show that PRGC achieves state-of-the-art performance on public benchmarks with higher efficiency and delivers consistent performance gain on complex scenarios of overlapping triples. The source code has been submitted as the supplementary material and will be made publicly available after the blind review.",
  "keywords": [
    "code",
    "extraction",
    "efficiency",
    "we",
    "poor generalization",
    "the blind review",
    "information",
    "sequence",
    "subject-object alignment",
    "object",
    "higher efficiency",
    "generalization",
    "inefficiency",
    "alignment",
    "entities"
  ],
  "url": "https://aclanthology.org/2021.acl-long.486/",
  "provenance": {
    "collected_at": "2025-06-05 08:05:56",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}