{
  "id": "2021.nlp4posimpact-1.3",
  "title": "Cartography of Natural Language Processing for Social Good ({NLP}4{SG}): Searching for Definitions, Statistics and White Spots",
  "authors": [
    "Fortuna, Paula  and\nP{\\'e}rez-Mayos, Laura  and\nAbuRa{'}ed, Ahmed  and\nSoler-Company, Juan  and\nWanner, Leo"
  ],
  "year": "2021",
  "venue": "Proceedings of the 1st Workshop on NLP for Positive Impact",
  "abstract": "The range of works that can be considered as developing NLP for social good (NLP4SG) is enormous. While many of them target the identification of hate speech or fake news, there are others that address, e.g., text simplification to alleviate consequences of dyslexia, or coaching strategies to fight depression. However, so far, there is no clear picture of what areas are targeted by NLP4SG, who are the actors, which are the main scenarios and what are the topics that have been left aside. In order to obtain a clearer view in this respect, we first propose a working definition of NLP4SG and identify some primary aspects that are crucial for NLP4SG, including, e.g., areas, ethics, privacy and bias. Then, we draw upon a corpus of around 50,000 articles downloaded from the ACL Anthology. Based on a list of keywords retrieved from the literature and revised in view of the task, we select from this corpus articles that can be considered to be on NLP4SG according to our definition and analyze them in terms of trends along the time line, etc. The result is a map of the current NLP4SG research and insights concerning the white spots on this map.",
  "keywords": [
    "bias",
    "we",
    "current",
    "natural",
    "dyslexia or coaching strategies",
    "map",
    "the current nlp4sg research",
    "natural language processing",
    "processing",
    "text",
    "nlp4sg",
    "strategies",
    "language",
    "nlp",
    "view"
  ],
  "url": "https://aclanthology.org/2021.nlp4posimpact-1.3/",
  "provenance": {
    "collected_at": "2025-06-05 08:18:56",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}