{
  "id": "2021.acl-long.565",
  "title": "All That{'}s `Human' Is Not Gold: Evaluating Human Evaluation of Generated Text",
  "authors": [
    "Clark, Elizabeth  and\nAugust, Tal  and\nSerrano, Sofia  and\nHaduong, Nikita  and\nGururangan, Suchin  and\nSmith, Noah A."
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Human evaluations are typically considered the gold standard in natural language generation, but as models’ fluency improves, how well can evaluators detect and judge machine-generated text? We run a study assessing non-experts’ ability to distinguish between human- and machine-authored text (GPT2 and GPT3) in three domains (stories, news articles, and recipes). We find that, without training, evaluators distinguished between GPT3- and human-authored text at random chance level. We explore three approaches for quickly training evaluators to better identify GPT3-authored text (detailed instructions, annotated examples, and paired examples) and find that while evaluators’ accuracy improved up to 55%, it did not significantly improve across the three domains. Given the inconsistent results across text domains and the often contradictory reasons evaluators gave for their judgments, we examine the role untrained human evaluations play in NLG evaluation and provide recommendations to NLG researchers for improving human evaluations of text generated from state-of-the-art models.",
  "keywords": [
    "human evaluation",
    "gpt3-authored text detailed instructions",
    "language",
    "generation",
    "random",
    "gpt2",
    "natural",
    "machine",
    "text",
    "it",
    "human",
    "evaluations",
    "machine-generated text",
    "generated text human evaluations",
    "evaluators accuracy"
  ],
  "url": "https://aclanthology.org/2021.acl-long.565/",
  "provenance": {
    "collected_at": "2025-06-05 08:07:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}