{
  "id": "2021.acl-long.151",
  "title": "R}eddit{B}ias: A Real-World Resource for Bias Evaluation and Debiasing of Conversational Language Models",
  "authors": [
    "Barikeri, Soumya  and\nLauscher, Anne  and\nVuli{\\'c}, Ivan  and\nGlava{\\v{s}}, Goran"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Text representation models are prone to exhibit a range of societal biases, reflecting the non-controlled and biased nature of the underlying pretraining data, which consequently leads to severe ethical issues and even bias amplification. Recent work has predominantly focused on measuring and mitigating bias in pretrained language models. Surprisingly, the landscape of bias measurements and mitigation resources and methods for conversational language models is still very scarce: it is limited to only a few types of bias, artificially constructed resources, and completely ignores the impact that debiasing methods may have on the final perfor mance in dialog tasks, e.g., conversational response generation. In this work, we present REDDITBIAS, the first conversational data set grounded in the actual human conversations from Reddit, allowing for bias measurement and mitigation across four important bias dimensions: gender,race,religion, and queerness. Further, we develop an evaluation framework which simultaneously 1)measures bias on the developed REDDITBIAS resource, and 2)evaluates model capability in dialog tasks after model debiasing. We use the evaluation framework to benchmark the widely used conversational DialoGPT model along with the adaptations of four debiasing methods. Our results indicate that DialoGPT is biased with respect to religious groups and that some debiasing techniques can remove this bias while preserving downstream task performance.",
  "keywords": [
    "bias",
    "conversations",
    "we",
    "the actual human conversations",
    "dialogpt",
    "bias measurement",
    "measuring and mitigating bias",
    "some debiasing techniques",
    "it",
    "debiasing",
    "biased",
    "an evaluation framework",
    "that dialogpt",
    "bias evaluation",
    "conversational language models"
  ],
  "url": "https://aclanthology.org/2021.acl-long.151/",
  "provenance": {
    "collected_at": "2025-06-05 08:01:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}