{
  "id": "2021.acl-long.376",
  "title": "Knowledge-Enriched Event Causality Identification via Latent Structure Induction Networks",
  "authors": [
    "Cao, Pengfei  and\nZuo, Xinyu  and\nChen, Yubo  and\nLiu, Kang  and\nZhao, Jun  and\nChen, Yuguang  and\nPeng, Weihua"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Identifying causal relations of events is an important task in natural language processing area. However, the task is very challenging, because event causality is usually expressed in diverse forms that often lack explicit causal clues. Existing methods cannot handle well the problem, especially in the condition of lacking training data. Nonetheless, humans can make a correct judgement based on their background knowledge, including descriptive knowledge and relational knowledge. Inspired by it, we propose a novel Latent Structure Induction Network (LSIN) to incorporate the external structural knowledge into this task. Specifically, to make use of the descriptive knowledge, we devise a Descriptive Graph Induction module to obtain and encode the graph-structured descriptive knowledge. To leverage the relational knowledge, we propose a Relational Graph Induction module which is able to automatically learn a reasoning structure for event causality reasoning. Experimental results on two widely used datasets indicate that our approach significantly outperforms previous state-of-the-art methods.",
  "keywords": [
    "we",
    "graph",
    "training",
    "natural",
    "it",
    "latent",
    "processing",
    "background",
    "their background knowledge",
    "natural language processing area",
    "knowledge",
    "language",
    "network",
    "area",
    "approach"
  ],
  "url": "https://aclanthology.org/2021.acl-long.376/",
  "provenance": {
    "collected_at": "2025-06-05 08:04:28",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}