{
  "id": "2021.acl-long.432",
  "title": "Crowdsourcing Learning as Domain Adaptation: {A} Case Study on Named Entity Recognition",
  "authors": [
    "Zhang, Xin  and\nXu, Guangwei  and\nSun, Yueheng  and\nZhang, Meishan  and\nXie, Pengjun"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Crowdsourcing is regarded as one prospective solution for effective supervised learning, aiming to build large-scale annotated training data by crowd workers. Previous studies focus on reducing the influences from the noises of the crowdsourced annotations for supervised models. We take a different point in this work, regarding all crowdsourced annotations as gold-standard with respect to the individual annotators. In this way, we find that crowdsourcing could be highly similar to domain adaptation, and then the recent advances of cross-domain methods can be almost directly applied to crowdsourcing. Here we take named entity recognition (NER) as a study case, suggesting an annotator-aware representation learning model that inspired by the domain adaptation methods which attempt to capture effective domain-aware features. We investigate both unsupervised and supervised crowdsourcing learning, assuming that no or only small-scale expert annotations are available. Experimental results on a benchmark crowdsourced NER dataset show that our method is highly effective, leading to a new state-of-the-art performance. In addition, under the supervised setting, we can achieve impressive performance gains with only a very small scale of expert annotations.",
  "keywords": [
    "we",
    "training",
    "cross",
    "named entity recognition crowdsourcing",
    "learning",
    "ner",
    "previous studies",
    "work",
    "model",
    "studies",
    "entity recognition ner",
    "entity",
    "state",
    "a study case",
    "annotated"
  ],
  "url": "https://aclanthology.org/2021.acl-long.432/",
  "provenance": {
    "collected_at": "2025-06-05 08:05:13",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}