{
  "id": "2021.acl-long.322",
  "title": "Learning Language and Multimodal Privacy-Preserving Markers of Mood from Mobile Data",
  "authors": [
    "Liang, Paul Pu  and\nLiu, Terrance  and\nCai, Anna  and\nMuszynski, Michal  and\nIshii, Ryo  and\nAllen, Nick  and\nAuerbach, Randy  and\nBrent, David  and\nSalakhutdinov, Ruslan  and\nMorency, Louis-Philippe"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Mental health conditions remain underdiagnosed even in countries with common access to advanced medical care. The ability to accurately and efficiently predict mood from easily collectible data has several important implications for the early detection, intervention, and treatment of mental health disorders. One promising data source to help monitor human behavior is daily smartphone usage. However, care must be taken to summarize behaviors without identifying the user through personal (e.g., personally identifiable information) or protected (e.g., race, gender) attributes. In this paper, we study behavioral markers of daily mood using a recent dataset of mobile behaviors from adolescent populations at high risk of suicidal behaviors. Using computational models, we find that language and multimodal representations of mobile typed text (spanning typed characters, words, keystroke timings, and app usage) are predictive of daily mood. However, we find that models trained to predict mood often also capture private user identities in their intermediate representations. To tackle this problem, we evaluate approaches that obfuscate user identity while remaining predictive. By combining multimodal representations with privacy-preserving learning, we are able to push forward the performance-privacy frontier.",
  "keywords": [
    "identities",
    "we",
    "information",
    "frontier",
    "learning",
    "early",
    "text",
    "the performance-privacy frontier",
    "countries",
    "language",
    "human",
    "private user identities",
    "promising",
    "populations",
    "characters"
  ],
  "url": "https://aclanthology.org/2021.acl-long.322/",
  "provenance": {
    "collected_at": "2025-06-05 08:03:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}