{
  "id": "2021.acl-demo.41",
  "title": "T}ext{F}lint: Unified Multilingual Robustness Evaluation Toolkit for Natural Language Processing",
  "authors": [
    "Wang, Xiao  and\nLiu, Qin  and\nGui, Tao  and\nZhang, Qi  and\nZou, Yicheng  and\nZhou, Xin  and\nYe, Jiacheng  and\nZhang, Yongxin  and\nZheng, Rui  and\nPang, Zexiong  and\nWu, Qinzhuo  and\nLi, Zhengyan  and\nZhang, Chong  and\nMa, Ruotian  and\nFei, Zichu  and\nCai, Ruijian  and\nZhao, Jun  and\nHu, Xingwu  and\nYan, Zhiheng  and\nTan, Yiding  and\nHu, Yuan  and\nBian, Qiyuan  and\nLiu, Zhihua  and\nQin, Shan  and\nZhu, Bolin  and\nXing, Xiaoyu  and\nFu, Jinlan  and\nZhang, Yue  and\nPeng, Minlong  and\nZheng, Xiaoqing  and\nZhou, Yaqian  and\nWei, Zhongyu  and\nQiu, Xipeng  and\nHuang, Xuanjing"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing: System Demonstrations",
  "abstract": "TextFlint is a multilingual robustness evaluation toolkit for NLP tasks that incorporates universal text transformation, task-specific transformation, adversarial attack, subpopulation, and their combinations to provide comprehensive robustness analyses. This enables practitioners to automatically evaluate their models from various aspects or to customize their evaluations as desired with just a few lines of code. TextFlint also generates complete analytical reports as well as targeted augmented data to address the shortcomings of the model in terms of its robustness. To guarantee acceptability, all the text transformations are linguistically based and all the transformed data selected (up to 100,000 texts) scored highly under human evaluation. To validate the utility, we performed large-scale empirical evaluations (over 67,000) on state-of-the-art deep learning models, classic supervised methods, and real-world systems. The toolkit is already available athttps://github.com/textflintwith all the evaluation results demonstrated at textflint.io.",
  "keywords": [
    "deep",
    "code",
    "ext",
    "natural language processing textflint",
    "we",
    "human evaluation",
    "natural",
    "their evaluations",
    "learning",
    "nlp tasks",
    "processing",
    "large-scale empirical evaluations",
    "text",
    "practitioners",
    "language"
  ],
  "url": "https://aclanthology.org/2021.acl-demo.41/",
  "provenance": {
    "collected_at": "2025-06-05 08:10:03",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}