{
  "id": "2021.acl-long.131",
  "title": "A Survey of Code-switching: Linguistic and Social Perspectives for Language Technologies",
  "authors": [
    "Do{\\u{g}}ru{\\\"o}z, A. Seza  and\nSitaram, Sunayana  and\nBullock, Barbara E.  and\nToribio, Almeida Jacqueline"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "The analysis of data in which multiple languages are represented has gained popularity among computational linguists in recent years. So far, much of this research focuses mainly on the improvement of computational methods and largely ignores linguistic and social aspects of C-S discussed across a wide range of languages within the long-established literature in linguistics. To fill this gap, we offer a survey of code-switching (C-S) covering the literature in linguistics with a reflection on the key issues in language technologies. From the linguistic perspective, we provide an overview of structural and functional patterns of C-S focusing on the literature from European and Indian contexts as highly multilingual areas. From the language technologies perspective, we discuss how massive language models fail to represent diverse C-S types due to lack of appropriate training data, lack of robust evaluation benchmarks for C-S (across multilingual situations and types of C-S) and lack of end-to- end systems that cover sociolinguistic aspects of C-S as well. Our survey will be a step to- wards an outcome of mutual benefit for computational scientists and linguists with a shared interest in multilingualism and C-S.",
  "keywords": [
    "code",
    "language technologies",
    "end",
    "the language technologies perspective",
    "overview",
    "we",
    "training",
    "an overview",
    "computational scientists",
    "robust evaluation benchmarks",
    "technologies",
    "analysis",
    "scientists",
    "how massive language models",
    "language"
  ],
  "url": "https://aclanthology.org/2021.acl-long.131/",
  "provenance": {
    "collected_at": "2025-06-05 08:01:10",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}