{
  "id": "2021.wat-1.12",
  "title": "Evaluation Scheme of Focal Translation for {J}apanese Partially Amended Statutes",
  "authors": [
    "Yamakoshi, Takahiro  and\nKomamizu, Takahiro  and\nOgawa, Yasuhiro  and\nToyama, Katsuhiko"
  ],
  "year": "2021",
  "venue": "Proceedings of the 8th Workshop on Asian Translation (WAT2021)",
  "abstract": "For updating the translations of Japanese statutes based on their amendments, we need to consider the translation “focality;” that is, we should only modify expressions that are relevant to the amendment and retain the others to avoid misconstruing its contents. In this paper, we introduce an evaluation metric and a corpus to improve focality evaluations. Our metric is called an Inclusive Score for DIfferential Translation: (ISDIT). ISDIT consists of two factors: (1) the n-gram recall of expressions unaffected by the amendment and (2) the n-gram precision of the output compared to the reference. This metric supersedes an existing one for focality by simultaneously calculating the translation quality of the changed expressions in addition to that of the unchanged expressions. We also newly compile a corpus for Japanese partially amendment translation that secures the focality of the post-amendment translations, while an existing evaluation corpus does not. With the metric and the corpus, we examine the performance of existing translation methods for Japanese partially amendment translations.",
  "keywords": [
    "recall",
    "reference",
    "japanese partially amendment translations",
    "precision",
    "an evaluation metric",
    "the translations",
    "metric",
    "evaluations",
    "focal translation",
    "evaluation scheme",
    "japanese partially amendment translation",
    "the translation quality",
    "focality evaluations",
    "the post-amendment translations",
    "existing translation methods"
  ],
  "url": "https://aclanthology.org/2021.wat-1.12/",
  "provenance": {
    "collected_at": "2025-06-05 08:23:40",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}