{
  "id": "2021.acl-long.320",
  "title": "Supporting Land Reuse of Former Open Pit Mining Sites using Text Classification and Active Learning",
  "authors": [
    "Schr{\\\"o}der, Christopher  and\nB{\\\"u}rgl, Kim  and\nAnnanias, Yves  and\nNiekler, Andreas  and\nM{\\\"u}ller, Lydia  and\nWiegreffe, Daniel  and\nBender, Christian  and\nMengs, Christoph  and\nScheuermann, Gerik  and\nHeyer, Gerhard"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Open pit mines left many regions worldwide inhospitable or uninhabitable. Many sites are left behind in a hazardous or contaminated state, show remnants of waste, or have other restrictions imposed upon them, e.g., for the protection of human or nature. Such information has to be permanently managed in order to reuse those areas in the future. In this work we present and evaluate an automated workflow for supporting the post-mining management of former lignite open pit mines in the eastern part of Germany, where prior to any planned land reuse, aforementioned information has to be acquired to ensure the safety and validity of such an endeavor. Usually, this information is found in expert reports, either in the form of paper documents, or in the best case as digitized unstructured text—all of them in German language. However, due to the size and complexity of these documents, any inquiry is tedious and time-consuming, thereby slowing down or even obstructing the reuse of related areas. Since no training data is available, we employ active learning in order to perform multi-label sentence classification for two categories of restrictions and seven categories of topics. The final system integrates optical character recognition (OCR), active-learning-based text classification, and geographic information system visualization in order to effectively extract, query, and visualize this information for any area of interest. Active learning and text classification results are twofold: Whereas the restriction categories were reasonably accurate (>0.85 F1), the seven topic-oriented categories seemed to be complex even for human annotators and achieved mediocre evaluation scores (<0.70 F1).",
  "keywords": [
    "seven categories",
    "form",
    "all",
    "we",
    "training",
    "classification",
    "text classification results",
    "the seven topic-oriented categories",
    "information",
    "mediocre evaluation scores",
    "learning",
    "text classification",
    "geographic information system visualization",
    "categories",
    "text"
  ],
  "url": "https://aclanthology.org/2021.acl-long.320/",
  "provenance": {
    "collected_at": "2025-06-05 08:03:42",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}