{
  "id": "2021.acl-long.447",
  "title": "A Closer Look at Few-Shot Crosslingual Transfer: The Choice of Shots Matters",
  "authors": [
    "Zhao, Mengjie  and\nZhu, Yi  and\nShareghi, Ehsan  and\nVuli{\\'c}, Ivan  and\nReichart, Roi  and\nKorhonen, Anna  and\nSch{\\\"u}tze, Hinrich"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Few-shot crosslingual transfer has been shown to outperform its zero-shot counterpart with pretrained encoders like multilingual BERT. Despite its growing popularity, little to no attention has been paid to standardizing and analyzing the design of few-shot experiments. In this work, we highlight a fundamental risk posed by this shortcoming, illustrating that the model exhibits a high degree of sensitivity to the selection of few shots. We conduct a large-scale experimental study on 40 sets of sampled few shots for six diverse NLP tasks across up to 40 languages. We provide an analysis of success and failure cases of few-shot transfer, which highlights the role of lexical features. Additionally, we show that a straightforward full model finetuning approach is quite effective for few-shot transfer, outperforming several state-of-the-art few-shot approaches. As a step towards standardizing few-shot crosslingual experimental designs, we make our sampled few shots publicly available.",
  "keywords": [
    "we",
    "shot",
    "six diverse nlp tasks",
    "pretrained encoders",
    "few-shot crosslingual transfer",
    "few-shot experiments",
    "transfer",
    "no attention",
    "analysis",
    "multilingual bert",
    "bert",
    "few-shot crosslingual experimental designs",
    "encoders",
    "its zero-shot counterpart",
    "work"
  ],
  "url": "https://aclanthology.org/2021.acl-long.447/",
  "provenance": {
    "collected_at": "2025-06-05 08:05:25",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}