{
  "id": "2021.acl-long.180",
  "title": "Chase: A Large-Scale and Pragmatic {C}hinese Dataset for Cross-Database Context-Dependent Text-to-{SQL",
  "authors": [
    "Guo, Jiaqi  and\nSi, Ziliang  and\nWang, Yu  and\nLiu, Qian  and\nFan, Ming  and\nLou, Jian-Guang  and\nYang, Zijiang  and\nLiu, Ting"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "The cross-database context-dependent Text-to-SQL (XDTS) problem has attracted considerable attention in recent years due to its wide range of potential applications. However, we identify two biases in existing datasets for XDTS: (1) a high proportion of context-independent questions and (2) a high proportion of easy SQL queries. These biases conceal the major challenges in XDTS to some extent. In this work, we present Chase, a large-scale and pragmatic Chinese dataset for XDTS. It consists of 5,459 coherent question sequences (17,940 questions with their SQL queries annotated) over 280 databases, in which only 35% of questions are context-independent, and 28% of SQL queries are easy. We experiment on Chase with three state-of-the-art XDTS approaches. The best approach only achieves an exact match accuracy of 40% over all questions and 16% over all question sequences, indicating that Chase highlights the challenging problems of XDTS. We believe that XDTS can provide fertile soil for addressing the problems.",
  "keywords": [
    "question",
    "we",
    "an exact match accuracy",
    "cross",
    "it",
    "two biases",
    "queries",
    "considerable attention",
    "sql queries",
    "text",
    "biases",
    "accuracy",
    "work",
    "these biases",
    "attention"
  ],
  "url": "https://aclanthology.org/2021.acl-long.180/",
  "provenance": {
    "collected_at": "2025-06-05 08:01:50",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}