{
  "id": "2021.nlp4posimpact-1.13",
  "title": "Improving Policing with Natural Language Processing",
  "authors": [
    "Dixon, Anthony  and\nBirks, Daniel"
  ],
  "year": "2021",
  "venue": "Proceedings of the 1st Workshop on NLP for Positive Impact",
  "abstract": "This article explores the potential for Natural Language Processing (NLP) to enable a more effective, prevention focused and less confrontational policing model that has hitherto been too resource consuming to implement at scale. Problem-Oriented Policing (POP) is a potential replacement, at least in part, for traditional policing which adopts a reactive approach, relying heavily on the criminal justice system. By contrast, POP seeks to prevent crime by manipulating the underlying conditions that allow crimes to be committed. Identifying these underlying conditions requires a detailed understanding of crime events - tacit knowledge that is often held by police officers but which can be challenging to derive from structured police data. One potential source of insight exists in unstructured free text data commonly collected by police for the purposes of investigation or administration. Yet police agencies do not typically have the skills or resources to analyse these data at scale. In this article we argue that NLP offers the potential to unlock these unstructured data and by doing so allow police to implement more POP initiatives. However we caution that using NLP models without adequate knowledge may either allow or perpetuate bias within the data potentially leading to unfavourable outcomes.",
  "keywords": [
    "scale problem-oriented policing pop",
    "bias",
    "we",
    "natural",
    "nlp models",
    "natural language processing",
    "police agencies",
    "processing",
    "text",
    "agencies",
    "knowledge",
    "language",
    "nlp",
    "model",
    "detailed"
  ],
  "url": "https://aclanthology.org/2021.nlp4posimpact-1.13/",
  "provenance": {
    "collected_at": "2025-06-05 08:19:04",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}