{
  "id": "2021.acl-long.115",
  "title": "Towards Table-to-Text Generation with Numerical Reasoning",
  "authors": [
    "Suadaa, Lya Hulliyyatus  and\nKamigaito, Hidetaka  and\nFunakoshi, Kotaro  and\nOkumura, Manabu  and\nTakamura, Hiroya"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Recent neural text generation models have shown significant improvement in generating descriptive text from structured data such as table formats. One of the remaining important challenges is generating more analytical descriptions that can be inferred from facts in a data source. The use of a template-based generator and a pointer-generator is among the potential alternatives for table-to-text generators. In this paper, we propose a framework consisting of a pre-trained model and a copy mechanism. The pre-trained models are fine-tuned to produce fluent text that is enriched with numerical reasoning. However, it still lacks fidelity to the table contents. The copy mechanism is incorporated in the fine-tuning step by using general placeholders to avoid producing hallucinated phrases that are not supported by a table while preserving high fluency. In summary, our contributions are (1) a new dataset for numerical table-to-text generation using pairs of a table and a paragraph of a table description with richer inference from scientific papers, and (2) a table-to-text generation framework enriched with numerical reasoning.",
  "keywords": [
    "we",
    "generators",
    "text generation",
    "a pointer-generator",
    "neural",
    "it",
    "general placeholders",
    "scientific",
    "tuning",
    "text",
    "a template-based generator",
    "the fine-tuning step",
    "general",
    "generation",
    "model"
  ],
  "url": "https://aclanthology.org/2021.acl-long.115/",
  "provenance": {
    "collected_at": "2025-06-05 08:00:58",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}