{
  "id": "2021.wat-1.17",
  "title": "Improved {E}nglish to {H}indi Multimodal Neural Machine Translation",
  "authors": [
    "Laskar, Sahinur Rahman  and\nKhilji, Abdullah Faiz Ur Rahman  and\nKaushik, Darsh  and\nPakray, Partha  and\nBandyopadhyay, Sivaji"
  ],
  "year": "2021",
  "venue": "Proceedings of the 8th Workshop on Asian Translation (WAT2021)",
  "abstract": "Machine translation performs automatic translation from one natural language to another. Neural machine translation attains a state-of-the-art approach in machine translation, but it requires adequate training data, which is a severe problem for low-resource language pairs translation. The concept of multimodal is introduced in neural machine translation (NMT) by merging textual features with visual features to improve low-resource pair translation. WAT2021 (Workshop on Asian Translation 2021) organizes a shared task of multimodal translation for English to Hindi. We have participated the same with team name CNLP-NITS-PP in two submissions: multimodal and text-only NMT. This work investigates phrase pairs injection via data augmentation approach and attains improvement over our previous work at WAT2020 on the same task in both text-only and multimodal NMT. We have achieved second rank on the challenge test set for English to Hindi multimodal translation where Bilingual Evaluation Understudy (BLEU) score of 39.28, Rank-based Intuitive Bilingual Evaluation Score (RIBES) 0.792097, and Adequacy-Fluency Metrics (AMFM) score 0.830230 respectively.",
  "keywords": [
    "bleu",
    "machine translation",
    "hindi multimodal translation",
    "792097 and adequacy-fluency metrics",
    "we",
    "team name cnlp-nits",
    "training",
    "translation",
    "asian translation",
    "neural",
    "natural",
    "it",
    "visual",
    "text",
    "metrics"
  ],
  "url": "https://aclanthology.org/2021.wat-1.17/",
  "provenance": {
    "collected_at": "2025-06-05 08:23:44",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}