{
  "id": "2021.acl-long.30",
  "title": "PASS}: Perturb-and-Select Summarizer for Product Reviews",
  "authors": [
    "Oved, Nadav  and\nLevy, Ran"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "The product reviews summarization task aims to automatically produce a short summary for a set of reviews of a given product. Such summaries are expected to aggregate a range of different opinions in a concise, coherent and informative manner. This challenging task gives rise to two shortcomings in existing work. First, summarizers tend to favor generic content that appears in reviews for many different products, resulting in template-like, less informative summaries. Second, as reviewers often disagree on the pros and cons of a given product, summarizers sometimes yield inconsistent, self-contradicting summaries. We propose the PASS system (Perturb-and-Select Summarizer) that employs a large pre-trained Transformer-based model (T5 in our case), which follows a few-shot fine-tuning scheme. A key component of the PASS system relies on applying systematic perturbations to the model’s input during inference, which allows it to generate multiple different summaries per product. We develop a method for ranking these summaries according to desired criteria, coherence in our case, enabling our system to almost entirely avoid the problem of self-contradiction. We compare our system against strong baselines on publicly available datasets, and show that it produces summaries which are more informative, diverse and coherent.",
  "keywords": [
    "generic content",
    "summarization",
    "we",
    "a few-shot fine-tuning scheme",
    "it",
    "self",
    "these summaries",
    "summarization task",
    "template-like less informative summaries",
    "reviews",
    "manner",
    "tuning",
    "generic",
    "fine",
    "inconsistent self-contradicting summaries"
  ],
  "url": "https://aclanthology.org/2021.acl-long.30/",
  "provenance": {
    "collected_at": "2025-06-05 07:59:50",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}