{
  "id": "2021.acl-long.570",
  "title": "Including Signed Languages in Natural Language Processing",
  "authors": [
    "Yin, Kayo  and\nMoryossef, Amit  and\nHochgesang, Julie  and\nGoldberg, Yoav  and\nAlikhani, Malihe"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Signed languages are the primary means of communication for many deaf and hard of hearing individuals. Since signed languages exhibit all the fundamental linguistic properties of natural language, we believe that tools and theories of Natural Language Processing (NLP) are crucial towards its modeling. However, existing research in Sign Language Processing (SLP) seldom attempt to explore and leverage the linguistic organization of signed languages. This position paper calls on the NLP community to include signed languages as a research area with high social and scientific impact. We first discuss the linguistic properties of signed languages to consider during their modeling. Then, we review the limitations of current SLP models and identify the open challenges to extend NLP to signed languages. Finally, we urge (1) the adoption of an efficient tokenization method; (2) the development of linguistically-informed models; (3) the collection of real-world signed language data; (4) the inclusion of local signed language communities as an active and leading voice in the direction of research.",
  "keywords": [
    "efficient",
    "theories",
    "local signed language communities",
    "communities",
    "the nlp community",
    "the linguistic properties",
    "we",
    "current",
    "means",
    "natural language processing nlp",
    "natural",
    "properties",
    "natural language processing",
    "natural language",
    "scientific"
  ],
  "url": "https://aclanthology.org/2021.acl-long.570/",
  "provenance": {
    "collected_at": "2025-06-05 08:07:04",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}