{
  "id": "2021.acl-long.297",
  "title": "Towards Propagation Uncertainty: Edge-enhanced {B}ayesian Graph Convolutional Networks for Rumor Detection",
  "authors": [
    "Wei, Lingwei  and\nHu, Dou  and\nZhou, Wei  and\nYue, Zhaojuan  and\nHu, Songlin"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Detecting rumors on social media is a very critical task with significant implications to the economy, public health, etc. Previous works generally capture effective features from texts and the propagation structure. However, the uncertainty caused by unreliable relations in the propagation structure is common and inevitable due to wily rumor producers and the limited collection of spread data. Most approaches neglect it and may seriously limit the learning of features. Towards this issue, this paper makes the first attempt to explore propagation uncertainty for rumor detection. Specifically, we propose a novel Edge-enhanced Bayesian Graph Convolutional Network (EBGCN) to capture robust structural features. The model adaptively rethinks the reliability of latent relations by adopting a Bayesian approach. Besides, we design a new edge-wise consistency training framework to optimize the model by enforcing consistency on relations. Experiments on three public benchmark datasets demonstrate that the proposed model achieves better performance than baseline methods on both rumor detection and early rumor detection tasks.",
  "keywords": [
    "we",
    "graph",
    "convolutional",
    "training",
    "edge",
    "it",
    "latent",
    "learning",
    "early",
    "model",
    "propagation",
    "network",
    "attempt",
    "a bayesian approach",
    "approach"
  ],
  "url": "https://aclanthology.org/2021.acl-long.297/",
  "provenance": {
    "collected_at": "2025-06-05 08:03:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}