{
  "id": "2021.acl-long.545",
  "title": "Using Meta-Knowledge Mined from Identifiers to Improve Intent Recognition in Conversational Systems",
  "authors": [
    "Pinhanez, Claudio  and\nCavalin, Paulo  and\nAlves Ribeiro, Victor Henrique  and\nAppel, Ana  and\nCandello, Heloisa  and\nNogima, Julio  and\nPichiliani, Mauro  and\nGuerra, Melina  and\nde Bayser, Maira  and\nMalfatti, Gabriel  and\nFerreira, Henrique"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "In this paper we explore the improvement of intent recognition in conversational systems by the use of meta-knowledge embedded in intent identifiers. Developers often include such knowledge, structure as taxonomies, in the documentation of chatbots. By using neuro-symbolic algorithms to incorporate those taxonomies into embeddings of the output space, we were able to improve accuracy in intent recognition. In datasets with intents and example utterances from 200 professional chatbots, we saw decreases in the equal error rate (EER) in more than 40% of the chatbots in comparison to the baseline of the same algorithm without the meta-knowledge. The meta-knowledge proved also to be effective in detecting out-of-scope utterances, improving the false acceptance rate (FAR) in two thirds of the chatbots, with decreases of 0.05 or more in FAR in almost 40% of the chatbots. When considering only the well-developed workspaces with a high level use of taxonomies, FAR decreased more than 0.05 in 77% of them, and more than 0.1 in 39% of the chatbots.",
  "keywords": [
    "embeddings",
    "chatbots",
    "knowledge",
    "200 professional chatbots",
    "identifiers",
    "rate",
    "taxonomies",
    "conversational",
    "we",
    "those taxonomies",
    "conversational systems",
    "the chatbots",
    "accuracy",
    "intent identifiers developers",
    "recognition"
  ],
  "url": "https://aclanthology.org/2021.acl-long.545/",
  "provenance": {
    "collected_at": "2025-06-05 08:06:44",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}