{
  "id": "2021.acl-long.100",
  "title": "Measure and Evaluation of Semantic Divergence across Two Languages",
  "authors": [
    "Montariol, Syrielle  and\nAllauzen, Alexandre"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Languages are dynamic systems: word usage may change over time, reflecting various societal factors. However, all languages do not evolve identically: the impact of an event, the influence of a trend or thinking, can differ between communities. In this paper, we propose to track these divergences by comparing the evolution of a word and its translation across two languages. We investigate several methods of building time-varying and bilingual word embeddings, using contextualised and non-contextualised embeddings. We propose a set of scenarios to characterize semantic divergence across two languages, along with a setup to differentiate them in a bilingual corpus. We evaluate the different methods by generating a corpus of synthetic semantic change across two languages, English and French, before applying them to newspaper corpora to detect bilingual semantic divergence and provide qualitative insight for the task. We conclude that BERT embeddings coupled with a clustering step lead to the best performance on synthetic corpora; however, the performance of CBOW embeddings is very competitive and more adapted to an exploratory analysis on a large corpus.",
  "keywords": [
    "synthetic semantic change",
    "communities",
    "various societal factors",
    "semantic",
    "we",
    "contextualised and non-contextualised embeddings",
    "semantic divergence",
    "translation",
    "word",
    "bert embeddings",
    "analysis",
    "bert",
    "a clustering step lead",
    "bilingual semantic divergence",
    "embeddings"
  ],
  "url": "https://aclanthology.org/2021.acl-long.100/",
  "provenance": {
    "collected_at": "2025-06-05 08:00:46",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}