{
  "id": "2021.acl-srw.14",
  "title": "Situation-Based Multiparticipant Chat Summarization: a Concept, an Exploration-Annotation Tool and an Example Collection",
  "authors": [
    "Smirnova, Anna  and\nSlobodkin, Evgeniy  and\nChernishev, George"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing: Student Research Workshop",
  "abstract": "Currently, text chatting is one of the primary means of communication. However, modern text chat still in general does not offer any navigation or even full-featured search, although the high volumes of messages demand it. In order to mitigate these inconveniences, we formulate the problem of situation-based summarization and propose a special data annotation tool intended for developing training and gold-standard data. A situation is a subset of messages revolving around a single event in both temporal and contextual senses: e.g, a group of friends arranging a meeting in chat, agreeing on date, time, and place. Situations can be extracted via information retrieval, natural language processing, and machine learning techniques. Since the task is novel, neither training nor gold-standard datasets for it have been created yet. In this paper, we present the formulation of the situation-based summarization problem. Next, we describe Chat Corpora Annotator (CCA): the first annotation system designed specifically for exploring and annotating chat log data. We also introduce a custom query language for semi-automatic situation extraction. Finally, we present the first gold-standard dataset for situation-based summarization. The software source code and the dataset are publicly available.",
  "keywords": [
    "code",
    "extraction",
    "situation-based summarization",
    "summarization",
    "we",
    "training",
    "means",
    "natural",
    "it",
    "retrieval",
    "information",
    "e",
    "situation-based multiparticipant chat summarization",
    "log",
    "processing"
  ],
  "url": "https://aclanthology.org/2021.acl-srw.14/",
  "provenance": {
    "collected_at": "2025-06-05 08:09:11",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}