{
  "id": "2021.acl-long.28",
  "title": "Multimodal Sentiment Detection Based on Multi-channel Graph Neural Networks",
  "authors": [
    "Yang, Xiaocui  and\nFeng, Shi  and\nZhang, Yifei  and\nWang, Daling"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "With the popularity of smartphones, we have witnessed the rapid proliferation of multimodal posts on various social media platforms. We observe that the multimodal sentiment expression has specific global characteristics, such as the interdependencies of objects or scenes within the image. However, most previous studies only considered the representation of a single image-text post and failed to capture the global co-occurrence characteristics of the dataset. In this paper, we propose Multi-channel Graph Neural Networks with Sentiment-awareness (MGNNS) for image-text sentiment detection. Specifically, we first encode different modalities to capture hidden representations. Then, we introduce multi-channel graph neural networks to learn multimodal representations based on the global characteristics of the dataset. Finally, we implement multimodal in-depth fusion with the multi-head attention mechanism to predict the sentiment of image-text pairs. Extensive experiments conducted on three publicly available datasets demonstrate the effectiveness of our approach for multimodal sentiment detection.",
  "keywords": [
    "we",
    "graph",
    "fusion",
    "multi-channel graph neural networks",
    "neural",
    "different modalities",
    "interdependencies",
    "text",
    "the multi-head attention mechanism",
    "sentiment",
    "most previous studies",
    "studies",
    "modalities",
    "attention",
    "the interdependencies"
  ],
  "url": "https://aclanthology.org/2021.acl-long.28/",
  "provenance": {
    "collected_at": "2025-06-05 07:59:48",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}