{
  "id": "2021.acl-long.437",
  "title": "Generating Relevant and Coherent Dialogue Responses using Self-Separated Conditional Variational {A}uto{E}ncoders",
  "authors": [
    "Sun, Bin  and\nFeng, Shaoxiong  and\nLi, Yiwei  and\nLiu, Jiamou  and\nLi, Kan"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Conditional Variational AutoEncoder (CVAE) effectively increases the diversity and informativeness of responses in open-ended dialogue generation tasks through enriching the context vector with sampled latent variables. However, due to the inherent one-to-many and many-to-one phenomena in human dialogues, the sampled latent variables may not correctly reflect the contexts’ semantics, leading to irrelevant and incoherent generated responses. To resolve this problem, we propose Self-separated Conditional Variational AutoEncoder (abbreviated as SepaCVAE) that introduces group information to regularize the latent variables, which enhances CVAE by improving the responses’ relevance and coherence while maintaining their diversity and informativeness. SepaCVAE actively divides the input data into groups, and then widens the absolute difference between data pairs from distinct groups, while narrowing the relative distance between data pairs in the same group. Empirical results from automatic evaluation and detailed analysis demonstrate that SepaCVAE can significantly boost responses in well-established open-domain dialogue datasets.",
  "keywords": [
    "open-ended dialogue generation tasks",
    "autoencoder",
    "self-separated conditional variational autoencoder",
    "we",
    "dialogue",
    "human dialogues",
    "semantics",
    "self",
    "information",
    "latent",
    "automatic evaluation",
    "the contexts semantics",
    "analysis",
    "vector",
    "conditional variational autoencoder cvae"
  ],
  "url": "https://aclanthology.org/2021.acl-long.437/",
  "provenance": {
    "collected_at": "2025-06-05 08:05:17",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}