{
  "id": "2021.woah-1.18",
  "title": "When the Echo Chamber Shatters: Examining the Use of Community-Specific Language Post-Subreddit Ban",
  "authors": [
    "Trujillo, Milo  and\nRosenblatt, Sam  and\nde Anda J{\\'a}uregui, Guillermo  and\nMoog, Emily  and\nSamson, Briane Paul V.  and\nH{\\'e}bert-Dufresne, Laurent  and\nRoth, Allison M."
  ],
  "year": "2021",
  "venue": "Proceedings of the 5th Workshop on Online Abuse and Harms (WOAH 2021)",
  "abstract": "Community-level bans are a common tool against groups that enable online harassment and harmful speech. Unfortunately, the efficacy of community bans has only been partially studied and with mixed results. Here, we provide a flexible unsupervised methodology to identify in-group language and track user activity on Reddit both before and after the ban of a community (subreddit). We use a simple word frequency divergence to identify uncommon words overrepresented in a given community, not as a proxy for harmful speech but as a linguistic signature of the community. We apply our method to 15 banned subreddits, and find that community response is heterogeneous between subreddits and between users of a subreddit. Top users were more likely to become less active overall, while random users often reduced use of in-group language without decreasing activity. Finally, we find some evidence that the effectiveness of bans aligns with the content of a community. Users of dark humor communities were largely unaffected by bans while users of communities organized around white supremacy and fascism were the most affected. Altogether, our results show that bans do not affect all groups or users equally, and pave the way to understanding the effect of bans across communities.",
  "keywords": [
    "communities",
    "we",
    "word",
    "language",
    "random",
    "dark humor communities",
    "frequency",
    "unsupervised",
    "the community",
    "effectiveness",
    "white",
    "efficacy",
    "overall",
    "linguistic",
    "the effect"
  ],
  "url": "https://aclanthology.org/2021.woah-1.18/",
  "provenance": {
    "collected_at": "2025-06-05 08:24:10",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}