{
  "id": "2021.acl-long.107",
  "title": "Towards Argument Mining for Social Good: A Survey",
  "authors": [
    "Vecchi, Eva Maria  and\nFalk, Neele  and\nJundi, Iman  and\nLapesa, Gabriella"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "This survey builds an interdisciplinary picture of Argument Mining (AM), with a strong focus on its potential to address issues related to Social and Political Science. More specifically, we focus on AM challenges related to its applications to social media and in the multilingual domain, and then proceed to the widely debated notion of argument quality. We propose a novel definition of argument quality which is integrated with that of deliberative quality from the Social Science literature. Under our definition, the quality of a contribution needs to be assessed at multiple levels: the contribution itself, its preceding context, and the consequential effect on the development of the upcoming discourse. The latter has not received the deserved attention within the community. We finally define an application of AM for Social Good: (semi-)automatic moderation, a highly integrative application which (a) represents a challenging testbed for the integrated notion of quality we advocate, (b) allows the empirical quantification of argument/deliberative quality to benefit from the developments in other NLP fields (i.e. hate speech detection, fact checking, debiasing), and (c) has a clearly beneficial potential at the level of its societal thanks to its real-world application (even if extremely ambitious).",
  "keywords": [
    "b",
    "we",
    "fields",
    "social and political science",
    "the deserved attention",
    "other nlp fields",
    "c",
    "science",
    "a",
    "am",
    "i",
    "the social science literature",
    "its societal thanks",
    "mining",
    "nlp"
  ],
  "url": "https://aclanthology.org/2021.acl-long.107/",
  "provenance": {
    "collected_at": "2025-06-05 08:00:51",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}