{
  "id": "2021.gebnlp-1.11",
  "title": "Generating Gender Augmented Data for {NLP",
  "authors": [
    "Jain, Nishtha  and\nPopovi{\\'c}, Maja  and\nGroves, Declan  and\nVanmassenhove, Eva"
  ],
  "year": "2021",
  "venue": "Proceedings of the 3rd Workshop on Gender Bias in Natural Language Processing",
  "abstract": "Gender bias is a frequent occurrence in NLP-based applications, especially pronounced in gender-inflected languages. Bias can appear through associations of certain adjectives and animate nouns with the natural gender of referents, but also due to unbalanced grammatical gender frequencies of inflected words. This type of bias becomes more evident in generating conversational utterances where gender is not specified within the sentence, because most current NLP applications still work on a sentence-level context. As a step towards more inclusive NLP, this paper proposes an automatic and generalisable re-writing approach for short conversational sentences. The rewriting method can be applied to sentences that, without extra-sentential context, have multiple equivalent alternatives in terms of gender. The method can be applied both for creating gender balanced outputs as well as for creating gender balanced training data. The proposed approach is based on a neural machine translation system trained to ‘translate’ from one gender alternative to another. Both the automatic and manual analysis of the approach show promising results with respect to the automatic generation of gender alternatives for conversational sentences in Spanish.",
  "keywords": [
    "bias",
    "extra",
    "nlp-based applications",
    "gender-inflected languages bias",
    "conversational utterances",
    "current",
    "training",
    "translation",
    "nlp gender bias",
    "neural",
    "natural",
    "unbalanced grammatical gender frequencies",
    "the automatic generation",
    "analysis",
    "generalisable"
  ],
  "url": "https://aclanthology.org/2021.gebnlp-1.11/",
  "provenance": {
    "collected_at": "2025-06-05 08:17:16",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}