{
  "id": "2021.acl-long.114",
  "title": "Reflective Decoding: Beyond Unidirectional Generation with Off-the-Shelf Language Models",
  "authors": [
    "West, Peter  and\nLu, Ximing  and\nHoltzman, Ari  and\nBhagavatula, Chandra  and\nHwang, Jena D.  and\nChoi, Yejin"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Publicly available, large pretrained Language Models (LMs) generate text with remarkable quality, but only sequentially from left to right. As a result, they are not immediately applicable to generation tasks that break the unidirectional assumption, such as paraphrasing or text-infilling, necessitating task-specific supervision. In this paper, we present Reflective Decoding, a novel unsupervised algorithm that allows for direct application of unidirectional LMs to non-sequential tasks. Our 2-step approach requires no supervision or even parallel corpora, only two off-the-shelf pretrained LMs in opposite directions: forward and backward. First, in the contextualization step, we use LMs to generate ensembles of past and future contexts which collectively capture the input (e.g. the source sentence for paraphrasing). Second, in the reflection step, we condition on these “context ensembles”, generating outputs that are compatible with them. Comprehensive empirical results demonstrate that Reflective Decoding outperforms strong unsupervised baselines on both paraphrasing and abductive text infilling, significantly narrowing the gap between unsupervised and supervised methods. Reflective Decoding surpasses multiple supervised baselines on various metrics including human evaluation.",
  "keywords": [
    "to generation tasks",
    "we",
    "human evaluation",
    "unidirectional generation",
    "various metrics",
    "ensembles",
    "text",
    "metrics",
    "these context ensembles",
    "generation",
    "language",
    "human",
    "evaluation",
    "supervision",
    "approach"
  ],
  "url": "https://aclanthology.org/2021.acl-long.114/",
  "provenance": {
    "collected_at": "2025-06-05 08:00:57",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}