{
  "id": "2021.acl-demo.24",
  "title": "CLTR}: An End-to-End, Transformer-Based System for Cell-Level Table Retrieval and Table Question Answering",
  "authors": [
    "Pan, Feifei  and\nCanim, Mustafa  and\nGlass, Michael  and\nGliozzo, Alfio  and\nFox, Peter"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing: System Demonstrations",
  "abstract": "We present the first end-to-end, transformer-based table question answering (QA) system that takes natural language questions and massive table corpora as inputs to retrieve the most relevant tables and locate the correct table cells to answer the question. Our system, CLTR, extends the current state-of-the-art QA over tables model to build an end-to-end table QA architecture. This system has successfully tackled many real-world table QA problems with a simple, unified pipeline. Our proposed system can also generate a heatmap of candidate columns and rows over complex tables and allow users to quickly identify the correct cells to answer questions. In addition, we introduce two new open domain benchmarks, E2E_WTQ and E2E_GNQ, consisting of 2,005 natural language questions over 76,242 tables. The benchmarks are designed to validate CLTR as well as accommodate future table retrieval and end-to-end table QA research and experiments. Our experiments demonstrate that our system is the current state-of-the-art model on the table retrieval task and produces promising results for end-to-end table QA.",
  "keywords": [
    "qa research",
    "end",
    "qa problems",
    "qa system",
    "question",
    "future table retrieval",
    "we",
    "current",
    "a heatmap",
    "natural",
    "unified",
    "retrieval",
    "the table retrieval task",
    "transformer",
    "language"
  ],
  "url": "https://aclanthology.org/2021.acl-demo.24/",
  "provenance": {
    "collected_at": "2025-06-05 08:09:49",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}