{
  "id": "2021.acl-long.527",
  "title": "Mid-Air Hand Gestures for Post-Editing of Machine Translation",
  "authors": [
    "Albo Jamara, Rashad  and\nHerbig, Nico  and\nKr{\\\"u}ger, Antonio  and\nvan Genabith, Josef"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "To translate large volumes of text in a globally connected world, more and more translators are integrating machine translation (MT) and post-editing (PE) into their translation workflows to generate publishable quality translations. While this process has been shown to save time and reduce errors, the task of translation is changing from mostly text production from scratch to fixing errors within useful but partly incorrect MT output. This is affecting the interface design of translation tools, where better support for text editing tasks is required. Here, we present the first study that investigates the usefulness of mid-air hand gestures in combination with the keyboard (GK) for text editing in PE of MT. Guided by a gesture elicitation study with 14 freelance translators, we develop a prototype supporting mid-air hand gestures for cursor placement, text selection, deletion, and reordering. These gestures combined with the keyboard facilitate all editing types required for PE. An evaluation of the prototype shows that the average editing duration of GK is only slightly slower than the standard mouse and keyboard (MK), even though participants are very familiar with the latter, and relative novices to the former. Furthermore, the qualitative analysis shows positive attitudes towards hand gestures for PE, especially when manipulating single words.",
  "keywords": [
    "support",
    "pe an evaluation",
    "machine translation",
    "we",
    "publishable quality translations",
    "translation",
    "their translation",
    "analysis",
    "machine translation mt",
    "text",
    "translation tools",
    "pe",
    "process",
    "machine",
    "evaluation"
  ],
  "url": "https://aclanthology.org/2021.acl-long.527/",
  "provenance": {
    "collected_at": "2025-06-05 08:06:30",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}