{
  "id": "2021.acl-long.537",
  "title": "E}mail{S}um: Abstractive Email Thread Summarization",
  "authors": [
    "Zhang, Shiyue  and\nCelikyilmaz, Asli  and\nGao, Jianfeng  and\nBansal, Mohit"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Recent years have brought about an interest in the challenging task of summarizing conversation threads (meetings, online discussions, etc.). Such summaries help analysis of the long text to quickly catch up with the decisions made and thus improve our work or communication efficiency. To spur research in thread summarization, we have developed an abstractive Email Thread Summarization (EmailSum) dataset, which contains human-annotated short (<30 words) and long (<100 words) summaries of 2,549 email threads (each containing 3 to 10 emails) over a wide variety of topics. We perform a comprehensive empirical study to explore different summarization techniques (including extractive and abstractive methods, single-document and hierarchical models, as well as transfer and semisupervised learning) and conduct human evaluations on both short and long summary generation tasks. Our results reveal the key challenges of current abstractive summarization models in this task, such as understanding the sender’s intent and identifying the roles of sender and receiver. Furthermore, we find that widely used automatic evaluation metrics (ROUGE, BERTScore) are weakly correlated with human judgments on this email thread summarization task. Hence, we emphasize the importance of human evaluation and the development of better metrics by the community.",
  "keywords": [
    "variety",
    "efficiency",
    "summarization",
    "we",
    "current",
    "a wide variety",
    "automatic evaluation metrics rouge",
    "different summarization techniques",
    "bertscore",
    "human evaluation",
    "conversation threads",
    "better metrics",
    "long 100 words summaries",
    "thread summarization",
    "learning"
  ],
  "url": "https://aclanthology.org/2021.acl-long.537/",
  "provenance": {
    "collected_at": "2025-06-05 08:06:38",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}