{
  "id": "2021.acl-long.77",
  "title": "The Possible, the Plausible, and the Desirable: Event-Based Modality Detection for Language Processing",
  "authors": [
    "Pyatkin, Valentina  and\nSadde, Shoval  and\nRubinstein, Aynat  and\nPortner, Paul  and\nTsarfaty, Reut"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Modality is the linguistic ability to describe vents with added information such as how desirable, plausible, or feasible they are. Modality is important for many NLP downstream tasks such as the detection of hedging, uncertainty, speculation, and more. Previous studies that address modality detection in NLP often restrict modal expressions to a closed syntactic class, and the modal sense labels are vastly different across different studies, lacking an accepted standard. Furthermore, these senses are often analyzed independently of the events that they modify. This work builds on the theoretical foundations of the Georgetown Gradable Modal Expressions (GME) work by Rubinstein et al. (2013) to propose an event-based modality detection task where modal expressions can be words of any syntactic class and sense labels are drawn from a comprehensive taxonomy which harmonizes the modal concepts contributed by the different studies. We present experiments on the GME corpus aiming to detect and classify fine-grained modal concepts and associate them with their modified events. We show that detecting and classifying modal expressions is not only feasible, it also improves the detection of modal events in their own right.",
  "keywords": [
    "we",
    "it",
    "their modified events",
    "information",
    "more previous studies",
    "processing",
    "the different studies",
    "different studies",
    "work",
    "language",
    "nlp",
    "studies",
    "class",
    "many nlp downstream tasks",
    "gme"
  ],
  "url": "https://aclanthology.org/2021.acl-long.77/",
  "provenance": {
    "collected_at": "2025-06-05 08:00:28",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}