{
  "id": "2021.acl-demo.14",
  "title": "ESRA}: Explainable Scientific Research Assistant",
  "authors": [
    "Hongwimol, Pollawat  and\nKehasukcharoen, Peeranuth  and\nLaohawarutchai, Pasit  and\nLertvittayakumjorn, Piyawat  and\nNg, Aik Beng  and\nLai, Zhangsheng  and\nLiu, Timothy  and\nVateekul, Peerapon"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing: System Demonstrations",
  "abstract": "We introduce Explainable Scientific Research Assistant (ESRA), a literature discovery platform that augments search results with relevant details and explanations, aiding users in understanding more about their queries and the returned papers beyond existing literature search systems. Enabled by a knowledge graph we extracted from abstracts of 23k papers on the arXiv’s cs.CL category, ESRA provides three main features: explanation (for why a paper is returned to the user), list of facts (that are relevant to the query), and graph visualization (drawing connections between the query and each paper with surrounding related entities). The experimental results with humans involved show that ESRA can accelerate the users’ search process with paper explanations and helps them better explore the landscape of the topics of interest by exploiting the underlying knowledge graph. We provide the ESRA web application athttp://esra.cp.eng.chula.ac.th/.",
  "keywords": [
    "we",
    "graph",
    "graph visualization drawing connections",
    "queries",
    "ac",
    "scientific",
    "the underlying knowledge graph",
    "their queries",
    "explainable scientific research assistant",
    "visualization",
    "a knowledge graph",
    "process",
    "knowledge",
    "entities",
    "related entities"
  ],
  "url": "https://aclanthology.org/2021.acl-demo.14/",
  "provenance": {
    "collected_at": "2025-06-05 08:09:41",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}