{
  "id": "2021.acl-short.137",
  "title": "Bringing Structure into Summaries: a Faceted Summarization Dataset for Long Scientific Documents",
  "authors": [
    "Meng, Rui  and\nThaker, Khushboo  and\nZhang, Lei  and\nDong, Yue  and\nYuan, Xingdi  and\nWang, Tong  and\nHe, Daqing"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 2: Short Papers)",
  "abstract": "Faceted summarization provides briefings of a document from different perspectives. Readers can quickly comprehend the main points of a long document with the help of a structured outline. However, little research has been conducted on this subject, partially due to the lack of large-scale faceted summarization datasets. In this study, we present FacetSum, a faceted summarization benchmark built on Emerald journal articles, covering a diverse range of domains. Different from traditional document-summary pairs, FacetSum provides multiple summaries, each targeted at specific sections of a long document, including the purpose, method, findings, and value. Analyses and empirical results on our dataset reveal the importance of bringing structure into summaries. We believe FacetSum will spur further advances in summarization research and foster the development of NLP systems that can leverage the structured information in both long texts and summaries.",
  "keywords": [
    "multiple summaries",
    "a faceted summarization benchmark",
    "summarization",
    "we",
    "briefings",
    "information",
    "scientific",
    "summaries",
    "nlp",
    "summarization research",
    "large-scale faceted summarization datasets",
    "nlp systems",
    "documents",
    "journal",
    "specific sections"
  ],
  "url": "https://aclanthology.org/2021.acl-short.137/",
  "provenance": {
    "collected_at": "2025-06-05 08:08:57",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}