{
  "id": "2021.nlp4posimpact-1.10",
  "title": "NLP} for Consumer Protection: Battling Illegal Clauses in {G}erman Terms and Conditions in Online Shopping",
  "authors": [
    "Braun, Daniel  and\nMatthes, Florian"
  ],
  "year": "2021",
  "venue": "Proceedings of the 1st Workshop on NLP for Positive Impact",
  "abstract": "Online shopping is an ever more important part of the global consumer economy, not just in times of a pandemic. When we place an order online as consumers, we regularly agree to the so-called “Terms and Conditions” (T&C), a contract unilaterally drafted by the seller. Often, consumers do not read these contracts and unwittingly agree to unfavourable and often void terms. Government and non-government organisations (NGOs) for consumer protection battle such terms on behalf of consumers, who often hesitate to take on legal actions themselves. However, the growing number of online shops and a lack of funding makes it increasingly difficult for such organisations to monitor the market effectively. This paper describes how Natural Language Processing (NLP) can be applied to support consumer advocates in their efforts to protect consumers. Together with two NGOs from Germany, we developed an NLP-based application that legally assesses clauses in T&C from German online shops under the European Union’s (EU) jurisdiction. We report that we could achieve an accuracy of 0.9 in the detection of void clauses by fine-tuning a pre-trained German BERT model. The approach is currently used by two NGOs and has already helped to challenge void clauses in T&C.",
  "keywords": [
    "t",
    "we",
    "natural",
    "it",
    "an nlp-based application",
    "processing",
    "bert",
    "an accuracy",
    "fine",
    "accuracy",
    "language",
    "nlp",
    "model",
    "pre",
    "consumer protection battle"
  ],
  "url": "https://aclanthology.org/2021.nlp4posimpact-1.10/",
  "provenance": {
    "collected_at": "2025-06-05 08:19:02",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}