{
  "id": "2021.acl-long.549",
  "title": "TIMEDIAL}: Temporal Commonsense Reasoning in Dialog",
  "authors": [
    "Qin, Lianhui  and\nGupta, Aditya  and\nUpadhyay, Shyam  and\nHe, Luheng  and\nChoi, Yejin  and\nFaruqui, Manaal"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Everyday conversations require understanding everyday events, which in turn, requires understanding temporal commonsense concepts interwoven with those events. Despite recent progress with massive pre-trained language models (LMs) such as T5 and GPT-3, their capability of temporal reasoning in dialogs remains largely under-explored. In this paper, we present the first study to investigate pre-trained LMs for their temporal reasoning capabilities in dialogs by introducing a new task and a crowd-sourced English challenge set, TimeDial. We formulate TimeDial as a multiple choice cloze task with over 1.1K carefully curated dialogs. Empirical results demonstrate that even the best performing models struggle on this task compared to humans, with 23 absolute points of gap in accuracy. Furthermore, our analysis reveals that the models fail to reason about dialog context correctly; instead, they rely on shallow cues based on existing temporal patterns in context, motivating future research for modeling temporal concepts in text and robust contextual reasoning about them. The dataset is publicly available athttps://github.com/google-research-datasets/timedial.",
  "keywords": [
    "conversations",
    "we",
    "analysis",
    "text",
    "accuracy",
    "everyday conversations",
    "language",
    "dialog",
    "capabilities",
    "pre",
    "their temporal reasoning capabilities",
    "recent progress",
    "existing temporal patterns",
    "future research",
    "events"
  ],
  "url": "https://aclanthology.org/2021.acl-long.549/",
  "provenance": {
    "collected_at": "2025-06-05 08:06:47",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}