{
  "id": "2021.acl-long.516",
  "title": "Detecting Propaganda Techniques in Memes",
  "authors": [
    "Dimitrov, Dimitar  and\nBin Ali, Bishr  and\nShaar, Shaden  and\nAlam, Firoj  and\nSilvestri, Fabrizio  and\nFirooz, Hamed  and\nNakov, Preslav  and\nDa San Martino, Giovanni"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Propaganda can be defined as a form of communication that aims to influence the opinions or the actions of people towards a specific goal; this is achieved by means of well-defined rhetorical and psychological devices. Propaganda, in the form we know it today, can be dated back to the beginning of the 17th century. However, it is with the advent of the Internet and the social media that propaganda has started to spread on a much larger scale than before, thus becoming major societal and political issue. Nowadays, a large fraction of propaganda in social media is multimodal, mixing textual with visual content. With this in mind, here we propose a new multi-label multimodal task: detecting the type of propaganda techniques used in memes. We further create and release a new corpus of 950 memes, carefully annotated with 22 propaganda techniques, which can appear in the text, in the image, or in both. Our analysis of the corpus shows that understanding both modalities together is essential for detecting these techniques. This is further confirmed in our experiments with several state-of-the-art multimodal models.",
  "keywords": [
    "form",
    "we",
    "means",
    "both modalities",
    "it",
    "visual",
    "analysis",
    "text",
    "societal",
    "modalities",
    "major",
    "mind",
    "multi",
    "larger",
    "state"
  ],
  "url": "https://aclanthology.org/2021.acl-long.516/",
  "provenance": {
    "collected_at": "2025-06-05 08:06:21",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}