{
  "id": "2021.acl-long.223",
  "title": "Guiding Teacher Forcing with Seer Forcing for Neural Machine Translation",
  "authors": [
    "Feng, Yang  and\nGu, Shuhao  and\nGuo, Dengji  and\nYang, Zhengxin  and\nShao, Chenze"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Although teacher forcing has become the main training paradigm for neural machine translation, it usually makes predictions only conditioned on past information, and hence lacks global planning for the future. To address this problem, we introduce another decoder, called seer decoder, into the encoder-decoder framework during training, which involves future information in target predictions. Meanwhile, we force the conventional decoder to simulate the behaviors of the seer decoder via knowledge distillation. In this way, at test the conventional decoder can perform like the seer decoder without the attendance of it. Experiment results on the Chinese-English, English-German and English-Romanian translation tasks show our method can outperform competitive baselines significantly and achieves greater improvements on the bigger data sets. Besides, the experiments also prove knowledge distillation the best way to transfer knowledge from the seer decoder to the conventional decoder compared to adversarial learning and L2 regularization.",
  "keywords": [
    "knowledge",
    "neural",
    "machine",
    "it",
    "the encoder-decoder framework",
    "neural machine translation",
    "the conventional decoder",
    "encoder",
    "the seer decoder",
    "decoder",
    "regularization",
    "information",
    "another decoder",
    "we",
    "learning"
  ],
  "url": "https://aclanthology.org/2021.acl-long.223/",
  "provenance": {
    "collected_at": "2025-06-05 08:02:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}