{
  "id": "2021.acl-short.112",
  "title": "On the Generation of Medical Dialogs for {COVID}-19",
  "authors": [
    "Zhou, Meng  and\nLi, Zechen  and\nTan, Bowen  and\nZeng, Guangtao  and\nYang, Wenmian  and\nHe, Xuehai  and\nJu, Zeqian  and\nChakravorty, Subrato  and\nChen, Shu  and\nYang, Xingyi  and\nZhang, Yichen  and\nWu, Qingyang  and\nYu, Zhou  and\nXu, Kun  and\nXing, Eric  and\nXie, Pengtao"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 2: Short Papers)",
  "abstract": "Under the pandemic of COVID-19, people experiencing COVID19-related symptoms have a pressing need to consult doctors. Because of the shortage of medical professionals, many people cannot receive online consultations timely. To address this problem, we aim to develop a medical dialog system that can provide COVID19-related consultations. We collected two dialog datasets – CovidDialog – (in English and Chinese respectively) containing conversations between doctors and patients about COVID-19. While the largest of their kind, these two datasets are still relatively small compared with general-domain dialog datasets. Training complex dialog generation models on small datasets bears high risk of overfitting. To alleviate overfitting, we develop a multi-task learning approach, which regularizes the data-deficient dialog generation task with a masked token prediction task. Experiments on the CovidDialog datasets demonstrate the effectiveness of our approach. We perform both human evaluation and automatic evaluation of dialogs generated by our method. Results show that the generated responses are promising in being doctor-like, relevant to conversation history, clinically informative and correct. The code and the data are available athttps://github.com/UCSD-AI4H/COVID-Dialogue.",
  "keywords": [
    "code",
    "conversations",
    "the generation",
    "we",
    "dialogue",
    "patients",
    "both human evaluation",
    "token",
    "the generated responses",
    "automatic evaluation",
    "complex dialog generation models",
    "general-domain dialog datasets",
    "general",
    "generation",
    "human"
  ],
  "url": "https://aclanthology.org/2021.acl-short.112/",
  "provenance": {
    "collected_at": "2025-06-05 08:08:36",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}