{
  "id": "2021.acl-short.63",
  "title": "Deep Context- and Relation-Aware Learning for Aspect-based Sentiment Analysis",
  "authors": [
    "Oh, Shinhyeok  and\nLee, Dongyub  and\nWhang, Taesun  and\nPark, IlNam  and\nGaeun, Seo  and\nKim, EungGyun  and\nKim, Harksoo"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 2: Short Papers)",
  "abstract": "Existing works for aspect-based sentiment analysis (ABSA) have adopted a unified approach, which allows the interactive relations among subtasks. However, we observe that these methods tend to predict polarities based on the literal meaning of aspect and opinion terms and mainly consider relations implicitly among subtasks at the word level. In addition, identifying multiple aspect–opinion pairs with their polarities is much more challenging. Therefore, a comprehensive understanding of contextual information w.r.t. the aspect and opinion are further required in ABSA. In this paper, we propose Deep Contextualized Relation-Aware Network (DCRAN), which allows interactive relations among subtasks with deep contextual information based on two modules (i.e., Aspect and Opinion Propagation and Explicit Self-Supervised Strategies). Especially, we design novel self-supervised strategies for ABSA, which have strengths in dealing with multiple aspects. Experimental results show that DCRAN significantly outperforms previous state-of-the-art methods by large margins on three widely used benchmarks.",
  "keywords": [
    "deep",
    "novel self-supervised strategies",
    "aspect-based sentiment analysis absa",
    "their polarities",
    "we",
    "a unified approach",
    "polarities",
    "self",
    "unified",
    "information",
    "word",
    "learning",
    "explicit self-supervised strategies",
    "analysis",
    "i"
  ],
  "url": "https://aclanthology.org/2021.acl-short.63/",
  "provenance": {
    "collected_at": "2025-06-05 08:07:57",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}