{
  "id": "2021.acl-long.330",
  "title": "Societal Biases in Language Generation: Progress and Challenges",
  "authors": [
    "Sheng, Emily  and\nChang, Kai-Wei  and\nNatarajan, Prem  and\nPeng, Nanyun"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Technology for language generation has advanced rapidly, spurred by advancements in pre-training large models on massive amounts of data and the need for intelligent agents to communicate in a natural manner. While techniques can effectively generate fluent text, they can also produce undesirable societal biases that can have a disproportionately negative impact on marginalized populations. Language generation presents unique challenges for biases in terms of direct user interaction and the structure of decoding techniques. To better understand these challenges, we present a survey on societal biases in language generation, focusing on how data and techniques contribute to biases and progress towards reducing biases. Motivated by a lack of studies on biases from decoding techniques, we also conduct experiments to quantify the effects of these techniques. By further discussing general trends and open challenges, we call to attention promising directions for research and the importance of fairness and inclusivity considerations for language generation applications.",
  "keywords": [
    "language generation applications",
    "we",
    "language generation progress",
    "training",
    "language generation",
    "natural",
    "manner",
    "text",
    "biases",
    "general",
    "language",
    "generation",
    "a natural manner",
    "studies",
    "societal"
  ],
  "url": "https://aclanthology.org/2021.acl-long.330/",
  "provenance": {
    "collected_at": "2025-06-05 08:03:50",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}