{
  "id": "2021.nlp4posimpact-1.6",
  "title": "Are we human, or are we users? The role of natural language processing in human-centric news recommenders that nudge users to diverse content",
  "authors": [
    "Reuver, Myrthe  and\nMattis, Nicolas  and\nSax, Marijn  and\nVerberne, Suzan  and\nTintarev, Nava  and\nHelberger, Natali  and\nMoeller, Judith  and\nVrijenhoek, Sanne  and\nFokkens, Antske  and\nvan Atteveldt, Wouter"
  ],
  "year": "2021",
  "venue": "Proceedings of the 1st Workshop on NLP for Positive Impact",
  "abstract": "In this position paper, we present a research agenda and ideas for facilitating exposure to diverse viewpoints in news recommendation. Recommending news from diverse viewpoints is important to prevent potential filter bubble effects in news consumption, and stimulate a healthy democratic debate. To account for the complexity that is inherent to humans as citizens in a democracy, we anticipate (among others) individual-level differences in acceptance of diversity. We connect this idea to techniques in Natural Language Processing, where distributional language models would allow us to place different users and news articles in a multidimensional space based on semantic content, where diversity is operationalized as distance and variance. In this way, we can model individual “latitudes of diversity” for different users, and thus personalize viewpoint diversity in support of a healthy public debate. In addition, we identify technical, ethical and conceptual issues related to our presented ideas. Our investigation describes how NLP can play a central role in diversifying news recommendations.",
  "keywords": [
    "support",
    "semantic",
    "we",
    "diverse viewpoints",
    "viewpoint diversity",
    "variance",
    "natural",
    "distributional language models",
    "natural language processing",
    "processing",
    "semantic content",
    "viewpoints",
    "viewpoint",
    "language",
    "nlp"
  ],
  "url": "https://aclanthology.org/2021.nlp4posimpact-1.6/",
  "provenance": {
    "collected_at": "2025-06-05 08:18:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}