{
  "id": "2021.acl-long.92",
  "title": "Comparing Test Sets with Item Response Theory",
  "authors": [
    "Vania, Clara  and\nHtut, Phu Mon  and\nHuang, William  and\nMungra, Dhara  and\nPang, Richard Yuanzhe  and\nPhang, Jason  and\nLiu, Haokun  and\nCho, Kyunghyun  and\nBowman, Samuel R."
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Recent years have seen numerous NLP datasets introduced to evaluate the performance of fine-tuned models on natural language understanding tasks. Recent results from large pretrained models, though, show that many of these datasets are largely saturated and unlikely to be able to detect further progress. What kind of datasets are still effective at discriminating among strong models, and what kind of datasets should we expect to be able to detect future improvements? To measure this uniformly across datasets, we draw on Item Response Theory and evaluate 29 datasets using predictions from 18 pretrained Transformer models on individual test examples. We find that Quoref, HellaSwag, and MC-TACO are best suited for distinguishing among state-of-the-art models, while SNLI, MNLI, and CommitmentBank seem to be saturated for current strong models. We also observe span selection task format, which is used for QA datasets like QAMR or SQuAD2.0, is effective in differentiating between strong and weak models.",
  "keywords": [
    "transformer",
    "language",
    "nlp",
    "natural",
    "qa datasets",
    "format",
    "numerous nlp datasets",
    "we",
    "qamr",
    "current",
    "18 pretrained transformer models",
    "theory",
    "predictions",
    "recent results",
    "this"
  ],
  "url": "https://aclanthology.org/2021.acl-long.92/",
  "provenance": {
    "collected_at": "2025-06-05 08:00:39",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}