{
  "id": "2021.nlp4posimpact-1.14",
  "title": "Empathy and Hope: Resource Transfer to Model Inter-country Social Media Dynamics",
  "authors": [
    "Yoo, Clay H.  and\nPalakodety, Shriphani  and\nSarkar, Rupak  and\nKhudaBukhsh, Ashiqur"
  ],
  "year": "2021",
  "venue": "Proceedings of the 1st Workshop on NLP for Positive Impact",
  "abstract": "The ongoing COVID-19 pandemic resulted in significant ramifications for international relations ranging from travel restrictions, global ceasefires, and international vaccine production and sharing agreements. Amidst a wave of infections in India that resulted in a systemic breakdown of healthcare infrastructure, a social welfare organization based in Pakistan offered to procure medical-grade oxygen to assist India - a nation which was involved in four wars with Pakistan in the past few decades. In this paper, we focus on Pakistani Twitter users’ response to the ongoing healthcare crisis in India. While #IndiaNeedsOxygen and #PakistanStandsWithIndia featured among the top-trending hashtags in Pakistan, divisive hashtags such as #EndiaSaySorryToKashmir simultaneously started trending. Against the backdrop of a contentious history including four wars, divisive content of this nature, especially when a country is facing an unprecedented healthcare crisis, fuels further deterioration of relations. In this paper, we define a new task of detectingsupportivecontent and demonstrate that existingNLP for social impacttools can be effectively harnessed for such tasks within a quick turnaround time. We also release the first publicly available data set at the intersection of geopolitical relations and a raging pandemic in the context of India and Pakistan.",
  "keywords": [
    "we",
    "transfer",
    "existingnlp",
    "time",
    "healthcare",
    "media",
    "nation",
    "geopolitical relations",
    "pakistan",
    "the backdrop",
    "oxygen",
    "international relations",
    "medical-grade oxygen",
    "organization",
    "decades"
  ],
  "url": "https://aclanthology.org/2021.nlp4posimpact-1.14/",
  "provenance": {
    "collected_at": "2025-06-05 08:19:05",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}