{
  "id": "2021.metanlp-1.5",
  "title": "On the cross-lingual transferability of multilingual prototypical models across {NLU} tasks",
  "authors": [
    "Cattan, Oralie  and\nRosset, Sophie  and\nServan, Christophe"
  ],
  "year": "2021",
  "venue": "Proceedings of the 1st Workshop on Meta Learning and Its Applications to Natural Language Processing",
  "abstract": "Supervised deep learning-based approaches have been applied to task-oriented dialog and have proven to be effective for limited domain and language applications when a sufficient number of training examples are available. In practice, these approaches suffer from the drawbacks of domain-driven design and under-resourced languages. Domain and language models are supposed to grow and change as the problem space evolves. On one hand, research on transfer learning has demonstrated the cross-lingual ability of multilingual Transformers-based models to learn semantically rich representations. On the other, in addition to the above approaches, meta-learning have enabled the development of task and language learning algorithms capable of far generalization. Through this context, this article proposes to investigate the cross-lingual transferability of using synergistically few-shot learning with prototypical neural networks and multilingual Transformers-based models. Experiments in natural language understanding tasks on MultiATIS++ corpus shows that our approach substantially improves the observed transfer learning performances between the low and the high resource languages. More generally our approach confirms that the meaningful latent space learned in a given language can be can be generalized to unseen and under-resourced ones using meta-learning.",
  "keywords": [
    "deep",
    "transformers",
    "multilingual transformers-based models",
    "semantically rich representations",
    "shot",
    "training",
    "cross",
    "neural",
    "natural",
    "multilingual transformers-based models experiments",
    "sufficient",
    "latent",
    "rich",
    "learning",
    "transfer"
  ],
  "url": "https://aclanthology.org/2021.metanlp-1.5/",
  "provenance": {
    "collected_at": "2025-06-05 08:18:41",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}