{
  "id": "2021.acl-demo.42",
  "title": "Stretch-{VST}: Getting Flexible With Visual Stories",
  "authors": [
    "Hsu, Chi-yang  and\nChu, Yun-Wei  and\nYang, Tsai-Lun  and\nHuang, Ting-Hao  and\nKu, Lun-Wei"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing: System Demonstrations",
  "abstract": "In visual storytelling, a short story is generated based on a given image sequence. Despite years of work, most visual storytelling models remain limited in terms of the generated stories’ fixed length: most models produce stories with exactly five sentences because five-sentence stories dominate the training data. The fix-length stories carry limited details and provide ambiguous textual information to the readers. Therefore, we propose to “stretch” the stories, which create the potential to present in-depth visual details. This paper presents Stretch-VST, a visual storytelling framework that enables the generation of prolonged stories by adding appropriate knowledge, which is selected by the proposed scoring function. We propose a length-controlled Transformer to generate long stories. This model introduces novel positional encoding methods to maintain story quality with lengthy inputs. Experiments confirm that long stories are generated without deteriorating the quality. The human evaluation further shows that Stretch-VST can provide better focus and detail when stories are prolonged compared to state of the art. We create a webpage to demonstrate our prolonged capability.",
  "keywords": [
    "the generation",
    "long stories",
    "we",
    "prolonged stories",
    "the human evaluation",
    "training",
    "the generated stories",
    "information",
    "sequence",
    "visual",
    "five-sentence stories",
    "stories",
    "a length-controlled transformer",
    "the fix-length stories",
    "function"
  ],
  "url": "https://aclanthology.org/2021.acl-demo.42/",
  "provenance": {
    "collected_at": "2025-06-05 08:10:03",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}