{
  "id": "2021.ecnlp-1.21",
  "title": "Product Review Translation: Parallel Corpus Creation and Robustness towards User-generated Noisy Text",
  "authors": [
    "Gupta, Kamal Kumar  and\nChennabasavaraj, Soumya  and\nGarera, Nikesh  and\nEkbal, Asif"
  ],
  "year": "2021",
  "venue": "Proceedings of the 4th Workshop on e-Commerce and NLP",
  "abstract": "Reviews written by the users for a particular product or service play an influencing role for the customers to make an informative decision. Although online e-commerce portals have immensely impacted our lives, available contents predominantly are in English language- often limiting its widespread usage. There is an exponential growth in the number of e-commerce users who are not proficient in English. Hence, there is a necessity to make these services available in non-English languages, especially in a multilingual country like India. This can be achieved by an in-domain robust machine translation (MT) system. However, the reviews written by the users pose unique challenges to MT, such as misspelled words, ungrammatical constructions, presence of colloquial terms, lack of resources such as in-domain parallel corpus etc. We address the above challenges by presenting an English–Hindi review domain parallel corpus. We train an English–to–Hindi neural machine translation (NMT) system to translate the product reviews available on e-commerce websites. By training the Transformer based NMT model over the generated data, we achieve a score of 33.26 BLEU points for English–to–Hindi translation. In order to make our NMT model robust enough to handle the noisy tokens in the reviews, we integrate a character based language model to generate word vectors and map the noisy tokens with their correct forms. Experiments on four language pairs, viz. English-Hindi, English-German, English-French, and English-Czech show the BLUE scores of 35.09, 28.91, 34.68 and 14.52 which are the improvements of 1.61, 1.05, 1.63 and 1.94, respectively, over the baseline.",
  "keywords": [
    "product review translation",
    "user-generated noisy text reviews",
    "word vectors",
    "bleu",
    "hindi translation",
    "we",
    "translation",
    "33 26 bleu points",
    "neural",
    "word",
    "reviews",
    "text",
    "the transformer",
    "the reviews",
    "transformer"
  ],
  "url": "https://aclanthology.org/2021.ecnlp-1.21/",
  "provenance": {
    "collected_at": "2025-06-05 08:17:06",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}