{
  "id": "2021.dialdoc-1.4",
  "title": "Automatic Learning Assistant in {T}elugu",
  "authors": [
    "Bommadi, Meghana  and\nTerupally, Shreya  and\nMamidi, Radhika"
  ],
  "year": "2021",
  "venue": "Proceedings of the 1st Workshop on Document-grounded Dialogue and Conversational Question Answering (DialDoc 2021)",
  "abstract": "This paper presents a learning assistant that tests one’s knowledge and gives feedback that helps a person learn at a faster pace. A learning assistant (based on automated question generation) has extensive uses in education, information websites, self-assessment, FAQs, testing ML agents, research, etc. Multiple researchers, and companies have worked on Virtual Assistance, but majorly in English. We built our learning assistant for Telugu language to help with teaching in the mother tongue, which is the most efficient way of learning. Our system is built primarily based on Question Generation in Telugu. Many experiments were conducted on Question Generation in English in multiple ways. We have built the first hybrid machine learning and rule-based solution in Telugu, which proves efficient for short stories or short passages in children’s books. Our work covers the fundamental question forms with question types: adjective, yes/no, adverb, verb, when, where, whose, quotative, and quantitative (how many/how much). We constructed rules for question generation using Part of Speech (POS) tags and Universal Dependency (UD) tags along with linguistic information of the surrounding relevant context of the word. We used keyword matching, multilingual sentence embedding to evaluate the answer. Our system is primarily built on question generation in Telugu, and is also capable of evaluating the user’s answers to the generated questions.",
  "keywords": [
    "feedback",
    "efficient",
    "question",
    "the generated questions",
    "we",
    "automated question generation",
    "universal dependency",
    "answer",
    "the most efficient way",
    "self",
    "information",
    "word",
    "learning",
    "pos",
    "stories"
  ],
  "url": "https://aclanthology.org/2021.dialdoc-1.4/",
  "provenance": {
    "collected_at": "2025-06-05 08:16:39",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}