{
  "id": "2021.acl-long.374",
  "title": "Exploiting Document Structures and Cluster Consistencies for Event Coreference Resolution",
  "authors": [
    "Minh Tran, Hieu  and\nPhung, Duy  and\nNguyen, Thien Huu"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "We study the problem of event coreference resolution (ECR) that seeks to group coreferent event mentions into the same clusters. Deep learning methods have recently been applied for this task to deliver state-of-the-art performance. However, existing deep learning models for ECR are limited in that they cannot exploit important interactions between relevant objects for ECR, e.g., context words and entity mentions, to support the encoding of document-level context. In addition, consistency constraints between golden and predicted clusters of event mentions have not been considered to improve representation learning in prior deep learning models for ECR. This work addresses such limitations by introducing a novel deep learning model for ECR. At the core of our model are document structures to explicitly capture relevant objects for ECR. Our document structures introduce diverse knowledge sources (discourse, syntax, semantics) to compute edges/interactions between structure nodes for document-level representation learning. We also present novel regularization techniques based on consistencies of golden and predicted clusters for event mentions in documents. Extensive experiments show that our model achieve state-of-the-art performance on two benchmark datasets.",
  "keywords": [
    "deep",
    "we",
    "novel regularization techniques",
    "syntax",
    "cluster",
    "semantics",
    "cluster consistencies",
    "learning",
    "consistencies",
    "core",
    "coreference",
    "work",
    "knowledge",
    "prior deep learning models",
    "model"
  ],
  "url": "https://aclanthology.org/2021.acl-long.374/",
  "provenance": {
    "collected_at": "2025-06-05 08:04:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}