{
  "id": "2021.acl-long.451",
  "title": "A Unified Generative Framework for Various {NER} Subtasks",
  "authors": [
    "Yan, Hang  and\nGui, Tao  and\nDai, Junqi  and\nGuo, Qipeng  and\nZhang, Zheng  and\nQiu, Xipeng"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Named Entity Recognition (NER) is the task of identifying spans that represent entities in sentences. Whether the entity spans are nested or discontinuous, the NER task can be categorized into the flat NER, nested NER, and discontinuous NER subtasks. These subtasks have been mainly solved by the token-level sequence labelling or span-level classification. However, these solutions can hardly tackle the three kinds of NER subtasks concurrently. To that end, we propose to formulate the NER subtasks as an entity span sequence generation task, which can be solved by a unified sequence-to-sequence (Seq2Seq) framework. Based on our unified framework, we can leverage the pre-trained Seq2Seq model to solve all three kinds of NER subtasks without the special design of the tagging schema or ways to enumerate spans. We exploit three types of entity representations to linearize entities into a sequence. Our proposed framework is easy-to-implement and achieves state-of-the-art (SoTA) or near SoTA performance on eight English NER datasets, including two flat NER datasets, three nested NER datasets, and three discontinuous NER datasets.",
  "keywords": [
    "generative",
    "seq2seq",
    "ner",
    "the pre-trained seq2seq model",
    "end",
    "generation",
    "two flat ner datasets",
    "eight english ner datasets",
    "our unified framework",
    "model",
    "entities",
    "various ner subtasks",
    "token",
    "entity recognition ner",
    "a unified generative framework"
  ],
  "url": "https://aclanthology.org/2021.acl-long.451/",
  "provenance": {
    "collected_at": "2025-06-05 08:05:28",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}