{
  "id": "2021.acl-long.262",
  "title": "Every Bite Is an Experience: {K}ey {P}oint {A}nalysis of Business Reviews",
  "authors": [
    "Bar-Haim, Roy  and\nEden, Lilach  and\nKantor, Yoav  and\nFriedman, Roni  and\nSlonim, Noam"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Previous work on review summarization focused on measuring the sentiment toward the main aspects of the reviewed product or business, or on creating a textual summary. These approaches provide only a partial view of the data: aspect-based sentiment summaries lack sufficient explanation or justification for the aspect rating, while textual summaries do not quantify the significance of each element, and are not well-suited for representing conflicting views. Recently, Key Point Analysis (KPA) has been proposed as a summarization framework that provides both textual and quantitative summary of the main points in the data. We adapt KPA to review data by introducing Collective Key Point Mining for better key point extraction; integrating sentiment analysis into KPA; identifying good key point candidates for review summaries; and leveraging the massive amount of available reviews and their metadata. We show empirically that these novel extensions of KPA substantially improve its performance. We demonstrate that promising results can be achieved without any domain-specific annotation, while human supervision can lead to further improvement.",
  "keywords": [
    "review summarization",
    "extraction",
    "nalysis",
    "summarization",
    "we",
    "the reviewed product",
    "available reviews",
    "sufficient",
    "views",
    "a summarization framework",
    "analysis",
    "reviews",
    "conflicting views",
    "review summaries",
    "sentiment analysis"
  ],
  "url": "https://aclanthology.org/2021.acl-long.262/",
  "provenance": {
    "collected_at": "2025-06-05 08:02:55",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}