{
  "id": "2021.acl-demo.43",
  "title": "O}pen{A}ttack: An Open-source Textual Adversarial Attack Toolkit",
  "authors": [
    "Zeng, Guoyang  and\nQi, Fanchao  and\nZhou, Qianrui  and\nZhang, Tingji  and\nMa, Zixian  and\nHou, Bairu  and\nZang, Yuan  and\nLiu, Zhiyuan  and\nSun, Maosong"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing: System Demonstrations",
  "abstract": "Textual adversarial attacking has received wide and increasing attention in recent years. Various attack models have been proposed, which are enormously distinct and implemented with different programming frameworks and settings. These facts hinder quick utilization and fair comparison of attack models. In this paper, we present an open-source textual adversarial attack toolkit named OpenAttack to solve these issues. Compared with existing other textual adversarial attack toolkits, OpenAttack has its unique strengths in support for all attack types, multilinguality, and parallel processing. Currently, OpenAttack includes 15 typical attack models that cover all attack types. Its highly inclusive modular design not only supports quick utilization of existing attack models, but also enables great flexibility and extensibility. OpenAttack has broad uses including comparing and evaluating attack models, measuring robustness of a model, assisting in developing new attack models, and adversarial training. Source code and documentation can be obtained athttps://github.com/thunlp/OpenAttack.",
  "keywords": [
    "code",
    "processing",
    "support",
    "model",
    "attention",
    "we",
    "thunlp",
    "pen",
    "training",
    "that",
    "uses",
    "fair",
    "distinct",
    "great",
    "different programming frameworks"
  ],
  "url": "https://aclanthology.org/2021.acl-demo.43/",
  "provenance": {
    "collected_at": "2025-06-05 08:10:04",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}