{
  "id": "2021.acl-long.250",
  "title": "Human-in-the-Loop for Data Collection: a Multi-Target Counter Narrative Dataset to Fight Online Hate Speech",
  "authors": [
    "Fanton, Margherita  and\nBonaldi, Helena  and\nTekiro{\\u{g}}lu, Serra Sinem  and\nGuerini, Marco"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Undermining the impact of hateful content with informed and non-aggressive responses, called counter narratives, has emerged as a possible solution for having healthier online communities. Thus, some NLP studies have started addressing the task of counter narrative generation. Although such studies have made an effort to build hate speech / counter narrative (HS/CN) datasets for neural generation, they fall short in reaching either high-quality and/or high-quantity. In this paper, we propose a novel human-in-the-loop data collection methodology in which a generative language model is refined iteratively by using its own data from the previous loops to generate new training samples that experts review and/or post-edit. Our experiments comprised several loops including diverse dynamic variations. Results show that the methodology is scalable and facilitates diverse, novel, and cost-effective data collection. To our knowledge, the resulting dataset is the only expert-based multi-target HS/CN dataset available to the community.",
  "keywords": [
    "a generative language model",
    "communities",
    "some nlp studies",
    "such studies",
    "we",
    "training",
    "neural",
    "generative",
    "counter narrative generation",
    "healthier online communities",
    "knowledge",
    "generation",
    "language",
    "nlp",
    "model"
  ],
  "url": "https://aclanthology.org/2021.acl-long.250/",
  "provenance": {
    "collected_at": "2025-06-05 08:02:45",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}