{
  "id": "2021.acl-short.45",
  "title": "Men Are Elected, Women Are Married: Events Gender Bias on {W}ikipedia",
  "authors": [
    "Sun, Jiao  and\nPeng, Nanyun"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 2: Short Papers)",
  "abstract": "Human activities can be seen as sequences of events, which are crucial to understanding societies. Disproportional event distribution for different demographic groups can manifest and amplify social stereotypes, and potentially jeopardize the ability of members in some groups to pursue certain goals. In this paper, we present the first event-centric study of gender biases in a Wikipedia corpus. To facilitate the study, we curate a corpus of career and personal life descriptions with demographic information consisting of 7,854 fragments from 10,412 celebrities. Then we detect events with a state-of-the-art event detection model, calibrate the results using strategically generated templates, and extract events that have asymmetric associations with genders. Our study discovers that the Wikipedia pages tend to intermingle personal life events with professional events for females but not for males, which calls for the awareness of the Wikipedia community to formalize guidelines and train the editors to mind the implicit biases that contributors carry. Our work also lays the foundation for future works on quantifying and discovering event biases at the corpus level.",
  "keywords": [
    "bias",
    "w ikipedia human activities",
    "we",
    "married",
    "the implicit biases",
    "information",
    "married events gender bias",
    "men",
    "strategically generated templates",
    "gender biases",
    "10 412 celebrities",
    "societies",
    "event biases",
    "activities",
    "celebrities"
  ],
  "url": "https://aclanthology.org/2021.acl-short.45/",
  "provenance": {
    "collected_at": "2025-06-05 08:07:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}