{
  "id": "2021.acl-long.153",
  "title": "Crafting Adversarial Examples for Neural Machine Translation",
  "authors": [
    "Zhang, Xinze  and\nZhang, Junzhe  and\nChen, Zhenhua  and\nHe, Kun"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Effective adversary generation for neural machine translation (NMT) is a crucial prerequisite for building robust machine translation systems. In this work, we investigate veritable evaluations of NMT adversarial attacks, and propose a novel method to craft NMT adversarial examples. We first show the current NMT adversarial attacks may be improperly estimated by the commonly used mono-directional translation, and we propose to leverage the round-trip translation technique to build valid metrics for evaluating NMT adversarial attacks. Our intuition is that an effective NMT adversarial example, which imposes minor shifting on the source and degrades the translation dramatically, would naturally lead to a semantic-destroyed round-trip translation result. We then propose a promising black-box attack method called Word Saliency speedup Local Search (WSLS) that could effectively attack the mainstream NMT architectures. Comprehensive experiments demonstrate that the proposed metrics could accurately evaluate the attack effectiveness, and the proposed WSLS could significantly break the state-of-art NMT models with small perturbation. Besides, WSLS exhibits strong transferability on attacking Baidu and Bing online translators.",
  "keywords": [
    "the round-trip translation technique",
    "semantic",
    "we",
    "valid",
    "current",
    "translation",
    "robust machine translation systems",
    "neural",
    "the proposed metrics",
    "word",
    "valid metrics",
    "the translation",
    "metrics",
    "saliency",
    "work"
  ],
  "url": "https://aclanthology.org/2021.acl-long.153/",
  "provenance": {
    "collected_at": "2025-06-05 08:01:28",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}