{
  "id": "2021.acl-short.100",
  "title": "Neural-Symbolic Commonsense Reasoner with Relation Predictors",
  "authors": [
    "Moghimifar, Farhad  and\nQu, Lizhen  and\nZhuo, Terry Yue  and\nHaffari, Gholamreza  and\nBaktashmotlagh, Mahsa"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 2: Short Papers)",
  "abstract": "Commonsense reasoning aims to incorporate sets of commonsense facts, retrieved from Commonsense Knowledge Graphs (CKG), to draw conclusion about ordinary situations. The dynamic nature of commonsense knowledge postulates models capable of performing multi-hop reasoning over new situations. This feature also results in having large-scale sparse Knowledge Graphs, where such reasoning process is needed to predict relations between new events. However, existing approaches in this area are limited by considering CKGs as a limited set of facts, thus rendering them unfit for reasoning over new unseen situations and events. In this paper, we present a neural-symbolic reasoner, which is capable of reasoning over large-scale dynamic CKGs. The logic rules for reasoning over CKGs are learned during training by our model. In addition to providing interpretable explanation, the learned logic rules help to generalise prediction to newly introduced events. Experimental results on the task of link prediction on CKGs prove the effectiveness of our model by outperforming the state-of-the-art models.",
  "keywords": [
    "we",
    "training",
    "large-scale sparse knowledge graphs",
    "neural-symbolic commonsense reasoner",
    "neural",
    "a neural-symbolic reasoner",
    "commonsense knowledge graphs ckg",
    "ckg",
    "reasoner",
    "ckgs",
    "large-scale dynamic ckgs",
    "process",
    "knowledge",
    "model",
    "area"
  ],
  "url": "https://aclanthology.org/2021.acl-short.100/",
  "provenance": {
    "collected_at": "2025-06-05 08:08:27",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}