{
  "id": "2021.acl-long.183",
  "title": "E}x{CAR}: Event Graph Knowledge Enhanced Explainable Causal Reasoning",
  "authors": [
    "Du, Li  and\nDing, Xiao  and\nXiong, Kai  and\nLiu, Ting  and\nQin, Bing"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Prior work infers the causation between events mainly based on the knowledge induced from the annotated causal event pairs. However, additional evidence information intermediate to the cause and effect remains unexploited. By incorporating such information, the logical law behind the causality can be unveiled, and the interpretability and stability of the causal reasoning system can be improved. To facilitate this, we present anEvent graph knowledge enhanced explainableCAusalReasoning framework (ExCAR). ExCAR first acquires additional evidence information from a large-scale causal event graph as logical rules for causal reasoning. To learn the conditional probabilistic of logical rules, we propose the Conditional Markov Neural Logic Network (CMNLN) that combines the representation learning and structure learning of logical rules in an end-to-end differentiable manner. Experimental results demonstrate that ExCAR outperforms previous state-of-the-art methods. Adversarial evaluation shows the improved stability of ExCAR over baseline systems. Human evaluation shows that ExCAR can achieve a promising explainable performance.",
  "keywords": [
    "end",
    "we",
    "graph",
    "neural",
    "information",
    "learning",
    "baseline systems human evaluation",
    "manner",
    "work",
    "knowledge",
    "human",
    "network",
    "evaluation",
    "the logical law",
    "promising"
  ],
  "url": "https://aclanthology.org/2021.acl-long.183/",
  "provenance": {
    "collected_at": "2025-06-05 08:01:52",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}