{
  "id": "2021.acl-long.494",
  "title": "Dual Graph Convolutional Networks for Aspect-based Sentiment Analysis",
  "authors": [
    "Li, Ruifan  and\nChen, Hao  and\nFeng, Fangxiang  and\nMa, Zhanyu  and\nWang, Xiaojie  and\nHovy, Eduard"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Aspect-based sentiment analysis is a fine-grained sentiment classification task. Recently, graph neural networks over dependency trees have been explored to explicitly model connections between aspects and opinion words. However, the improvement is limited due to the inaccuracy of the dependency parsing results and the informal expressions and complexity of online reviews. To overcome these challenges, in this paper, we propose a dual graph convolutional networks (DualGCN) model that considers the complementarity of syntax structures and semantic correlations simultaneously. Particularly, to alleviate dependency parsing errors, we design a SynGCN module with rich syntactic knowledge. To capture semantic correlations, we design a SemGCN module with self-attention mechanism. Furthermore, we propose orthogonal and differential regularizers to capture semantic correlations between words precisely by constraining attention scores in the SemGCN module. The orthogonal regularizer encourages the SemGCN to learn semantically correlated words with less overlap for each word. The differential regularizer encourages the SemGCN to learn semantic features that the SynGCN fails to capture. Experimental results on three public datasets show that our DualGCN model outperforms state-of-the-art methods and verify the effectiveness of our model.",
  "keywords": [
    "the inaccuracy",
    "dependency trees",
    "syntax structures",
    "semantic",
    "we",
    "graph",
    "convolutional",
    "syntax",
    "classification",
    "the dependency parsing results",
    "neural",
    "dependency parsing errors",
    "semantically correlated words",
    "self",
    "rich"
  ],
  "url": "https://aclanthology.org/2021.acl-long.494/",
  "provenance": {
    "collected_at": "2025-06-05 08:06:03",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}