{
  "id": "2021.acl-long.99",
  "title": "Align Voting Behavior with Public Statements for Legislator Representation Learning",
  "authors": [
    "Mou, Xinyi  and\nWei, Zhongyu  and\nChen, Lei  and\nNing, Shangyi  and\nHe, Yancheng  and\nJiang, Changjian  and\nHuang, Xuanjing"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Ideology of legislators is typically estimated by ideal point models from historical records of votes. It represents legislators and legislation as points in a latent space and shows promising results for modeling voting behavior. However, it fails to capture more specific attitudes of legislators toward emerging issues and is unable to model newly-elected legislators without voting histories. In order to mitigate these two problems, we explore to incorporate both voting behavior and public statements on Twitter to jointly model legislators. In addition, we propose a novel task, namely hashtag usage prediction to model the ideology of legislators on Twitter. In practice, we construct a heterogeneous graph for the legislative context and use relational graph neural networks to learn the representation of legislators with the guidance of historical records of their voting and hashtag usage. Experiment results indicate that our model yields significant improvements for the task of roll call vote prediction. Further analysis further demonstrates that legislator representation we learned captures nuances in statements.",
  "keywords": [
    "we",
    "graph",
    "neural",
    "it",
    "latent",
    "relational graph neural networks",
    "analysis",
    "histories",
    "align",
    "model",
    "modeling",
    "promising",
    "that legislator representation",
    "models",
    "experiment"
  ],
  "url": "https://aclanthology.org/2021.acl-long.99/",
  "provenance": {
    "collected_at": "2025-06-05 08:00:45",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}