{
  "id": "2021.semeval-1.77",
  "title": "UPB} at {S}em{E}val-2021 Task 1: Combining Deep Learning and Hand-Crafted Features for Lexical Complexity Prediction",
  "authors": [
    "Zaharia, George-Eduard  and\nCercel, Dumitru-Clementin  and\nDascalu, Mihai"
  ],
  "year": "2021",
  "venue": "Proceedings of the 15th International Workshop on Semantic Evaluation (SemEval-2021)",
  "abstract": "Reading is a complex process which requires proper understanding of texts in order to create coherent mental representations. However, comprehension problems may arise due to hard-to-understand sections, which can prove troublesome for readers, while accounting for their specific language skills. As such, steps towards simplifying these sections can be performed, by accurately identifying and evaluating difficult structures. In this paper, we describe our approach for the SemEval-2021 Task 1: Lexical Complexity Prediction competition that consists of a mixture of advanced NLP techniques, namely Transformer-based language models, pre-trained word embeddings, Graph Convolutional Networks, Capsule Networks, as well as a series of hand-crafted textual complexity features. Our models are applicable on both subtasks and achieve good performance results, with a MAE below 0.07 and a Person correlation of .73 for single word identification, as well as a MAE below 0.08 and a Person correlation of .79 for multiple word targets. Our results are just 5.46% and 6.5% lower than the top scores obtained in the competition on the first and the second subtasks, respectively.",
  "keywords": [
    "deep",
    "series",
    "we",
    "graph",
    "convolutional",
    "convolutional networks capsule networks",
    "word",
    "learning",
    "-trained word embeddings",
    "embeddings",
    "transformer",
    "a series",
    "process",
    "language",
    "nlp"
  ],
  "url": "https://aclanthology.org/2021.semeval-1.77/",
  "provenance": {
    "collected_at": "2025-06-05 08:20:47",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}