{
  "id": "2021.case-1.1",
  "title": "Challenges and Applications of Automated Extraction of Socio-political Events from Text ({CASE} 2021): Workshop and Shared Task Report",
  "authors": [
    "H{\\\"u}rriyeto{\\u{g}}lu, Ali  and\nTanev, Hristo  and\nZavarella, Vanni  and\nPiskorski, Jakub  and\nYeniterzi, Reyyan  and\nMutlu, Osman  and\nYuret, Deniz  and\nVillavicencio, Aline"
  ],
  "year": "2021",
  "venue": "Proceedings of the 4th Workshop on Challenges and Applications of Automated Extraction of Socio-political Events from Text (CASE 2021)",
  "abstract": "This workshop is the fourth issue of a series of workshops on automatic extraction of socio-political events from news, organized by the Emerging Market Welfare Project, with the support of the Joint Research Centre of the European Commission and with contributions from many other prominent scholars in this field. The purpose of this series of workshops is to foster research and development of reliable, valid, robust, and practical solutions for automatically detecting descriptions of socio-political events, such as protests, riots, wars and armed conflicts, in text streams. This year workshop contributors make use of the state-of-the-art NLP technologies, such as Deep Learning, Word Embeddings and Transformers and cover a wide range of topics from text classification to news bias detection. Around 40 teams have registered and 15 teams contributed to three tasks that are i) multilingual protest news detection detection, ii) fine-grained classification of socio-political events, and iii) discovering Black Lives Matter protest events. The workshop also highlights two keynote and four invited talks about various aspects of creating event data sets and multi- and cross-lingual machine learning in few- and zero-shot settings.",
  "keywords": [
    "deep",
    "transformers",
    "bias",
    "support",
    "extraction",
    "field",
    "series",
    "valid",
    "shot",
    "classification",
    "cross",
    "few-",
    "technologies",
    "word",
    "learning"
  ],
  "url": "https://aclanthology.org/2021.case-1.1/",
  "provenance": {
    "collected_at": "2025-06-05 08:16:13",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}