{
  "id": "2021.gem-1.11",
  "title": "Reusable Templates and Guides For Documenting Datasets and Models for Natural Language Processing and Generation: A Case Study of the {H}ugging{F}ace and {GEM} Data and Model Cards",
  "authors": [
    "McMillan-Major, Angelina  and\nOsei, Salomey  and\nRodriguez, Juan Diego  and\nAmmanamanchi, Pawan Sasanka  and\nGehrmann, Sebastian  and\nJernite, Yacine"
  ],
  "year": "2021",
  "venue": "Proceedings of the 1st Workshop on Natural Language Generation, Evaluation, and Metrics (GEM 2021)",
  "abstract": "Developing documentation guidelines and easy-to-use templates for datasets and models is a challenging task, especially given the variety of backgrounds, skills, and incentives of the people involved in the building of natural language processing (NLP) tools. Nevertheless, the adoption of standard documentation practices across the field of NLP promotes more accessible and detailed descriptions of NLP datasets and models, while supporting researchers and developers in reflecting on their work. To help with the standardization of documentation, we present two case studies of efforts that aim to develop reusable documentation templates – the HuggingFace data card, a general purpose card for datasets in NLP, and the GEM benchmark data and model cards with a focus on natural language generation. We describe our process for developing these templates, including the identification of relevant stakeholder groups, the definition of a set of guiding principles, the use of existing templates as our foundation, and iterative revisions based on feedback.",
  "keywords": [
    "variety",
    "feedback",
    "field",
    "we",
    "a general purpose card",
    "backgrounds",
    "natural",
    "the field",
    "nlp datasets",
    "natural language generation",
    "natural language processing",
    "processing",
    "backgrounds skills",
    "work",
    "two case studies"
  ],
  "url": "https://aclanthology.org/2021.gem-1.11/",
  "provenance": {
    "collected_at": "2025-06-05 08:17:27",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}