{
  "id": "2021.bppf-1.3",
  "title": "We Need to Consider Disagreement in Evaluation",
  "authors": [
    "Basile, Valerio  and\nFell, Michael  and\nFornaciari, Tommaso  and\nHovy, Dirk  and\nPaun, Silviu  and\nPlank, Barbara  and\nPoesio, Massimo  and\nUma, Alexandra"
  ],
  "year": "2021",
  "venue": "Proceedings of the 1st Workshop on Benchmarking: Past, Present and Future",
  "abstract": "Evaluation is of paramount importance in data-driven research fields such as Natural Language Processing (NLP) and Computer Vision (CV). Current evaluation practice largely hinges on the existence of a single “ground truth” against which we can meaningfully compare the prediction of a model. However, this comparison is flawed for two reasons. 1) In many cases, more than one answer is correct. 2) Even where there is a single answer, disagreement among annotators is ubiquitous, making it difficult to decide on a gold standard. We argue that the current methods of adjudication, agreement, and evaluation need serious reconsideration. Some researchers now propose to minimize disagreement and to fix datasets. We argue that this is a gross oversimplification, and likely to conceal the underlying complexity. Instead, we suggest that we need to better capture the sources of disagreement to improve today’s evaluation practice. We discuss three sources of disagreement: from the annotator, the data, and the context, and show how this affects even seemingly objective tasks. Datasets with multiple annotations are becoming more common, as are methods to integrate disagreement into modeling. The logical next step is to extend this to evaluation.",
  "keywords": [
    "we",
    "fields",
    "current",
    "natural language processing nlp",
    "answer",
    "natural",
    "it",
    "processing",
    "objective",
    "today s evaluation practice",
    "data-driven research fields",
    "language",
    "nlp",
    "model",
    "evaluation evaluation"
  ],
  "url": "https://aclanthology.org/2021.bppf-1.3/",
  "provenance": {
    "collected_at": "2025-06-05 08:16:10",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}