{
  "id": "2021.iwslt-1.32",
  "title": "Integrated Training for Sequence-to-Sequence Models Using Non-Autoregressive Transformer",
  "authors": [
    "Tokarchuk, Evgeniia  and\nRosendahl, Jan  and\nWang, Weiyue  and\nPetrushkov, Pavel  and\nLancewicki, Tomer  and\nKhadivi, Shahram  and\nNey, Hermann"
  ],
  "year": "2021",
  "venue": "Proceedings of the 18th International Conference on Spoken Language Translation (IWSLT 2021)",
  "abstract": "Complex natural language applications such as speech translation or pivot translation traditionally rely on cascaded models. However,cascaded models are known to be prone to error propagation and model discrepancy problems. Furthermore, there is no possibility of using end-to-end training data in conventional cascaded systems, meaning that the training data most suited for the task cannot be used. Previous studies suggested several approaches for integrated end-to-end training to overcome those problems, however they mostly rely on(synthetic or natural) three-way data. We propose a cascaded model based on the non-autoregressive Transformer that enables end-to-end training without the need for an explicit intermediate representation. This new architecture (i) avoids unnecessary early decisions that can cause errors which are then propagated throughout the cascaded models and (ii) utilizes the end-to-end training data directly. We conduct an evaluation on two pivot-based machine translation tasks, namely French→German and German→Czech. Our experimental results show that the proposed architecture yields an improvement of more than 2 BLEU for French→German over the cascaded baseline.",
  "keywords": [
    "end",
    "the non-autoregressive transformer",
    "bleu",
    "we",
    "more than 2 bleu",
    "training",
    "translation",
    "natural",
    "pivot translation",
    "sequence",
    "speech translation",
    "an evaluation",
    "i",
    "previous studies",
    "early"
  ],
  "url": "https://aclanthology.org/2021.iwslt-1.32/",
  "provenance": {
    "collected_at": "2025-06-05 08:18:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}