{
  "id": "2021.acl-long.50",
  "title": "Understanding and Countering Stereotypes: A Computational Approach to the Stereotype Content Model",
  "authors": [
    "Fraser, Kathleen C.  and\nNejadgholi, Isar  and\nKiritchenko, Svetlana"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Stereotypical language expresses widely-held beliefs about different social categories. Many stereotypes are overtly negative, while others may appear positive on the surface, but still lead to negative consequences. In this work, we present a computational approach to interpreting stereotypes in text through the Stereotype Content Model (SCM), a comprehensive causal theory from social psychology. The SCM proposes that stereotypes can be understood along two primary dimensions: warmth and competence. We present a method for defining warmth and competence axes in semantic embedding space, and show that the four quadrants defined by this subspace accurately represent the warmth and competence concepts, according to annotated lexicons. We then apply our computational SCM model to textual stereotype data and show that it compares favourably with survey-based studies in the psychological literature. Furthermore, we explore various strategies to counter stereotypical beliefs with anti-stereotypes. It is known that countering stereotypes with anti-stereotypical examples is one of the most effective ways to reduce biased thinking, yet the problem of generating anti-stereotypes has not been previously studied. Thus, a better understanding of how to generate realistic and effective anti-stereotypes can contribute to addressing pressing societal concerns of stereotyping, prejudice, and discrimination.",
  "keywords": [
    "biased thinking",
    "semantic",
    "we",
    "it",
    "different social categories",
    "widely-held beliefs",
    "survey-based studies",
    "biased",
    "semantic embedding space",
    "categories",
    "text",
    "strategies",
    "-",
    "beliefs",
    "anti"
  ],
  "url": "https://aclanthology.org/2021.acl-long.50/",
  "provenance": {
    "collected_at": "2025-06-05 08:00:06",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}