{
  "id": "2021.acl-short.89",
  "title": "A Simple Recipe for Multilingual Grammatical Error Correction",
  "authors": [
    "Rothe, Sascha  and\nMallinson, Jonathan  and\nMalmi, Eric  and\nKrause, Sebastian  and\nSeveryn, Aliaksei"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 2: Short Papers)",
  "abstract": "This paper presents a simple recipe to trainstate-of-the-art multilingual Grammatical Error Correction (GEC) models. We achieve this by first proposing a language-agnostic method to generate a large number of synthetic examples. The second ingredient is to use large-scale multilingual language models (up to 11B parameters). Once fine-tuned on language-specific supervised sets we surpass the previous state-of-the-art results on GEC benchmarks in four languages: English, Czech, German and Russian. Having established a new set of baselines for GEC, we make our results easily reproducible and accessible by releasing a CLANG-8 dataset. It is produced by using our best model, which we call gT5, to clean the targets of a widely used yet noisy Lang-8 dataset. cLang-8 greatly simplifies typical GEC training pipelines composed of multiple fine-tuning stages – we demonstrate that performing a single fine-tuning stepon cLang-8 with the off-the-shelf language models yields further accuracy improvements over an already top-performing gT5 model for English.",
  "keywords": [
    "we",
    "training",
    "it",
    "the second ingredient",
    "ingredient",
    "large-scale multilingual language models",
    "tuning",
    "fine",
    "simplifies",
    "accuracy",
    "further accuracy improvements",
    "language",
    "a single fine-tuning stepon",
    "model",
    "multiple fine-tuning stages"
  ],
  "url": "https://aclanthology.org/2021.acl-short.89/",
  "provenance": {
    "collected_at": "2025-06-05 08:08:18",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}