{
  "id": "2021.acl-long.26",
  "title": "Exploring the Efficacy of Automatically Generated Counterfactuals for Sentiment Analysis",
  "authors": [
    "Yang, Linyi  and\nLi, Jiazheng  and\nCunningham, Padraig  and\nZhang, Yue  and\nSmyth, Barry  and\nDong, Ruihai"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "While state-of-the-art NLP models have been achieving the excellent performance of a wide range of tasks in recent years, important questions are being raised about their robustness and their underlying sensitivity to systematic biases that may exist in their training and test data. Such issues come to be manifest in performance problems when faced with out-of-distribution data in the field. One recent solution has been to use counterfactually augmented datasets in order to reduce any reliance on spurious patterns that may exist in the original data. Producing high-quality augmented data can be costly and time-consuming as it usually needs to involve human feedback and crowdsourcing efforts. In this work, we propose an alternative by describing and evaluating an approach to automatically generating counterfactual data for the purpose of data augmentation and explanation. A comprehensive evaluation on several different datasets and using a variety of state-of-the-art benchmarks demonstrate how our approach can achieve significant improvements in model performance when compared to models training on the original data and even when compared to models trained with the benefit of human-generated augmented data.",
  "keywords": [
    "variety",
    "feedback",
    "field",
    "we",
    "human feedback",
    "training",
    "human-generated augmented data",
    "the field",
    "it",
    "a comprehensive evaluation",
    "a variety",
    "analysis",
    "sentiment analysis",
    "systematic biases",
    "biases"
  ],
  "url": "https://aclanthology.org/2021.acl-long.26/",
  "provenance": {
    "collected_at": "2025-06-05 07:59:47",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}