{
  "id": "2021.acl-long.125",
  "title": "Topic-Driven and Knowledge-Aware Transformer for Dialogue Emotion Detection",
  "authors": [
    "Zhu, Lixing  and\nPergola, Gabriele  and\nGui, Lin  and\nZhou, Deyu  and\nHe, Yulan"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Emotion detection in dialogues is challenging as it often requires the identification of thematic topics underlying a conversation, the relevant commonsense knowledge, and the intricate transition patterns between the affective states. In this paper, we propose a Topic-Driven Knowledge-Aware Transformer to handle the challenges above. We firstly design a topic-augmented language model (LM) with an additional layer specialized for topic detection. The topic-augmented LM is then combined with commonsense statements derived from a knowledge base based on the dialogue contextual information. Finally, a transformer-based encoder-decoder architecture fuses the topical and commonsense information, and performs the emotion label sequence prediction. The model has been experimented on four datasets in dialogue emotion detection, demonstrating its superiority empirically over the existing state-of-the-art approaches. Quantitative and qualitative results show that the model can discover topics which help in distinguishing emotion categories.",
  "keywords": [
    "transformer",
    "knowledge",
    "language",
    "a topic-driven knowledge-aware transformer",
    "categories",
    "model",
    "the dialogue contextual information",
    "dialogues",
    "it",
    "a conversation",
    "topic",
    "encoder",
    "decoder",
    "a topic-augmented language model",
    "information"
  ],
  "url": "https://aclanthology.org/2021.acl-long.125/",
  "provenance": {
    "collected_at": "2025-06-05 08:01:06",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}