{
  "id": "2021.acl-long.278",
  "title": "Knowing the No-match: Entity Alignment with Dangling Cases",
  "authors": [
    "Sun, Zequn  and\nChen, Muhao  and\nHu, Wei"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "This paper studies a new problem setting of entity alignment for knowledge graphs (KGs). Since KGs possess different sets of entities, there could be entities that cannot find alignment across them, leading to the problem of dangling entities. As the first attempt to this problem, we construct a new dataset and design a multi-task learning framework for both entity alignment and dangling entity detection. The framework can opt to abstain from predicting alignment for the detected dangling entities. We propose three techniques for dangling entity detection that are based on the distribution of nearest-neighbor distances, i.e., nearest neighbor classification, marginal ranking and background ranking. After detecting and removing dangling entities, an incorporated entity alignment model in our framework can provide more robust alignment for remaining entities. Comprehensive experiments and analyses demonstrate the effectiveness of our framework. We further discover that the dangling entity detection module can, in turn, improve alignment learning and the final performance. The contributed resource is publicly available to foster further research.",
  "keywords": [
    "alignment",
    "knowledge",
    "i",
    "background",
    "model",
    "entities",
    "alignment learning",
    "the no-match entity alignment",
    "knowledge graphs kgs",
    "both entity alignment",
    "remaining entities comprehensive experiments",
    "we",
    "more robust alignment",
    "learning",
    "entity alignment"
  ],
  "url": "https://aclanthology.org/2021.acl-long.278/",
  "provenance": {
    "collected_at": "2025-06-05 08:03:08",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}