{
  "id": "2021.acl-demo.36",
  "title": "TURING}: an Accurate and Interpretable Multi-Hypothesis Cross-Domain Natural Language Database Interface",
  "authors": [
    "Xu, Peng  and\nZi, Wenjie  and\nShahidi, Hamidreza  and\nK{\\'a}d{\\'a}r, {\\'A}kos  and\nTang, Keyi  and\nYang, Wei  and\nAteeq, Jawad  and\nBarot, Harsh  and\nAlon, Meidan  and\nCao, Yanshuai"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing: System Demonstrations",
  "abstract": "A natural language database interface (NLDB) can democratize data-driven insights for non-technical users. However, existing Text-to-SQL semantic parsers cannot achieve high enough accuracy in the cross-database setting to allow good usability in practice. This work presents TURING, a NLDB system toward bridging this gap. The cross-domain semantic parser of TURING with our novel value prediction method achieves 75.1% execution accuracy, and 78.3% top-5 beam execution accuracy on the Spider validation set (Yu et al., 2018b). To benefit from the higher beam accuracy, we design an interactive system where the SQL hypotheses in the beam are explained step-by-step in natural language, with their differences highlighted. The user can then compare and judge the hypotheses to select which one reflects their intention if any. The English explanations of SQL queries in TURING are produced by our high-precision natural language generation system based on synchronous grammars.",
  "keywords": [
    "precision",
    "validation",
    "semantic",
    "we",
    "the higher beam accuracy",
    "cross",
    "natural",
    "queries",
    "natural language",
    "sql queries",
    "text",
    "75 1 execution accuracy",
    "accuracy",
    "work",
    "language"
  ],
  "url": "https://aclanthology.org/2021.acl-demo.36/",
  "provenance": {
    "collected_at": "2025-06-05 08:09:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}