{
  "id": "2021.internlp-1.2",
  "title": "Apple Core-dination: Linguistic Feedback and Learning in a Speech-to-Action Shared World Game",
  "authors": [
    "Boy, Susann  and\nBrown, AriaRay  and\nWixted, Morgan"
  ],
  "year": "2021",
  "venue": "Proceedings of the First Workshop on Interactive Learning for Natural Language Processing",
  "abstract": "We investigate the question of how adaptive feedback from a virtual agent impacts the linguistic input of the user in a shared world game environment. To do so, we carry out an exploratory pilot study to observe how individualized linguistic feedback affects the user’s speech input. We introduce a speech-controlled game, Apple Core-dination, in which an agent learns complex tasks using a base knowledge of simple actions. The agent is equipped with a learning mechanism for mapping new commands to sequences of simple actions, as well as the ability to incorporate user input into written responses. The agent repeatedly shares its internal knowledge state by responding to what it knows and does not know about language meaning and the shared environment. Our paper focuses on the linguistic feedback loop in order to analyze the nature of user input. Feedback from the agent is provided in the form of visual movement and written linguistic responses. Particular attention is given to incorporating user input into agent responses and updating the speech-to-action mappings based on commands provided by the user. Through our pilot study, we analyze task success and compare the lexical features of user input. Results show variation in input length and lexical variety across users, suggesting a correlation between the two that can be studied further.",
  "keywords": [
    "variety",
    "feedback",
    "question",
    "form",
    "we",
    "it",
    "visual",
    "core",
    "particular attention",
    "action",
    "knowledge",
    "lexical variety",
    "language",
    "attention",
    "its internal knowledge state"
  ],
  "url": "https://aclanthology.org/2021.internlp-1.2/",
  "provenance": {
    "collected_at": "2025-06-05 08:17:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}