{
  "id": "2021.acl-long.29",
  "title": "Aspect-Category-Opinion-Sentiment Quadruple Extraction with Implicit Aspects and Opinions",
  "authors": [
    "Cai, Hongjie  and\nXia, Rui  and\nYu, Jianfei"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Product reviews contain a large number of implicit aspects and implicit opinions. However, most of the existing studies in aspect-based sentiment analysis ignored this problem. In this work, we introduce a new task, named Aspect-Category-Opinion-Sentiment (ACOS) Quadruple Extraction, with the goal to extract all aspect-category-opinion-sentiment quadruples in a review sentence and provide full support for aspect-based sentiment analysis with implicit aspects and opinions. We furthermore construct two new datasets, Restaurant-ACOS and Laptop-ACOS, for this new task, both of which contain the annotations of not only aspect-category-opinion-sentiment quadruples but also implicit aspects and opinions. The former is an extension of the SemEval Restaurant dataset; the latter is a newly collected and annotated Laptop dataset, twice the size of the SemEval Laptop dataset. We finally benchmark the task with four baseline systems. Experiments demonstrate the feasibility of the new task and its effectiveness in extracting and describing implicit aspects and implicit opinions. The two datasets and source code of four systems are publicly released athttps://github.com/NUSTM/ACOS.",
  "keywords": [
    "code",
    "support",
    "a review sentence",
    "extraction",
    "we",
    "product reviews",
    "analysis",
    "reviews",
    "the existing studies",
    "sentiment",
    "work",
    "studies",
    "review",
    "aspect-based sentiment analysis",
    "a large number"
  ],
  "url": "https://aclanthology.org/2021.acl-long.29/",
  "provenance": {
    "collected_at": "2025-06-05 07:59:49",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}