{
  "id": "2021.gebnlp-1.5",
  "title": "Gender Bias in Text: Origin, Taxonomy, and Implications",
  "authors": [
    "Doughman, Jad  and\nKhreich, Wael  and\nEl Gharib, Maya  and\nWiss, Maha  and\nBerjawi, Zahraa"
  ],
  "year": "2021",
  "venue": "Proceedings of the 3rd Workshop on Gender Bias in Natural Language Processing",
  "abstract": "Gender inequality represents a considerable loss of human potential and perpetuates a culture of violence, higher gender wage gaps, and a lack of representation of women in higher and leadership positions. Applications powered by Artificial Intelligence (AI) are increasingly being used in the real world to provide critical decisions about who is going to be hired, granted a loan, admitted to college, etc. However, the main pillars of AI, Natural Language Processing (NLP) and Machine Learning (ML) have been shown to reflect and even amplify gender biases and stereotypes, which are mainly inherited from historical training data. In an effort to facilitate the identification and mitigation of gender bias in English text, we develop a comprehensive taxonomy that relies on the following gender bias types: Generic Pronouns, Sexism, Occupational Bias, Exclusionary Bias, and Semantics. We also provide a bottom-up overview of gender bias, from its societal origin to its spillover onto language. Finally, we link the societal implications of gender bias to their corresponding type(s) in the proposed taxonomy. The underlying motivation of our work is to help enable the technical community to identify and mitigate relevant biases from training corpora for improved fairness in NLP systems.",
  "keywords": [
    "bias",
    "overview",
    "we",
    "training",
    "natural",
    "semantics",
    "loss",
    "machine learning",
    "learning",
    "a bottom-up overview",
    "gender biases",
    "its societal origin",
    "processing",
    "text",
    "generic"
  ],
  "url": "https://aclanthology.org/2021.gebnlp-1.5/",
  "provenance": {
    "collected_at": "2025-06-05 08:17:12",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}