{
  "id": "2021.acl-long.449",
  "title": "Adapting Unsupervised Syntactic Parsing Methodology for Discourse Dependency Parsing",
  "authors": [
    "Zhang, Liwen  and\nWang, Ge  and\nHan, Wenjuan  and\nTu, Kewei"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "One of the main bottlenecks in developing discourse dependency parsers is the lack of annotated training data. A potential solution is to utilize abundant unlabeled data by using unsupervised techniques, but there is so far little research in unsupervised discourse dependency parsing. Fortunately, unsupervised syntactic dependency parsing has been studied by decades, which could potentially be adapted for discourse parsing. In this paper, we propose a simple yet effective method to adapt unsupervised syntactic dependency parsing methodology for unsupervised discourse dependency parsing. We apply the method to adapt two state-of-the-art unsupervised syntactic dependency parsing methods. Experimental results demonstrate that our adaptation is effective. Moreover, we extend the adapted methods to the semi-supervised and supervised setting and surprisingly, we find that they outperform previous methods specially designed for supervised discourse parsing. Further analysis shows our adaptations result in superiority not only in parsing accuracy but also in time and space efficiency.",
  "keywords": [
    "parsing",
    "discourse parsing",
    "unsupervised syntactic parsing methodology",
    "dependency parsers",
    "efficiency",
    "dependency",
    "we",
    "time and space efficiency",
    "time",
    "discourse dependency",
    "analysis",
    "accuracy",
    "training",
    "supervised",
    "abundant unlabeled data"
  ],
  "url": "https://aclanthology.org/2021.acl-long.449/",
  "provenance": {
    "collected_at": "2025-06-05 08:05:27",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}