{
  "id": "2021.starsem-1.4",
  "title": "A Study on Using Semantic Word Associations to Predict the Success of a Novel",
  "authors": [
    "Jannatus Saba, Syeda  and\nBijoy, Biddut Sarker  and\nGorelick, Henry  and\nIsmail, Sabir  and\nIslam, Md Saiful  and\nAmin, Mohammad Ruhul"
  ],
  "year": "2021",
  "venue": "Proceedings of *SEM 2021: The Tenth Joint Conference on Lexical and Computational Semantics",
  "abstract": "Many new books get published every year, and only a fraction of them become popular among the readers. So the prediction of a book success can be a very useful parameter for publishers to make a reliable decision. This article presents the study of semantic word associations using the word embedding of book content for a set of Roget’s thesaurus concepts for book success prediction. In this work, we discuss the method to represent a book as a spectrum of concepts based on the association score between its content embedding and a global embedding (i.e. fastText) for a set of semantically linked word clusters. We show that the semantic word associations outperform the previous methods for book success prediction. In addition, we present that semantic word associations also provide better results than using features like the frequency of word groups in Roget’s thesaurus, LIWC (a popular tool for linguistic inquiry and word count), NRC (word association emotion lexicon), and part of speech (PoS). Our study reports that concept associations based on Roget’s Thesaurus using word embedding of individual novel resulted in the state-of-the-art performance of 0.89 average weighted F1-score for book success prediction. Finally, we present a set of dominant themes that contribute towards the popularity of a book for a specific genre.",
  "keywords": [
    "semantic",
    "we",
    "parameter",
    "word",
    "the semantic word associations",
    "semantic word associations",
    "semantically linked word clusters",
    "work",
    "e fasttext",
    "fasttext",
    "frequency",
    "state",
    "this article",
    "previous",
    "nrc"
  ],
  "url": "https://aclanthology.org/2021.starsem-1.4/",
  "provenance": {
    "collected_at": "2025-06-05 08:23:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}