{
  "id": "2021.acl-long.121",
  "title": "MECT}: {M}ulti-Metadata Embedding based Cross-Transformer for {C}hinese Named Entity Recognition",
  "authors": [
    "Wu, Shuang  and\nSong, Xiaoning  and\nFeng, Zhenhua"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Recently, word enhancement has become very popular for Chinese Named Entity Recognition (NER), reducing segmentation errors and increasing the semantic and boundary information of Chinese words. However, these methods tend to ignore the information of the Chinese character structure after integrating the lexical information. Chinese characters have evolved from pictographs since ancient times, and their structure often reflects more information about the characters. This paper presents a novel Multi-metadata Embedding based Cross-Transformer (MECT) to improve the performance of Chinese NER by fusing the structural information of Chinese characters. Specifically, we use multi-metadata embedding in a two-stream Transformer to integrate Chinese character features with the radical-level embedding. With the structural characteristics of Chinese characters, MECT can better capture the semantic information of Chinese characters for NER. The experimental results obtained on several well-known benchmarking datasets demonstrate the merits and superiority of the proposed MECT method.",
  "keywords": [
    "cross",
    "transformer",
    "ner",
    "ancient",
    "based cross-transformer mect",
    "ancient times",
    "a two-stream transformer",
    "the semantic information",
    "chinese ner",
    "entity recognition ner",
    "-",
    "information",
    "semantic",
    "word",
    "we"
  ],
  "url": "https://aclanthology.org/2021.acl-long.121/",
  "provenance": {
    "collected_at": "2025-06-05 08:01:02",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}