{
  "id": "2021.starsem-1.1",
  "title": "Did the Cat Drink the Coffee? Challenging Transformers with Generalized Event Knowledge",
  "authors": [
    "Pedinotti, Paolo  and\nRambelli, Giulia  and\nChersoni, Emmanuele  and\nSantus, Enrico  and\nLenci, Alessandro  and\nBlache, Philippe"
  ],
  "year": "2021",
  "venue": "Proceedings of *SEM 2021: The Tenth Joint Conference on Lexical and Computational Semantics",
  "abstract": "Prior research has explored the ability of computational models to predict a word semantic fit with a given predicate. While much work has been devoted to modeling the typicality relation between verbs and arguments in isolation, in this paper we take a broader perspective by assessing whether and to what extent computational approaches have access to the information about the typicality of entire events and situations described in language (Generalized Event Knowledge). Given the recent success of Transformers Language Models (TLMs), we decided to test them on a benchmark for the dynamic estimation of thematic fit. The evaluation of these models was performed in comparison with SDM, a framework specifically designed to integrate events in sentence meaning representations, and we conducted a detailed error analysis to investigate which factors affect their behavior. Our results show that TLMs can reach performances that are comparable to those achieved by SDM. However, additional analysis consistently suggests that TLMs do not capture important aspects of event knowledge, and their predictions often depend on surface linguistic features, such as frequent words, collocations and syntactic patterns, thereby showing sub-optimal generalization abilities.",
  "keywords": [
    "transformers",
    "fit",
    "generalized",
    "semantic",
    "we",
    "semantic fit",
    "information",
    "sub-optimal generalization abilities",
    "word",
    "cat",
    "language generalized event knowledge",
    "analysis",
    "abilities",
    "language models tlms",
    "generalization"
  ],
  "url": "https://aclanthology.org/2021.starsem-1.1/",
  "provenance": {
    "collected_at": "2025-06-05 08:22:58",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}