{
  "id": "2021.acl-long.319",
  "title": "Breaking Down Walls of Text: How Can {NLP} Benefit Consumer Privacy?",
  "authors": [
    "Ravichander, Abhilasha  and\nBlack, Alan W  and\nNorton, Thomas  and\nWilson, Shomir  and\nSadeh, Norman"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers)",
  "abstract": "Privacy plays a crucial role in preserving democratic ideals and personal autonomy. The dominant legal approach to privacy in many jurisdictions is the “Notice and Choice” paradigm, where privacy policies are the primary instrument used to convey information to users. However, privacy policies are long and complex documents that are difficult for users to read and comprehend. We discuss how language technologies can play an important role in addressing this information gap, reporting on initial progress towards helping three specific categories of stakeholders take advantage of digital privacy policies: consumers, enterprises, and regulators. Our goal is to provide a roadmap for the development and use of language technologies to empower users to reclaim control over their privacy, limit privacy harms, and rally research efforts from the community towards addressing an issue with large social impact. We highlight many remaining opportunities to develop language technologies that are more precise or nuanced in the way in which they use the text of privacy policies.",
  "keywords": [
    "language technologies",
    "opportunities",
    "we",
    "policies",
    "information",
    "technologies",
    "categories",
    "text",
    "many remaining opportunities",
    "language",
    "privacy policies",
    "three specific categories",
    "documents",
    "approach",
    "advantage"
  ],
  "url": "https://aclanthology.org/2021.acl-long.319/",
  "provenance": {
    "collected_at": "2025-06-05 08:03:41",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}