{
  "id": "2021.semeval-1.160",
  "title": "hub at {S}em{E}val-2021 Task 7: Fusion of {ALBERT} and Word Frequency Information Detecting and Rating Humor and Offense",
  "authors": [
    "Huang, Bo  and\nBai, Yang"
  ],
  "year": "2021",
  "venue": "Proceedings of the 15th International Workshop on Semantic Evaluation (SemEval-2021)",
  "abstract": "This paper introduces the system description of the hub team, which explains the related work and experimental results of our team’s participation in SemEval 2021 Task 7: HaHackathon: Detecting and Rating Humor and Offense. We successfully submitted the test set prediction results of the two subtasks in the task. The goal of the task is to perform humor detection, grade evaluation, and offensive evaluation on each English text data in the data set. Tasks can be divided into two types of subtasks. One is a text classification task, and the other is a text regression task. What we need to do is to use our method to detect the humor and offensive information of the sentence as accurately as possible. The methods used in the results submitted by our team are mainly composed of ALBERT, CNN, and Tf-Idf algorithms. The result evaluation indicators submitted by the classification task are F1 score and Accuracy. The result evaluation index of the regression task submission is the RMSE. The final scores of the prediction results of the two subtask test sets submitted by our team are task1a 0.921 (F1), task1a 0.9364 (Accuracy), task1b 0.6288 (RMSE), task1c 0.5333 (F1), task1c 0.0.5591 (Accuracy), and task2 0.5027 (RMSE) respectively.",
  "keywords": [
    "em",
    "we",
    "fusion",
    "classification",
    "cnn",
    "0 5333 f1",
    "albert",
    "information",
    "e",
    "word",
    "5591 accuracy",
    "the result evaluation indicators",
    "the result evaluation index",
    "the classification task",
    "text"
  ],
  "url": "https://aclanthology.org/2021.semeval-1.160/",
  "provenance": {
    "collected_at": "2025-06-05 08:21:53",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}