{
  "id": "2021.acl-srw.12",
  "title": "How do different factors Impact the Inter-language Similarity? A Case Study on {I}ndian languages",
  "authors": [
    "Kumar, Sourav  and\nAggarwal, Salil  and\nSharma, Dipti Misra  and\nMamidi, Radhika"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing: Student Research Workshop",
  "abstract": "India is one of the most linguistically diverse nations of the world and is culturally very rich. Most of these languages are somewhat similar to each other on account of sharing a common ancestry or being in contact for a long period of time. Nowadays, researchers are constantly putting efforts in utilizing the language relatedness to improve the performance of various NLP systems such as cross lingual semantic search, machine translation, sentiment analysis systems, etc. So in this paper, we performed an extensive case study on similarity involving languages of the Indian subcontinent. Language similarity prediction is defined as the task of measuring how similar the two languages are on the basis of their lexical, morphological and syntactic features. In this study, we concentrate only on the approach to calculate lexical similarity between Indian languages by looking at various factors such as size and type of corpus, similarity algorithms, subword segmentation, etc. The main takeaways from our work are: (i) Relative order of the language similarities largely remain the same, regardless of the factors mentioned above, (ii) Similarity within the same language family is higher, (iii) Languages share more lexical features at the subword level.",
  "keywords": [
    "semantic",
    "we",
    "translation",
    "cross",
    "rich",
    "analysis",
    "i",
    "various nlp systems",
    "sentiment",
    "work",
    "similarities",
    "language",
    "nlp",
    "machine",
    "time"
  ],
  "url": "https://aclanthology.org/2021.acl-srw.12/",
  "provenance": {
    "collected_at": "2025-06-05 08:09:09",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}