{
  "id": "2021.acl-short.31",
  "title": "Multilingual Agreement for Multilingual Neural Machine Translation",
  "authors": [
    "Yang, Jian  and\nYin, Yuwei  and\nMa, Shuming  and\nHuang, Haoyang  and\nZhang, Dongdong  and\nLi, Zhoujun  and\nWei, Furu"
  ],
  "year": "2021",
  "venue": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 2: Short Papers)",
  "abstract": "Although multilingual neural machine translation (MNMT) enables multiple language translations, the training process is based on independent multilingual objectives. Most multilingual models can not explicitly exploit different language pairs to assist each other, ignoring the relationships among them. In this work, we propose a novel agreement-based method to encourage multilingual agreement among different translation directions, which minimizes the differences among them. We combine the multilingual training objectives with the agreement term by randomly substituting some fragments of the source language with their counterpart translations of auxiliary languages. To examine the effectiveness of our method, we conduct experiments on the multilingual translation task of 10 language pairs. Experimental results show that our method achieves significant improvements over the previous multilingual baselines.",
  "keywords": [
    "work",
    "process",
    "objectives",
    "language",
    "neural",
    "machine",
    "the multilingual training objectives",
    "multiple language translations",
    "we",
    "their counterpart translations",
    "different translation directions",
    "translations",
    "multilingual neural machine translation",
    "the multilingual translation task",
    "independent multilingual objectives"
  ],
  "url": "https://aclanthology.org/2021.acl-short.31/",
  "provenance": {
    "collected_at": "2025-06-05 08:07:32",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}