{
  "id": "2022.acl-long.317",
  "title": "Multilingual Generative Language Models for Zero-Shot Cross-Lingual Event Argument Extraction",
  "authors": [
    "Huang, Kuan-Hao  and\nHsu, I-Hung  and\nNatarajan, Prem  and\nChang, Kai-Wei  and\nPeng, Nanyun"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "We present a study on leveraging multilingual pre-trained generative language models for zero-shot cross-lingual event argument extraction (EAE). By formulating EAE as a language generation task, our method effectively encodes event structures and captures the dependencies between arguments. We design language-agnostic templates to represent the event argument structures, which are compatible with any language, hence facilitating the cross-lingual transfer. Our proposed model finetunes multilingual pre-trained generative language models to generate sentences that fill in the language-agnostic template with arguments extracted from the input passage. The model is trained on source languages and is then directly applied to target languages for event argument extraction. Experiments demonstrate that the proposed model outperforms the current state-of-the-art models on zero-shot cross-lingual EAE. Comprehensive studies and error analyses are presented to better understand the advantages and the current limitations of using generative language models for zero-shot cross-lingual transfer EAE.",
  "keywords": [
    "cross",
    "generative",
    "language",
    "generation",
    "extraction",
    "model",
    "studies",
    "zero-shot cross-lingual transfer",
    "generative language models",
    "dependencies",
    "multilingual generative language models",
    "a language generation",
    "the dependencies",
    "we",
    "transfer"
  ],
  "url": "https://aclanthology.org/2022.acl-long.317/",
  "provenance": {
    "collected_at": "2025-06-05 08:28:34",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}