{
  "id": "2022.ecnlp-1.24",
  "title": "Investigating the Generative Approach for Question Answering in {E}-Commerce",
  "authors": [
    "Roy, Kalyani  and\nBalapanuru, Vineeth  and\nNayak, Tapas  and\nGoyal, Pawan"
  ],
  "year": "2022",
  "venue": "Proceedings of the Fifth Workshop on e-Commerce and NLP (ECNLP 5)",
  "abstract": "Many e-commerce websites provide Product-related Question Answering (PQA) platform where potential customers can ask questions related to a product, and other consumers can post an answer to that question based on their experience. Recently, there has been a growing interest in providing automated responses to product questions. In this paper, we investigate the suitability of the generative approach for PQA. We use state-of-the-art generative models proposed by Deng et al.(2020) and Lu et al.(2020) for this purpose. On closer examination, we find several drawbacks in this approach: (1) input reviews are not always utilized significantly for answer generation, (2) the performance of the models is abysmal while answering the numerical questions, (3) many of the generated answers contain phrases like “I do not know” which are taken from the reference answer in training data, and these answers do not convey any information to the customer. Although these approaches achieve a high ROUGE score, it does not reflect upon these shortcomings of the generated answers. We hope that our analysis will lead to more rigorous PQA approaches, and future research will focus on addressing these shortcomings in PQA.",
  "keywords": [
    "question",
    "the generated answers",
    "we",
    "a high rouge score",
    "training",
    "answer",
    "it",
    "pqa platform",
    "information",
    "answer generation",
    "pqa",
    "analysis",
    "reviews",
    "generative",
    "i"
  ],
  "url": "https://aclanthology.org/2022.ecnlp-1.24/",
  "provenance": {
    "collected_at": "2025-06-05 08:42:25",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}