{
  "id": "2022.findings-acl.15",
  "title": "Sememe Prediction for {B}abel{N}et Synsets using Multilingual and Multimodal Information",
  "authors": [
    "Qi, Fanchao  and\nLv, Chuancheng  and\nLiu, Zhiyuan  and\nMeng, Xiaojun  and\nSun, Maosong  and\nZheng, Hai-Tao"
  ],
  "year": "2022",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2022",
  "abstract": "In linguistics, a sememe is defined as the minimum semantic unit of languages. Sememe knowledge bases (KBs), which are built by manually annotating words with sememes, have been successfully applied to various NLP tasks. However, existing sememe KBs only cover a few languages, which hinders the wide utilization of sememes. To address this issue, the task of sememe prediction for BabelNet synsets (SPBS) is presented, aiming to build a multilingual sememe KB based on BabelNet, a multilingual encyclopedia dictionary. By automatically predicting sememes for a BabelNet synset, the words in many languages in the synset would obtain sememe annotations simultaneously. However, previous SPBS methods have not taken full advantage of the abundant information in BabelNet. In this paper, we utilize the multilingual synonyms, multilingual glosses and images in BabelNet for SPBS. We design a multimodal information fusion model to encode and combine this information for sememe prediction. Experimental results show the substantial outperformance of our model over previous methods (about 10 MAP and F1 scores). All the code and data of this paper can be obtained athttps://github.com/thunlp/MSGI.",
  "keywords": [
    "code",
    "f1",
    "semantic",
    "we",
    "fusion",
    "map",
    "information",
    "knowledge",
    "nlp",
    "model",
    "various nlp tasks",
    "thunlp",
    "the minimum semantic unit",
    "advantage",
    "images"
  ],
  "url": "https://aclanthology.org/2022.findings-acl.15/",
  "provenance": {
    "collected_at": "2025-06-05 08:35:02",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}