{
  "id": "2022.acl-short.41",
  "title": "C}-{MORE}: Pretraining to Answer Open-Domain Questions by Consulting Millions of References",
  "authors": [
    "Yue, Xiang  and\nPan, Xiaoman  and\nYao, Wenlin  and\nYu, Dian  and\nYu, Dong  and\nChen, Jianshu"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers)",
  "abstract": "We consider the problem of pretraining a two-stage open-domain question answering (QA) system (retriever + reader) with strong transfer capabilities. The key challenge is how to construct a large amount of high-quality question-answer-context triplets without task-specific annotations. Specifically, the triplets should align well with downstream tasks by: (i) covering a wide range of domains (for open-domain applications), (ii) linking a question to its semantically relevant context with supporting evidence (for training the retriever), and (iii) identifying the correct answer in the context (for training the reader). Previous pretraining approaches generally fall short of one or more of these requirements. In this work, we automatically construct a large-scale corpus that meets all three criteria by consulting millions of references cited within Wikipedia. The well-aligned pretraining signals benefit both the retriever and the reader significantly. Our pretrained retriever leads to 2%-10% absolute gains in top-20 accuracy. And with our pretrained reader, the entire system improves by up to 4% in exact match.",
  "keywords": [
    "both the retriever",
    "question",
    "top-20 accuracy",
    "we",
    "our pretrained retriever",
    "answer",
    "transfer",
    "i",
    "accuracy",
    "work",
    "capabilities",
    "strong transfer capabilities",
    "retriever",
    "qa system retriever reader",
    "its semantically relevant context"
  ],
  "url": "https://aclanthology.org/2022.acl-short.41/",
  "provenance": {
    "collected_at": "2025-06-05 08:32:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}