{
  "id": "2022.ltedi-1.47",
  "title": "MUCS}@Text-{LT}-{EDI}@{ACL} 2022: Detecting Sign of Depression from Social Media Text using Supervised Learning Approach",
  "authors": [
    "Hegde, Asha  and\nCoelho, Sharal  and\nDashti, Ahmad Elyas  and\nShashirekha, Hosahalli"
  ],
  "year": "2022",
  "venue": "Proceedings of the Second Workshop on Language Technology for Equality, Diversity and Inclusion",
  "abstract": "Social media has seen enormous growth in its users recently and knowingly or unknowingly the behavior of a person will be reflected in the comments she/he posts on social media. Users having the sign of depression may post negative or disturbing content seeking the attention of other users. Hence, social media data can be analysed to check whether the users’ have the sign of depression and help them to get through the situation if required. However, as analyzing the increasing amount of social media data manually in laborious and error-prone, automated tools have to be developed for the same. To address the issue of detecting the sign of depression content on social media, in this paper, we - team MUCS, describe an Ensemble of Machine Learning (ML) models and a Transfer Learning (TL) model submitted to “Detecting Signs of Depression from Social Media Text-LT-EDI@ACL 2022” (DepSign-LT-EDI@ACL-2022) shared task at Association for Computational Linguistics (ACL) 2022. Both frequency and text based features are used to train an Ensemble model and Bidirectional Encoder Representations from Transformers (BERT) fine-tuned with raw text is used to train the TL model. Among the two models, the TL model performed better with a macro averaged F-score of 0.479 and placed 18th rank in the shared task. The code to reproduce the proposed models is available in github page1.",
  "keywords": [
    "code",
    "transformers",
    "ensemble",
    "bidirectional encoder representations",
    "machine learning",
    "learning",
    "transfer",
    "an ensemble",
    "bert",
    "text",
    "an ensemble model",
    "he",
    "model",
    "machine",
    "encoder"
  ],
  "url": "https://aclanthology.org/2022.ltedi-1.47/",
  "provenance": {
    "collected_at": "2025-06-05 08:44:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}