{
  "id": "2022.ecnlp-1.12",
  "title": "Product Titles-to-Attributes As a Text-to-Text Task",
  "authors": [
    "Fuchs, Gilad  and\nAcriche, Yoni"
  ],
  "year": "2022",
  "venue": "Proceedings of the Fifth Workshop on e-Commerce and NLP (ECNLP 5)",
  "abstract": "Online marketplaces use attribute-value pairs, such as brand, size, size type, color, etc. to help define important and relevant facts about a listing. These help buyers to curate their search results using attribute filtering and overall create a richer experience. Although their critical importance for listings’ discoverability, getting sellers to input tens of different attribute-value pairs per listing is costly and often results in missing information. This can later translate to the unnecessary removal of relevant listings from the search results when buyers are filtering by attribute values. In this paper we demonstrate using a Text-to-Text hierarchical multi-label ranking model framework to predict the most relevant attributes per listing, along with their expected values, using historic user behavioral data. This solution helps sellers by allowing them to focus on verifying information on attributes that are likely to be used by buyers, and thus, increase the expected recall for their listings. Specifically for eBay’s case we show that using this model can improve the relevancy of the attribute extraction process by 33.2% compared to the current highly-optimized production system. Apart from the empirical contribution, the highly generalized nature of the framework presented in this paper makes it relevant for many high-volume search-driven websites.",
  "keywords": [
    "extraction",
    "generalized",
    "the highly generalized nature",
    "we",
    "current",
    "it",
    "information",
    "text",
    "experience",
    "recall",
    "hierarchical",
    "process",
    "model",
    "the expected recall",
    "a richer experience"
  ],
  "url": "https://aclanthology.org/2022.ecnlp-1.12/",
  "provenance": {
    "collected_at": "2025-06-05 08:42:15",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}