{
  "id": "2022.acl-long.127",
  "title": "Under the Morphosyntactic Lens: A Multifaceted Evaluation of Gender Bias in Speech Translation",
  "authors": [
    "Savoldi, Beatrice  and\nGaido, Marco  and\nBentivogli, Luisa  and\nNegri, Matteo  and\nTurchi, Marco"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Gender bias is largely recognized as a problematic phenomenon affecting language technologies, with recent studies underscoring that it might surface differently across languages. However, most of current evaluation practices adopt a word-level focus on a narrow set of occupational nouns under synthetic conditions. Such protocols overlook key features of grammatical gender languages, which are characterized by morphosyntactic chains of gender agreement, marked on a variety of lexical items and parts-of-speech (POS). To overcome this limitation, we enrich the natural, gender-sensitive MuST-SHE corpus (Bentivogli et al., 2020) with two new linguistic annotation layers (POS and agreement chains), and explore to what extent different lexical categories and agreement phenomena are impacted by gender skews. Focusing on speech translation, we conduct a multifaceted evaluation on three language directions (English-French/Italian/Spanish), with models trained on varying amounts of data and different word segmentation techniques. By shedding light on model behaviours, gender bias, and its detection at several levels of granularity, our findings emphasize the value of dedicated analyses beyond aggregated overall results.",
  "keywords": [
    "variety",
    "bias",
    "language technologies",
    "speech translation gender bias",
    "we",
    "current",
    "translation",
    "natural",
    "it",
    "technologies",
    "word",
    "speech translation",
    "a variety",
    "model behaviours gender bias",
    "categories"
  ],
  "url": "https://aclanthology.org/2022.acl-long.127/",
  "provenance": {
    "collected_at": "2025-06-05 08:26:01",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}