{
  "id": "2022.acl-long.496",
  "title": "Interpretability for Language Learners Using Example-Based Grammatical Error Correction",
  "authors": [
    "Kaneko, Masahiro  and\nTakase, Sho  and\nNiwa, Ayana  and\nOkazaki, Naoaki"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Grammatical Error Correction (GEC) should not focus only on high accuracy of corrections but also on interpretability for language learning. However, existing neural-based GEC models mainly aim at improving accuracy, and their interpretability has not been explored.A promising approach for improving interpretability is an example-based method, which uses similar retrieved examples to generate corrections. In addition, examples are beneficial in language learning, helping learners understand the basis of grammatically incorrect/correct texts and improve their confidence in writing. Therefore, we hypothesize that incorporating an example-based method into GEC can improve interpretability as well as support language learners. In this study, we introduce an Example-Based GEC (EB-GEC) that presents examples to language learners as a basis for a correction result. The examples consist of pairs of correct and incorrect sentences similar to a given input and its predicted correction. Experiments demonstrate that the examples presented by EB-GEC help language learners decide to accept or refuse suggestions from the GEC output. Furthermore, the experiments also show that retrieved examples improve the accuracy of corrections.",
  "keywords": [
    "the accuracy",
    "language",
    "neural",
    "learners",
    "support",
    "high accuracy",
    "eb-gec help language learners",
    "we",
    "retrieved examples",
    "language learners",
    "similar retrieved examples",
    "helping learners",
    "accuracy",
    "that",
    "promising"
  ],
  "url": "https://aclanthology.org/2022.acl-long.496/",
  "provenance": {
    "collected_at": "2025-06-05 08:30:58",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}