{
  "id": "2022.iwslt-1.8",
  "title": "M}irror{A}lign: A Super Lightweight Unsupervised Word Alignment Model via Cross-Lingual Contrastive Learning",
  "authors": [
    "Wu, Di  and\nDing, Liang  and\nYang, Shuo  and\nLi, Mingyang"
  ],
  "year": "2022",
  "venue": "Proceedings of the 19th International Conference on Spoken Language Translation (IWSLT 2022)",
  "abstract": "Word alignment is essential for the downstream cross-lingual language understanding and generation tasks. Recently, the performance of the neural word alignment models has exceeded that of statistical models. However, they heavily rely on sophisticated translation models. In this study, we propose a super lightweight unsupervised word alignment model named MirrorAlign, in which bidirectional symmetric attention trained with a contrastive learning objective is introduced, and an agreement loss is employed to bind the attention maps, such that the alignments follow mirror-like symmetry hypothesis. Experimental results on several public benchmarks demonstrate that our model achieves competitive, if not better, performance compared to the state of the art in word alignment while significantly reducing the training and decoding time on average. Further ablation analysis and case studies show the superiority of our proposed MirrorAlign. Notably, we recognize our model as a pioneer attempt to unify bilingual word embedding and word alignments. Encouragingly, our approach achieves 16.4X speedup against GIZA++, and 50X parameter compression compared with the Transformer-based alignment methods. We release our code to facilitate the community:https://github.com/moore3930/MirrorAlign.",
  "keywords": [
    "code",
    "alignments",
    "we",
    "parameter",
    "training",
    "translation",
    "bidirectional symmetric attention",
    "cross",
    "neural",
    "word alignments",
    "loss",
    "generation tasks",
    "word",
    "learning",
    "analysis"
  ],
  "url": "https://aclanthology.org/2022.iwslt-1.8/",
  "provenance": {
    "collected_at": "2025-06-05 08:43:33",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}