{
  "id": "2022.findings-acl.122",
  "title": "Revisiting Automatic Evaluation of Extractive Summarization Task: Can We Do Better than {ROUGE}?",
  "authors": [
    "Akter, Mousumi  and\nBansal, Naman  and\nKarmaker, Shubhra Kanti"
  ],
  "year": "2022",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2022",
  "abstract": "It has been the norm for a long time to evaluate automated summarization tasks using the popular ROUGE metric. Although several studies in the past have highlighted the limitations of ROUGE, researchers have struggled to reach a consensus on a better alternative until today. One major limitation of the traditional ROUGE metric is the lack of semantic understanding (relies on direct overlap of n-grams). In this paper, we exclusively focus on the extractive summarization task and propose a semantic-aware nCG (normalized cumulative gain)-based evaluation metric (called Sem-nCG) for evaluating this task. One fundamental contribution of the paper is that it demonstrates how we can generate more reliable semantic-aware ground truths for evaluating extractive summarization tasks without any additional human intervention. To the best of our knowledge, this work is the first of its kind. We have conducted extensive experiments with this new metric using the widely used CNN/DailyMail dataset. Experimental results show that the new Sem-nCG metric is indeed semantic-aware, shows higher correlation with human judgement (more reliable) and yields a large number of disagreements with the original ROUGE metric (suggesting that ROUGE often leads to inaccurate conclusions also verified by humans).",
  "keywords": [
    "semantic",
    "summarization",
    "we",
    "rouge researchers",
    "norm",
    "semantic understanding",
    "the traditional rouge metric",
    "sem",
    "cnn",
    "it",
    "the extractive summarization task",
    "several studies",
    "the original rouge metric",
    "automatic evaluation",
    "metric"
  ],
  "url": "https://aclanthology.org/2022.findings-acl.122/",
  "provenance": {
    "collected_at": "2025-06-05 08:36:29",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}