{
  "id": "2022.computel-1.21",
  "title": "Fine-tuning pre-trained models for Automatic Speech Recognition, experiments on a fieldwork corpus of Japhug (Trans-Himalayan family)",
  "authors": [
    "Guillaume, S{\\'e}verine  and\nWisniewski, Guillaume  and\nMacaire, C{\\'e}cile  and\nJacques, Guillaume  and\nMichaud, Alexis  and\nGalliot, Benjamin  and\nCoavoux, Maximin  and\nRossato, Solange  and\nNguy{\\^e}n, Minh-Ch{\\^a}u  and\nFily, Maxime"
  ],
  "year": "2022",
  "venue": "Proceedings of the Fifth Workshop on the Use of Computational Methods in the Study of Endangered Languages",
  "abstract": "This is a report on results obtained in the development of speech recognition tools intended to support linguistic documentation efforts. The test case is an extensive fieldwork corpus of Japhug, an endangered language of the Trans-Himalayan (Sino-Tibetan) family. The goal is to reduce the transcription workload of field linguists. The method used is a deep learning approach based on the language-specific tuning of a generic pre-trained representation model, XLS-R, using a Transformer architecture. We note difficulties in implementation, in terms of learning stability. But this approach brings significant improvements nonetheless. The quality of phonemic transcription is improved over earlier experiments; and most significantly, the new approach allows for reaching the stage of automatic word recognition. Subjective evaluation of the tool by the author of the training data confirms the usefulness of this approach.",
  "keywords": [
    "deep",
    "earlier experiments",
    "fieldwork",
    "field",
    "we",
    "a transformer architecture",
    "training",
    "word",
    "learning",
    "difficulties",
    "a fieldwork corpus",
    "tuning",
    "trans",
    "generic",
    "an extensive fieldwork corpus"
  ],
  "url": "https://aclanthology.org/2022.computel-1.21/",
  "provenance": {
    "collected_at": "2025-06-05 08:40:40",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}