{
  "id": "2022.findings-acl.306",
  "title": "C}hinese Synesthesia Detection: New Dataset and Models",
  "authors": [
    "Jiang, Xiaotong  and\nZhao, Qingqing  and\nLong, Yunfei  and\nWang, Zhongqing"
  ],
  "year": "2022",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2022",
  "abstract": "In this paper, we introduce a new task called synesthesia detection, which aims to extract the sensory word of a sentence, and to predict the original and synesthetic sensory modalities of the corresponding sensory word. Synesthesia refers to the description of perceptions in one sensory modality through concepts from other modalities. It involves not only a linguistic phenomenon, but also a cognitive phenomenon structuring human thought and action, which makes it become a bridge between figurative linguistic phenomenon and abstract cognition, and thus be helpful to understand the deep semantics. To address this, we construct a large-scale human-annotated Chinese synesthesia dataset, which contains 7,217 annotated sentences accompanied by 187 sensory words. Based on this dataset, we propose a family of strong and representative baseline models. Upon these baselines, we further propose a radical-based neural network model to identify the boundary of the sensory word, and to jointly detect the original and synesthetic sensory modalities for the word. Through extensive experiments, we observe that the importance of the proposed task and dataset can be verified by the statistics and progressive performances. In addition, our proposed model achieves state-of-the-art results on the synesthesia dataset.",
  "keywords": [
    "deep",
    "we",
    "other modalities",
    "neural",
    "semantics",
    "it",
    "word",
    "the deep semantics",
    "action",
    "thought",
    "model",
    "human",
    "modalities",
    "network",
    "performances"
  ],
  "url": "https://aclanthology.org/2022.findings-acl.306/",
  "provenance": {
    "collected_at": "2025-06-05 08:38:57",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}