{
  "id": "2022.acl-long.437",
  "title": "Guided Attention Multimodal Multitask Financial Forecasting with Inter-Company Relationships and Global and Local News",
  "authors": [
    "Ang, Gary  and\nLim, Ee-Peng"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Most works on financial forecasting use information directly associated with individual companies (e.g., stock prices, news on the company) to predict stock returns for trading. We refer to such company-specific information as local information. Stock returns may also be influenced by global information (e.g., news on the economy in general), and inter-company relationships. Capturing such diverse information is challenging due to the low signal-to-noise ratios, different time-scales, sparsity and distributions of global and local information from different modalities. In this paper, we propose a model that captures both global and local multimodal information for investment and risk management-related forecasting tasks. Our proposed Guided Attention Multimodal Multitask Network (GAME) model addresses these challenges by using novel attention modules to guide learning with global and local information from different modalities and dynamic inter-company relationship networks. Our extensive experiments show that GAME outperforms other state-of-the-art models in several forecasting tasks and important real-world application case studies.",
  "keywords": [
    "novel attention modules",
    "we",
    "general and inter-company relationships",
    "individual companies",
    "information",
    "different modalities",
    "general",
    "model",
    "studies",
    "modalities",
    "companies",
    "attention",
    "network",
    "time",
    "local information stock returns"
  ],
  "url": "https://aclanthology.org/2022.acl-long.437/",
  "provenance": {
    "collected_at": "2025-06-05 08:30:12",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}