{
  "id": "2022.repl4nlp-1.20",
  "title": "TRA}ttack: Text Rewriting Attack Against Text Retrieval",
  "authors": [
    "Song, Junshuai  and\nZhang, Jiangshan  and\nZhu, Jifeng  and\nTang, Mengyun  and\nYang, Yong"
  ],
  "year": "2022",
  "venue": "Proceedings of the 7th Workshop on Representation Learning for NLP",
  "abstract": "Text retrieval has been widely-used in many online applications to help users find relevant information from a text collection. In this paper, we study a new attack scenario against text retrieval to evaluate its robustness to adversarial attacks under the black-box setting, in which attackers want their own texts to always get high relevance scores with different users’ input queries and thus be retrieved frequently and can receive large amounts of impressions for profits. Considering that most current attack methods only simply follow certain fixed optimization rules, we propose a novel text rewriting attack (TRAttack) method with learning ability from the multi-armed bandit mechanism. Extensive experiments conducted on simulated victim environments demonstrate that TRAttack can yield texts that have higher relevance scores with different given users’ queries than those generated by current state-of-the-art attack methods. We also evaluate TRAttack on Tencent Cloud’s and Baidu Cloud’s commercially-available text retrieval APIs, and the rewritten adversarial texts successfully get high relevance scores with different user queries, which shows the practical potential of our method and the risk of text retrieval systems.",
  "keywords": [
    "different user queries",
    "commercially-available text retrieval apis",
    "we",
    "text retrieval systems",
    "current",
    "certain fixed optimization rules",
    "cloud",
    "queries",
    "retrieval",
    "information",
    "text retrieval",
    "text",
    "different given users queries",
    "text retrieval text retrieval",
    "optimization"
  ],
  "url": "https://aclanthology.org/2022.repl4nlp-1.20/",
  "provenance": {
    "collected_at": "2025-06-05 08:45:53",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}