{
  "id": "2022.computel-1.18",
  "title": "Using Graph-Based Methods to Augment Online Dictionaries of Endangered Languages",
  "authors": [
    "Alnajjar, Khalid  and\nH{\\\"a}m{\\\"a}l{\\\"a}inen, Mika  and\nTapio Partanen, Niko  and\nRueter, Jack"
  ],
  "year": "2022",
  "venue": "Proceedings of the Fifth Workshop on the Use of Computational Methods in the Study of Endangered Languages",
  "abstract": "Many endangered Uralic languages have multilingual machine readable dictionaries saved in an XML format. However, the dictionaries cover translations very inconsistently between language pairs, for instance, the Livonian dictionary has some translations to Finnish, Latvian and Estonian, and the Komi-Zyrian dictionary has some translations to Finnish, English and Russian. We utilize graph-based approaches to augment such dictionaries by predicting new translations to existing and new languages based on different dictionaries for endangered languages and Wiktionaries. Our study focuses on the lexical resources for Komi-Zyrian (kpv), Erzya (myv) and Livonian (liv). We evaluate our approach by human judges fluent in the three endangered languages in question. Based on the evaluation, the method predicted good or acceptable translations 77% of the time. Furthermore, we train a neural prediction model to predict the quality of the automatically predicted translations with an 81% accuracy. The resulting extensions to the dictionaries are made available on the online dictionary platform used by the speakers of these languages.",
  "keywords": [
    "the dictionaries",
    "question",
    "we",
    "graph",
    "an 81 accuracy",
    "neural",
    "such dictionaries",
    "different dictionaries",
    "format",
    "multilingual machine readable dictionaries",
    "some translations",
    "online dictionaries",
    "accuracy",
    "new translations",
    "the automatically predicted translations"
  ],
  "url": "https://aclanthology.org/2022.computel-1.18/",
  "provenance": {
    "collected_at": "2025-06-05 08:40:38",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}