{
  "id": "2022.findings-acl.165",
  "title": "BBQ}: A hand-built bias benchmark for question answering",
  "authors": [
    "Parrish, Alicia  and\nChen, Angelica  and\nNangia, Nikita  and\nPadmakumar, Vishakh  and\nPhang, Jason  and\nThompson, Jana  and\nHtut, Phu Mon  and\nBowman, Samuel"
  ],
  "year": "2022",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2022",
  "abstract": "It is well documented that NLP models learn social biases, but little work has been done on how these biases manifest in model outputs for applied tasks like question answering (QA). We introduce the Bias Benchmark for QA (BBQ), a dataset of question-sets constructed by the authors that highlight attested social biases against people belonging to protected classes along nine social dimensions relevant for U.S. English-speaking contexts. Our task evaluate model responses at two levels: (i) given an under-informative context, we test how strongly responses reflect social biases, and (ii) given an adequately informative context, we test whether the model’s biases override a correct answer choice. We find that models often rely on stereotypes when the context is under-informative, meaning the model’s outputs consistently reproduce harmful biases in this setting. Though models are more accurate when the context provides an informative answer, they still rely on stereotypes and average up to 3.4 percentage points higher accuracy when the correct answer aligns with a social bias than when it conflicts, with this difference widening to over 5 points on examples targeting gender for most models tested.",
  "keywords": [
    "bias",
    "social biases",
    "question",
    "we",
    "answer",
    "the model s biases",
    "it",
    "the bias benchmark",
    "a social bias",
    "nlp models",
    "i",
    "applied tasks",
    "a hand-built bias benchmark",
    "biases",
    "accuracy"
  ],
  "url": "https://aclanthology.org/2022.findings-acl.165/",
  "provenance": {
    "collected_at": "2025-06-05 08:37:05",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}