{
  "id": "2022.acl-long.189",
  "title": "Down and Across: Introducing Crossword-Solving as a New {NLP} Benchmark",
  "authors": [
    "Kulshreshtha, Saurabh  and\nKovaleva, Olga  and\nShivagunde, Namrata  and\nRumshisky, Anna"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Solving crossword puzzles requires diverse reasoning capabilities, access to a vast amount of knowledge about language and the world, and the ability to satisfy the constraints imposed by the structure of the puzzle. In this work, we introduce solving crossword puzzles as a new natural language understanding task. We release a corpus of crossword puzzles collected from the New York Times daily crossword spanning 25 years and comprised of a total of around nine thousand puzzles. These puzzles include a diverse set of clues: historic, factual, word meaning, synonyms/antonyms, fill-in-the-blank, abbreviations, prefixes/suffixes, wordplay, and cross-lingual, as well as clues that depend on the answers to other clues. We separately release the clue-answer pairs from these puzzles as an open-domain question answering dataset containing over half a million unique clue-answer pairs. For the question answering task, our baselines include several sequence-to-sequence and retrieval-based generative models. We also introduce a non-parametric constraint satisfaction baseline for solving the entire crossword puzzle. Finally, we propose an evaluation framework which consists of several complementary performance metrics.",
  "keywords": [
    "several complementary performance metrics",
    "a new nlp benchmark",
    "question",
    "we",
    "cross",
    "answer",
    "natural",
    "retrieval",
    "word",
    "sequence",
    "an evaluation framework",
    "generative",
    "metrics",
    "work",
    "diverse reasoning capabilities access"
  ],
  "url": "https://aclanthology.org/2022.acl-long.189/",
  "provenance": {
    "collected_at": "2025-06-05 08:26:51",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}