{
  "id": "2022.ltedi-1.31",
  "title": "SOA}{\\_}{NLP}@{LT}-{EDI}-{ACL}2022: An Ensemble Model for Hope Speech Detection from {Y}ou{T}ube Comments",
  "authors": [
    "Kumar, Abhinav  and\nSaumya, Sunil  and\nRoy, Pradeep"
  ],
  "year": "2022",
  "venue": "Proceedings of the Second Workshop on Language Technology for Equality, Diversity and Inclusion",
  "abstract": "Language should be accommodating of equality and diversity as a fundamental aspect of communication. The language of internet users has a big impact on peer users all over the world. On virtual platforms such as Facebook, Twitter, and YouTube, people express their opinions in different languages. People respect others’ accomplishments, pray for their well-being, and cheer them on when they fail. Such motivational remarks are hope speech remarks. Simultaneously, a group of users encourages discrimination against women, people of color, people with disabilities, and other minorities based on gender, race, sexual orientation, and other factors. To recognize hope speech from YouTube comments, the current study offers an ensemble approach that combines a support vector machine, logistic regression, and random forest classifiers. Extensive testing was carried out to discover the best features for the aforementioned classifiers. In the support vector machine and logistic regression classifiers, char-level TF-IDF features were used, whereas in the random forest classifier, word-level features were used. The proposed ensemble model performed significantly well among English, Spanish, Tamil, Malayalam, and Kannada YouTube comments.",
  "keywords": [
    "support",
    "classifier",
    "classifiers",
    "the support vector machine",
    "current",
    "ensemble",
    "gender race sexual orientation",
    "minorities",
    "the aforementioned classifiers",
    "word",
    "vector",
    "disabilities",
    "the proposed ensemble model",
    "an ensemble model",
    "other minorities"
  ],
  "url": "https://aclanthology.org/2022.ltedi-1.31/",
  "provenance": {
    "collected_at": "2025-06-05 08:44:45",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}