{
  "id": "2022.ecnlp-1.20",
  "title": "Robust Product Classification with Instance-Dependent Noise",
  "authors": [
    "Nguyen, Huy  and\nKhatwani, Devashish"
  ],
  "year": "2022",
  "venue": "Proceedings of the Fifth Workshop on e-Commerce and NLP (ECNLP 5)",
  "abstract": "Noisy labels in large E-commerce product data (i.e., product items are placed into incorrect categories) is a critical issue for product categorization task because they are unavoidable, non-trivial to remove and degrade prediction performance significantly. Training a product title classification model which is robust to noisy labels in the data is very important to make product classification applications more practical. In this paper, we study the impact of instance-dependent noise to performance of product title classification by comparing our data denoising algorithm and different noise-resistance training algorithms which were designed to prevent a classifier model from over-fitting to noise. We develop a simple yet effective Deep Neural Network for product title classification to use as a base classifier. Along with recent methods of stimulating instance-dependent noise, we propose a novel noise stimulation algorithm based on product title similarity. Our experiments cover multiple datasets, various noise methods and different training solutions. Results uncover the limit of classification task when noise rate is not negligible and data distribution is highly skewed.",
  "keywords": [
    "deep",
    "classifier",
    "product title classification",
    "rate",
    "a base classifier",
    "incorrect categories",
    "we",
    "robust product classification",
    "training",
    "classification",
    "classification task",
    "neural",
    "categories",
    "fitting",
    "product classification applications"
  ],
  "url": "https://aclanthology.org/2022.ecnlp-1.20/",
  "provenance": {
    "collected_at": "2025-06-05 08:42:22",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}