{
  "id": "2022.acl-long.38",
  "title": "F}ew{NLU}: Benchmarking State-of-the-Art Methods for Few-Shot Natural Language Understanding",
  "authors": [
    "Zheng, Yanan  and\nZhou, Jing  and\nQian, Yujie  and\nDing, Ming  and\nLiao, Chonghua  and\nJian, Li  and\nSalakhutdinov, Ruslan  and\nTang, Jie  and\nRuder, Sebastian  and\nYang, Zhilin"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "The few-shot natural language understanding (NLU) task has attracted much recent attention. However, prior methods have been evaluated under a disparate set of protocols, which hinders fair comparison and measuring the progress of the field. To address this issue, we introduce an evaluation framework that improves previous evaluation procedures in three key aspects, i.e., test performance, dev-test correlation, and stability. Under this new evaluation framework, we re-evaluate several state-of-the-art few-shot methods for NLU tasks. Our framework reveals new insights: (1) both the absolute performance and relative gap of the methods were not accurately estimated in prior literature; (2) no single method dominates most tasks with consistent performance; (3) improvements of some methods diminish with a larger pretrained model; and (4) gains from different methods are often complementary and the best combined model performs close to a strong fully-supervised baseline. We open-source our toolkit, FewNLU, that implements our evaluation framework along with a number of state-of-the-art methods.",
  "keywords": [
    "our evaluation framework",
    "this new evaluation framework",
    "field",
    "we",
    "shot",
    "natural",
    "the field",
    "much recent attention",
    "an evaluation framework",
    "previous evaluation procedures",
    "language",
    "model",
    "attention",
    "evaluation",
    "few-shot natural language"
  ],
  "url": "https://aclanthology.org/2022.acl-long.38/",
  "provenance": {
    "collected_at": "2025-06-05 08:24:49",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}