{
  "id": "2022.acl-long.218",
  "title": "C}on{T}in{T}in: Continual Learning from Task Instructions",
  "authors": [
    "Yin, Wenpeng  and\nLi, Jia  and\nXiong, Caiming"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "The mainstream machine learning paradigms for NLP often work with two underlying presumptions. First, the target task is predefined and static; a system merely needs to learn to solve it exclusively. Second, the supervision of a task mainly comes from a set of labeled examples. A question arises: how to build a system that can keep learning new tasks from their instructions?This work defines a new learning paradigm ConTinTin (Continual Learning from Task Instructions), in which a system should learn a sequence of new tasks one by one, each task is explained by a piece of textual instruction. The system is required to (i) generate the expected outputs of a new task by learning from its instruction, (ii) transfer the knowledge acquired from upstream tasks to help solve downstream tasks (i.e., forward-transfer), and (iii) retain or even improve the performance on earlier tasks after learning new tasks (i.e., backward-transfer). This new problem is studied on a stream of more than 60 tasks, each equipped with an instruction. Technically, our method InstructionSpeak contains two strategies that make full use of task instructions to improve forward-transfer and backward-transfer: one is to learn from negative outputs, the other is to re-visit instructions of previous tasks. To our knowledge, this is the first time to study ConTinTin in NLP. In addition to the problem formulation and our promising approach, this work also contributes to providing rich analyses for the community to better understand this novel learning problem.",
  "keywords": [
    "t",
    "question",
    "instruction",
    "it",
    "rich",
    "learning",
    "sequence",
    "transfer",
    "a piece",
    "piece",
    "i",
    "two strategies",
    "strategies",
    "earlier tasks",
    "work"
  ],
  "url": "https://aclanthology.org/2022.acl-long.218/",
  "provenance": {
    "collected_at": "2025-06-05 08:27:14",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}