{
  "id": "2022.deelio-1.10",
  "title": "What Makes Good In-Context Examples for {GPT}-3?",
  "authors": [
    "Liu, Jiachang  and\nShen, Dinghan  and\nZhang, Yizhe  and\nDolan, Bill  and\nCarin, Lawrence  and\nChen, Weizhu"
  ],
  "year": "2022",
  "venue": "Proceedings of Deep Learning Inside Out (DeeLIO 2022): The 3rd Workshop on Knowledge Extraction and Integration for Deep Learning Architectures",
  "abstract": "GPT-3 has attracted lots of attention due to its superior performance across a wide range of NLP tasks, especially with its in-context learning abilities. Despite its success, we found that the empirical results of GPT-3 depend heavily on the choice of in-context examples. In this work, we investigate whether there are more effective strategies for judiciously selecting in-context examples (relative to random sampling) that better leverage GPT-3’s in-context learning capabilities. Inspired by the recent success of leveraging a retrieval module to augment neural networks, we propose to retrieve examples that are semantically-similar to a test query sample to formulate its corresponding prompt. Intuitively, the examples selected with such a strategy may serve as more informative inputs to unleash GPT-3’s power of text generation. We evaluate the proposed approach on several natural language understanding and generation benchmarks, where the retrieval-based prompt selection approach consistently outperforms the random selection baseline. Moreover, it is observed that the sentence encoders fine-tuned on task-related datasets yield even more helpful retrieval results. Notably, significant gains are observed on tasks such as table-to-text generation (44.3% on the ToTTo dataset) and open-domain question answering (45.5% on the NQ dataset).",
  "keywords": [
    "more effective strategies",
    "question",
    "we",
    "text generation",
    "neural",
    "natural",
    "it",
    "gpt-3",
    "retrieval",
    "learning",
    "its in-context learning abilities",
    "nlp tasks",
    "a retrieval module",
    "abilities",
    "prompt"
  ],
  "url": "https://aclanthology.org/2022.deelio-1.10/",
  "provenance": {
    "collected_at": "2025-06-05 08:41:09",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}