{
  "id": "2022.acl-long.411",
  "title": "When did you become so smart, oh wise one?! Sarcasm Explanation in Multi-modal Multi-party Dialogues",
  "authors": [
    "Kumar, Shivani  and\nKulkarni, Atharva  and\nAkhtar, Md Shad  and\nChakraborty, Tanmoy"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Indirect speech such as sarcasm achieves a constellation of discourse goals in human communication. While the indirectness of figurative language warrants speakers to achieve certain pragmatic goals, it is challenging for AI agents to comprehend such idiosyncrasies of human communication. Though sarcasm identification has been a well-explored topic in dialogue analysis, for conversational systems to truly grasp a conversation’s innate meaning and generate appropriate responses, simply detecting sarcasm is not enough; it is vital to explain its underlying sarcastic connotation to capture its true essence. In this work, we study the discourse structure of sarcastic conversations and propose a novel task – Sarcasm Explanation in Dialogue (SED). Set in a multimodal and code-mixed setting, the task aims to generate natural language explanations of satirical conversations. To this end, we curate WITS, a new dataset to support our task. We propose MAF (Modality Aware Fusion), a multimodal context-aware attention and global information fusion module to capture multimodality and use it to benchmark WITS. The proposed attention module surpasses the traditional multimodal fusion baselines and reports the best performance on almost all metrics. Lastly, we carry out detailed analysis both quantitatively and qualitatively.",
  "keywords": [
    "code",
    "end",
    "a conversation",
    "conversations",
    "we",
    "dialogue",
    "such idiosyncrasies",
    "a multimodal context-aware attention",
    "fusion",
    "the proposed attention module",
    "natural",
    "it",
    "sarcastic conversations",
    "idiosyncrasies",
    "information"
  ],
  "url": "https://aclanthology.org/2022.acl-long.411/",
  "provenance": {
    "collected_at": "2025-06-05 08:29:50",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}