{
  "id": "2022.ltedi-1.51",
  "title": "Findings of the Shared Task on Detecting Signs of Depression from Social Media",
  "authors": [
    "S, Kayalvizhi  and\nDurairaj, Thenmozhi  and\nChakravarthi, Bharathi Raja  and\nC, Jerin Mahibha"
  ],
  "year": "2022",
  "venue": "Proceedings of the Second Workshop on Language Technology for Equality, Diversity and Inclusion",
  "abstract": "Social media is considered as a platform whereusers express themselves. The rise of social me-dia as one of humanity’s most important publiccommunication platforms presents a potentialprospect for early identification and manage-ment of mental illness. Depression is one suchillness that can lead to a variety of emotionaland physical problems. It is necessary to mea-sure the level of depression from the socialmedia text to treat them and to avoid the nega-tive consequences. Detecting levels of depres-sion is a challenging task since it involves themindset of the people which can change period-ically. The aim of the DepSign-LT-EDI@ACL-2022 shared task is to classify the social me-dia text into three levels of depression namely“Not Depressed”, “Moderately Depressed”, and“Severely Depressed”. This overview presentsa description on the task, the data set, method-ologies used and an analysis on the results ofthe submissions. The models that were submit-ted as a part of the shared task had used a va-riety of technologies from traditional machinelearning algorithms to deep learning models. It could be observed from the result that thetransformer based models have outperformedthe other models. Among the 31 teams whohad submitted their results for the shared task,the best macro F1-score of 0.583 was obtainedusing transformer based model.",
  "keywords": [
    "deep",
    "variety",
    "thetransformer",
    "ologies",
    "sion",
    "overview",
    "tive",
    "thetransformer based models",
    "it",
    "technologies",
    "learning",
    "a variety",
    "analysis",
    "early",
    "text"
  ],
  "url": "https://aclanthology.org/2022.ltedi-1.51/",
  "provenance": {
    "collected_at": "2025-06-05 08:45:02",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}