{
  "id": "2022.acl-demo.2",
  "title": "UKP}-{SQUARE}: An Online Platform for Question Answering Research",
  "authors": [
    "Baumg{\\\"a}rtner, Tim  and\nWang, Kexin  and\nSachdeva, Rachneet  and\nGeigle, Gregor  and\nEichler, Max  and\nPoth, Clifton  and\nSterz, Hannah  and\nPuerto, Haritz  and\nRibeiro, Leonardo F. R.  and\nPfeiffer, Jonas  and\nReimers, Nils  and\n{\\c{S}}ahin, G{\\\"o}zde  and\nGurevych, Iryna"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics: System Demonstrations",
  "abstract": "Recent advances in NLP and information retrieval have given rise to a diverse set of question answering tasks that are of different formats (e.g., extractive, abstractive), require different model architectures (e.g., generative, discriminative), and setups (e.g., with or without retrieval). Despite having a large number of powerful, specialized QA pipelines (which we refer to as Skills) that consider a single domain, model or setup, there exists no framework where users can easily explore and compare such pipelines and can extend them according to their needs. To address this issue, we present UKP-SQuARE, an extensible online QA platform for researchers which allows users to query and analyze a large collection of modern Skills via a user-friendly web interface and integrated behavioural tests. In addition, QA researchers can develop, manage, and share their custom Skills using our microservices that support a wide range of models (Transformers, Adapters, ONNX), datastores and retrieval techniques (e.g., sparse and dense). UKP-SQuARE is available onhttps://square.ukp-lab.de",
  "keywords": [
    "question",
    "we",
    "e g generative discriminative",
    "friendly",
    "qa researchers",
    "retrieval",
    "information",
    "generative",
    "powerful specialized qa pipelines",
    "information retrieval",
    "-",
    "a user-friendly web interface",
    "retrieval techniques",
    "e g",
    "question answering tasks"
  ],
  "url": "https://aclanthology.org/2022.acl-demo.2/",
  "provenance": {
    "collected_at": "2025-06-05 08:34:20",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}