{
  "id": "2022.nlppower-1.3",
  "title": "Benchmarking for Public Health Surveillance tasks on Social Media with a Domain-Specific Pretrained Language Model",
  "authors": [
    "Naseem, Usman  and\nLee, Byoung Chan  and\nKhushi, Matloob  and\nKim, Jinman  and\nDunn, Adam"
  ],
  "year": "2022",
  "venue": "Proceedings of NLP Power! The First Workshop on Efficient Benchmarking in NLP",
  "abstract": "A user-generated text on social media enables health workers to keep track of information, identify possible outbreaks, forecast disease trends, monitor emergency cases, and ascertain disease awareness and response to official health correspondence. This exchange of health information on social media has been regarded as an attempt to enhance public health surveillance (PHS). Despite its potential, the technology is still in its early stages and is not ready for widespread application. Advancements in pretrained language models (PLMs) have facilitated the development of several domain-specific PLMs and a variety of downstream applications. However, there are no PLMs for social media tasks involving PHS. We present and release PHS-BERT, a transformer-based PLM, to identify tasks related to public health surveillance on social media. We compared and benchmarked the performance of PHS-BERT on 25 datasets from different social medial platforms related to 7 different PHS tasks. Compared with existing PLMs that are mainly evaluated on limited tasks, PHS-BERT achieved state-of-the-art performance on all 25 tested datasets, showing that our PLM is robust and generalizable in the common PHS tasks. By making PHS-BERT available, we aim to facilitate the community to reduce the computational cost and introduce new baselines for future works across various PHS-related tasks.",
  "keywords": [
    "variety",
    "a transformer-based plm",
    "generalizable",
    "we",
    "information",
    "pretrained language models plms",
    "a variety",
    "early",
    "bert",
    "text",
    "phs-bert available",
    "transformer",
    "language",
    "model",
    "a user-generated text"
  ],
  "url": "https://aclanthology.org/2022.nlppower-1.3/",
  "provenance": {
    "collected_at": "2025-06-05 08:45:29",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}