{
  "id": "2022.findings-acl.213",
  "title": "\\textit{Generalized but not Robust?} Comparing the Effects of Data Modification Methods on Out-of-Domain Generalization and Adversarial Robustness",
  "authors": [
    "Gokhale, Tejas  and\nMishra, Swaroop  and\nLuo, Man  and\nSachdeva, Bhavdeep  and\nBaral, Chitta"
  ],
  "year": "2022",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2022",
  "abstract": "Data modification, either via additional training datasets, data augmentation, debiasing, and dataset filtering, has been proposed as an effective solution for generalizing to out-of-domain (OOD) inputs, in both natural language processing and computer vision literature. However, the effect of data modification on adversarial robustness remains unclear. In this work, we conduct a comprehensive study of common data modification strategies and evaluate not only their in-domain and OOD performance, but also their adversarial robustness (AR).We also present results on a two-dimensional synthetic dataset to visualize the effect of each method on the training distribution. This work serves as an empirical study towards understanding the relationship between generalizing to unseen domains and defending against adversarial perturbations. Our findings suggest that more data (either via additional datasets or data augmentation) benefits both OOD accuracy and AR.However, data filtering (previously shown to improve OOD accuracy on natural language inference) hurts OOD accuracy on other tasks such as question answering and image classification. We provide insights from our experiments to inform future work in this direction.",
  "keywords": [
    "both ood accuracy",
    "question",
    "we",
    "training",
    "classification",
    "natural",
    "common data modification strategies",
    "image classification",
    "processing",
    "ood accuracy",
    "strategies",
    "generalization",
    "dimensional",
    "accuracy",
    "work"
  ],
  "url": "https://aclanthology.org/2022.findings-acl.213/",
  "provenance": {
    "collected_at": "2025-06-05 08:37:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}