{
  "id": "2022.dialdoc-1.4",
  "title": "Pseudo Ambiguous and Clarifying Questions Based on Sentence Structures Toward Clarifying Question Answering System",
  "authors": [
    "Nakano, Yuya  and\nKawano, Seiya  and\nYoshino, Koichiro  and\nSudoh, Katsuhito  and\nNakamura, Satoshi"
  ],
  "year": "2022",
  "venue": "Proceedings of the Second DialDoc Workshop on Document-grounded Dialogue and Conversational Question Answering",
  "abstract": "Question answering (QA) with disambiguation questions is essential for practical QA systems because user questions often do not contain information enough to find their answers. We call this task clarifying question answering, a task to find answers to ambiguous user questions by disambiguating their intents through interactions. There are two major problems in building a clarifying question answering system: data preparation of possible ambiguous questions and the generation of clarifying questions. In this paper, we tackle these problems by sentence generation methods using sentence structures. Ambiguous questions are generated by eliminating a part of a sentence considering the sentence structure. Clarifying the question generation method based on case frame dictionary and sentence structure is also proposed. Our experimental results verify that our pseudo ambiguous question generation successfully adds ambiguity to questions. Moreover, the proposed clarifying question generation recovers the performance drop by asking the user for missing information.",
  "keywords": [
    "generation",
    "practical qa systems",
    "sentence generation methods",
    "qa",
    "the generation",
    "question",
    "information",
    "drop",
    "we",
    "question answering system question",
    "the question generation method",
    "practical",
    "ambiguous user questions",
    "interactions",
    "major"
  ],
  "url": "https://aclanthology.org/2022.dialdoc-1.4/",
  "provenance": {
    "collected_at": "2025-06-05 08:41:13",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}