{
  "id": "2022.acl-long.328",
  "title": "W}iki{D}iverse: A Multimodal Entity Linking Dataset with Diversified Contextual Topics and Entity Types",
  "authors": [
    "Wang, Xuwu  and\nTian, Junfeng  and\nGui, Min  and\nLi, Zhixu  and\nWang, Rui  and\nYan, Ming  and\nChen, Lihan  and\nXiao, Yanghua"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Multimodal Entity Linking (MEL) which aims at linking mentions with multimodal contexts to the referent entities from a knowledge base (e.g., Wikipedia), is an essential task for many multimodal applications. Although much attention has been paid to MEL, the shortcomings of existing MEL datasets including limited contextual topics and entity types, simplified mention ambiguity, and restricted availability, have caused great obstacles to the research and application of MEL. In this paper, we present WikiDiverse, a high-quality human-annotated MEL dataset with diversified contextual topics and entity types from Wikinews, which uses Wikipedia as the corresponding knowledge base. A well-tailored annotation procedure is adopted to ensure the quality of the dataset. Based on WikiDiverse, a sequence of well-designed MEL models with intra-modality and inter-modality attentions are implemented, which utilize the visual information of images more adequately than existing MEL models do. Extensive experimental analyses are conducted to investigate the contributions of different modalities in terms of MEL, facilitating the future research on this task.",
  "keywords": [
    "much attention",
    "attentions",
    "we",
    "diversified contextual topics",
    "the referent entities",
    "information",
    "sequence",
    "intra-modality and inter-modality attentions",
    "visual",
    "different modalities",
    "diversified",
    "knowledge",
    "entities",
    "human",
    "modalities"
  ],
  "url": "https://aclanthology.org/2022.acl-long.328/",
  "provenance": {
    "collected_at": "2025-06-05 08:28:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}