{
  "id": "2022.acl-short.55",
  "title": "Machine Translation for {L}ivonian: Catering to 20 Speakers",
  "authors": [
    "Rikters, Mat{\\={i}}ss  and\nTomingas, Marili  and\nTuisk, Tuuli  and\nErn{\\v{s}}treits, Valts  and\nFishel, Mark"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers)",
  "abstract": "Livonian is one of the most endangered languages in Europe with just a tiny handful of speakers and virtually no publicly available corpora. In this paper we tackle the task of developing neural machine translation (NMT) between Livonian and English, with a two-fold aim: on one hand, preserving the language and on the other – enabling access to Livonian folklore, lifestories and other textual intangible heritage as well as making it easier to create further parallel corpora. We rely on Livonian’s linguistic similarity to Estonian and Latvian and collect parallel and monolingual data for the four languages for translation experiments. We combine different low-resource NMT techniques like zero-shot translation, cross-lingual transfer and synthetic data creation to reach the highest possible translation quality as well as to find which base languages are empirically more helpful for transfer to Livonian. The resulting NMT systems and the collected monolingual and parallel data, including a manually translated and verified translation benchmark, are publicly released via OPUS and Huggingface repositories.",
  "keywords": [
    "translation experiments",
    "machine translation",
    "we",
    "shot",
    "translation",
    "cross",
    "repositories",
    "neural",
    "it",
    "zero-shot translation cross-lingual transfer",
    "transfer",
    "opus and huggingface repositories",
    "livonian folklore lifestories",
    "easier",
    "language"
  ],
  "url": "https://aclanthology.org/2022.acl-short.55/",
  "provenance": {
    "collected_at": "2025-06-05 08:33:10",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}