{
  "id": "2022.acl-long.246",
  "title": "N}um{GLUE}: A Suite of Fundamental yet Challenging Mathematical Reasoning Tasks",
  "authors": [
    "Mishra, Swaroop  and\nMitra, Arindam  and\nVarshney, Neeraj  and\nSachdeva, Bhavdeep  and\nClark, Peter  and\nBaral, Chitta  and\nKalyan, Ashwin"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Given the ubiquitous nature of numbers in text, reasoning with numbers to perform simple calculations is an important skill of AI systems. While many datasets and models have been developed to this end, state-of-the-art AI systems are brittle; failing to perform the underlying mathematical reasoning when they appear in a slightly different scenario. Drawing inspiration from GLUE that was proposed in the context of natural language understanding, we propose NumGLUE, a multi-task benchmark that evaluates the performance of AI systems on eight different tasks, that at their core require simple arithmetic understanding. We show that this benchmark is far from being solved with neural models including state-of-the-art large-scale language models performing significantly worse than humans (lower by 46.4 %). Further, NumGLUE promotes sharing knowledge across tasks, especially those with limited training data as evidenced by the superior performance (average gain of 3.4 % on each task) when a model is jointly trained on all the tasks as opposed to task-specific modeling. Finally, we hope that NumGLUE will encourage systems that perform robust and general arithmetic reasoning within language, a first step towards being able to perform more complex mathematical reasoning.",
  "keywords": [
    "end",
    "we",
    "training",
    "neural",
    "natural",
    "core",
    "text",
    "general",
    "knowledge",
    "language",
    "model",
    "modeling",
    "multi",
    "scenario",
    "state"
  ],
  "url": "https://aclanthology.org/2022.acl-long.246/",
  "provenance": {
    "collected_at": "2025-06-05 08:27:37",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}