{
  "id": "2022.in2writing-1.14",
  "title": "Read, Revise, Repeat: A System Demonstration for Human-in-the-loop Iterative Text Revision",
  "authors": [
    "Du, Wanyu  and\nKim, Zae Myung  and\nRaheja, Vipul  and\nKumar, Dhruv  and\nKang, Dongyeop"
  ],
  "year": "2022",
  "venue": "Proceedings of the First Workshop on Intelligent and Interactive Writing Assistants (In2Writing 2022)",
  "abstract": "Revision is an essential part of the human writing process. It tends to be strategic, adaptive, and, more importantly, iterative in nature. Despite the success of large language models on text revision tasks, they are limited to non-iterative, one-shot revisions. Examining and evaluating the capability of large language models for making continuous revisions and collaborating with human writers is a critical step towards building effective writing assistants. In this work, we present a human-in-the-loop iterative text revision system, Read, Revise, Repeat (R3), which aims at achieving high quality text revisions with minimal human efforts by reading model-generated revisions and user feedbacks, revising documents, and repeating human-machine interactions. In R3, a text revision model provides text editing suggestions for human writers, who can accept or reject the suggested edits. The accepted edits are then incorporated into the model for the next iteration of document revision. Writers can therefore revise documents iteratively by interacting with the system and simply accepting/rejecting its suggested edits until the text revision model stops making further revisions or reaches a predefined maximum number of revisions. Empirical experiments show that R3 can generate revisions with comparable acceptance rate to human writers at early revision depths, and the human-machine interaction can get higher quality revisions with fewer iterations and edits. The collected human-model interaction dataset and system code are available athttps://github.com/vipulraheja/IteraTeR. Our system demonstration is available athttps://youtu.be/lK08tIpEoaE.",
  "keywords": [
    "code",
    "rate",
    "we",
    "model-generated revisions",
    "shot",
    "it",
    "early",
    "text",
    "work",
    "process",
    "language",
    "model",
    "machine",
    "human",
    "large language models"
  ],
  "url": "https://aclanthology.org/2022.in2writing-1.14/",
  "provenance": {
    "collected_at": "2025-06-05 08:43:04",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}