{
  "id": "2022.acl-long.222",
  "title": "Misinfo Reaction Frames: Reasoning about Readers' Reactions to News Headlines",
  "authors": [
    "Gabriel, Saadia  and\nHallinan, Skyler  and\nSap, Maarten  and\nNguyen, Pemi  and\nRoesner, Franziska  and\nChoi, Eunsol  and\nChoi, Yejin"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Even to a simple and short news headline, readers react in a multitude of ways: cognitively (e.g. inferring the writer’s intent), emotionally (e.g. feeling distrust), and behaviorally (e.g. sharing the news with their friends). Such reactions are instantaneous and yet complex, as they rely on factors that go beyond interpreting factual content of news. We propose Misinfo Reaction Frames (MRF), a pragmatic formalism for modeling how readers might react to a news headline. In contrast to categorical schema, our free-text dimensions provide a more nuanced way of understanding intent beyond being benign or malicious. We also introduce a Misinfo Reaction Frames corpus, a crowdsourced dataset of reactions to over 25k news headlines focusing on global crises: the Covid-19 pandemic, climate change, and cancer. Empirical results confirm that it is indeed possible for neural models to predict the prominent patterns of readers’ reactions to previously unseen news headlines. Additionally, our user study shows that displaying machine-generated MRF implications alongside news headlines to readers can increase their trust in real news while decreasing their trust in misinformation. Our work demonstrates the feasibility and importance of pragmatic inferences on news headlines to help enhance AI-guided misinformation detection and mitigation.",
  "keywords": [
    "we",
    "machine-generated mrf implications",
    "their friends",
    "neural",
    "it",
    "text",
    "friends",
    "work",
    "machine",
    "modeling",
    "implications",
    "ai-guided misinformation detection",
    "change",
    "possible",
    "models"
  ],
  "url": "https://aclanthology.org/2022.acl-long.222/",
  "provenance": {
    "collected_at": "2025-06-05 08:27:17",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}