{
  "id": "2022.acl-short.21",
  "title": "Morphological Reinflection with Multiple Arguments: An Extended Annotation schema and a {G}eorgian Case Study",
  "authors": [
    "Guriel, David  and\nGoldman, Omer  and\nTsarfaty, Reut"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers)",
  "abstract": "In recent years, a flurry of morphological datasets had emerged, most notably UniMorph, aa multi-lingual repository of inflection tables. However, the flat structure of the current morphological annotation makes the treatment of some languages quirky, if not impossible, specifically in cases of polypersonal agreement. In this paper we propose a general solution for such cases and expand the UniMorph annotation schema to naturally address this phenomenon, in which verbs agree with multiple arguments using true affixes. We apply this extended schema to one such language, Georgian, and provide a human-verified, accurate and balanced morphological dataset for Georgian verbs. The dataset has 4 times more tables and 6 times more verb forms compared to the existing UniMorph dataset, covering all possible variants of argument marking, demonstrating the adequacy of our proposed scheme. Experiments on a reinflection task show that generalization is easy when the data is split at the form level, but extremely hard when splitting along lemma lines. Expanding the other languages in UniMorph according to this schema is expected to improve both the coverage, consistency and interpretability of this benchmark.",
  "keywords": [
    "form",
    "we",
    "current",
    "generalization",
    "a general solution",
    "general",
    "language",
    "human",
    "multi",
    "our proposed scheme experiments",
    "the form level",
    "polypersonal",
    "recent",
    "possible",
    "all possible variants"
  ],
  "url": "https://aclanthology.org/2022.acl-short.21/",
  "provenance": {
    "collected_at": "2025-06-05 08:32:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}