{
  "id": "2022.nlp4convai-1.15",
  "title": "R}etro{NLU}: Retrieval Augmented Task-Oriented Semantic Parsing",
  "authors": [
    "Gupta, Vivek  and\nShrivastava, Akshat  and\nSagar, Adithya  and\nAghajanyan, Armen  and\nSavenkov, Denis"
  ],
  "year": "2022",
  "venue": "Proceedings of the 4th Workshop on NLP for Conversational AI",
  "abstract": "While large pre-trained language models accumulate a lot of knowledge in their parameters, it has been demonstrated that augmenting it with non-parametric retrieval-based memory has a number of benefits ranging from improved accuracy to data efficiency for knowledge-focused tasks such as question answering. In this work, we apply retrieval-based modeling ideas to the challenging complex task of multi-domain task-oriented semantic parsing for conversational assistants. Our technique, RetroNLU, extends a sequence-to-sequence model architecture with a retrieval component, which is used to retrieve existing similar samples and present them as an additional context to the model. In particular, we analyze two settings, where we augment an input with (a) retrieved nearest neighbor utterances (utterance-nn), and (b) ground-truth semantic parses of nearest neighbor utterances (semparse-nn). Our technique outperforms the baseline method by 1.5% absolute macro-F1, especially at the low resource setting, matching the baseline model accuracy with only 40% of the complete data. Furthermore, we analyse the quality, model sensitivity, and performance of the nearest neighbor retrieval component’s for semantic parses of varied utterance complexity.",
  "keywords": [
    "multi-domain task-oriented semantic parsing",
    "parsing",
    "varied",
    "improved accuracy",
    "data efficiency",
    "question",
    "non-parametric retrieval-based memory",
    "efficiency",
    "semantic",
    "we",
    "semantic parses",
    "the baseline model accuracy",
    "task-oriented semantic parsing",
    "large pre-trained language models",
    "retrieval-based modeling ideas"
  ],
  "url": "https://aclanthology.org/2022.nlp4convai-1.15/",
  "provenance": {
    "collected_at": "2025-06-05 08:45:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}