{
  "id": "2022.findings-acl.263",
  "title": "A Natural Diet: Towards Improving Naturalness of Machine Translation Output",
  "authors": [
    "Freitag, Markus  and\nVilar, David  and\nGrangier, David  and\nCherry, Colin  and\nFoster, George"
  ],
  "year": "2022",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2022",
  "abstract": "Machine translation (MT) evaluation often focuses on accuracy and fluency, without paying much attention to translation style. This means that, even when considered accurate and fluent, MT output can still sound less natural than high quality human translations or text originally written in the target language. Machine translation output notably exhibits lower lexical diversity, and employs constructs that mirror those in the source sentence. In this work we propose a method for training MT systems to achieve a more natural style, i.e. mirroring the style of text originally written in the target language. Our method tags parallel training data according to the naturalness of the target side by contrasting language models trained on natural and translated data. Tagging data allows us to put greater emphasis on target sentences originally written in the target language. Automatic metrics show that the resulting models achieve lexical richness on par with human translations, mimicking a style much closer to sentences originally written in the target language. Furthermore, we find that their output is preferred by human experts when compared to the baseline translations.",
  "keywords": [
    "much attention",
    "diet",
    "we",
    "training",
    "translation",
    "natural",
    "human translations",
    "mt evaluation",
    "i",
    "text",
    "metrics",
    "par",
    "language models",
    "the baseline translations",
    "accuracy"
  ],
  "url": "https://aclanthology.org/2022.findings-acl.263/",
  "provenance": {
    "collected_at": "2025-06-05 08:38:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}