{
  "id": "2022.computel-1.4",
  "title": "CLD}{\\texttwosuperior} Language Documentation Meets Natural Language Processing for Revitalising Endangered Languages",
  "authors": [
    "Zariquiey, Roberto  and\nOncevay, Arturo  and\nVera, Javier"
  ],
  "year": "2022",
  "venue": "Proceedings of the Fifth Workshop on the Use of Computational Methods in the Study of Endangered Languages",
  "abstract": "Language revitalisation should not be understood as a direct outcome of language documentation, which is mainly focused on the creation of language repositories. Natural language processing (NLP) offers the potential to complement and exploit these repositories through the development of language technologies that may contribute to improving the vitality status of endangered languages. In this paper, we discuss the current state of the interaction between language documentation and computational linguistics, present a diagnosis of how the outputs of recent documentation projects for endangered languages are underutilised for the NLP community, and discuss how the situation could change from both the documentary linguistics and NLP perspectives. All this is introduced as a bridging paradigm dubbed as Computational Language Documentation and Development (CLD²). CLD² calls for (1) the inclusion of NLP-friendly annotated data as a deliverable of future language documentation projects; and (2) the exploitation of language documentation databases by the NLP community to promote the computerization of endangered languages, as one way to contribute to their revitalization.",
  "keywords": [
    "language technologies",
    "the nlp community",
    "we",
    "nlp perspectives",
    "current",
    "natural language processing nlp",
    "friendly",
    "repositories",
    "nlp-friendly annotated data",
    "natural",
    "these repositories",
    "technologies",
    "natural language processing",
    "processing",
    "language repositories"
  ],
  "url": "https://aclanthology.org/2022.computel-1.4/",
  "provenance": {
    "collected_at": "2025-06-05 08:40:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}