{
  "id": "2022.acl-long.270",
  "title": "There Are a Thousand Hamlets in a Thousand People{'}s Eyes: Enhancing Knowledge-grounded Dialogue with Personal Memory",
  "authors": [
    "Fu, Tingchen  and\nZhao, Xueliang  and\nTao, Chongyang  and\nWen, Ji-Rong  and\nYan, Rui"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Knowledge-grounded conversation (KGC) shows great potential in building an engaging and knowledgeable chatbot, and knowledge selection is a key ingredient in it. However, previous methods for knowledge selection only concentrate on the relevance between knowledge and dialogue context, ignoring the fact that age, hobby, education and life experience of an interlocutor have a major effect on his or her personal preference over external knowledge. Without taking the personalization issue into account, it is difficult for existing dialogue systems to select the proper knowledge and generate persona-consistent responses. In this work, we introduce personal memory into knowledge selection in KGC to address the personalization issue. We propose a variational method to model the underlying relationship between one’s personal memory and his or her selection of knowledge, and devise a learning scheme in which the forward mapping from personal memory to knowledge and its inverse mapping is included in a closed loop so that they could teach each other. Experiment results show that our methods outperform existing KGC methods significantly on both automatic evaluation and human evaluation.",
  "keywords": [
    "existing dialogue systems",
    "kgc",
    "we",
    "dialogue",
    "chatbot",
    "human evaluation",
    "it",
    "ingredient",
    "dialogue context",
    "life experience",
    "knowledge-grounded dialogue",
    "age",
    "experience",
    "work",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2022.acl-long.270/",
  "provenance": {
    "collected_at": "2025-06-05 08:27:56",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}