{
  "id": "2022.ltedi-1.29",
  "title": "scube{MSEC}@{LT}-{EDI}-{ACL}2022: Detection of Depression using Transformer Models",
  "authors": [
    "S, Sivamanikandan  and\nV, Santhosh  and\nN, Sanjaykumar  and\nC, Jerin Mahibha  and\nDurairaj, Thenmozhi"
  ],
  "year": "2022",
  "venue": "Proceedings of the Second Workshop on Language Technology for Equality, Diversity and Inclusion",
  "abstract": "Social media platforms play a major role in our day-to-day life and are considered as a virtual friend by many users, who use the social media to share their feelings all day. Many a time, the content which is shared by users on social media replicate their internal life. Nowadays people love to share their daily life incidents like happy or unhappy moments and their feelings in social media and it makes them feel complete and it has become a habit for many users. Social media provides a new chance to identify the feelings of a person through their posts. The aim of the shared task is to develop a model in which the system is capable of analyzing the grammatical markers related to onset and permanent symptoms of depression. We as a team participated in the shared task Detecting Signs of Depression from Social Media Text at LT-EDI 2022- ACL 2022 and we have proposed a model which predicts depression from English social media posts using the data set shared for the task. The prediction is done based on the labels Moderate, Severe and Not Depressed. We have implemented this using different transformer models like DistilBERT, RoBERTa and ALBERT by which we were able to achieve a Macro F1 score of 0.337, 0.457 and 0.387 respectively. Our code is publicly available in the github",
  "keywords": [
    "code",
    "roberta",
    "friend",
    "we",
    "different transformer models",
    "it",
    "albert",
    "a macro f1 score",
    "text",
    "distilbert roberta",
    "transformer",
    "model",
    "distilbert",
    "a virtual friend",
    "time"
  ],
  "url": "https://aclanthology.org/2022.ltedi-1.29/",
  "provenance": {
    "collected_at": "2025-06-05 08:44:44",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}