{
  "id": "2022.dialdoc-1.2",
  "title": "U}ni{DS}: A Unified Dialogue System for Chit-Chat and Task-oriented Dialogues",
  "authors": [
    "Zhao, Xinyan  and\nHe, Bin  and\nWang, Yasheng  and\nLi, Yitong  and\nMi, Fei  and\nLiu, Yajiao  and\nJiang, Xin  and\nLiu, Qun  and\nChen, Huanhuan"
  ],
  "year": "2022",
  "venue": "Proceedings of the Second DialDoc Workshop on Document-grounded Dialogue and Conversational Question Answering",
  "abstract": "With the advances in deep learning, tremendous progress has been made with chit-chat dialogue systems and task-oriented dialogue systems. However, these two systems are often tackled separately in current methods. To achieve more natural interaction with humans, dialogue systems need to be capable of both chatting and accomplishing tasks. To this end, we propose a unified dialogue system (UniDS) with the two aforementioned skills. In particular, we design a unified dialogue data schema, compatible for both chit-chat and task-oriented dialogues. Besides, we propose a two-stage training method to train UniDS based on the unified dialogue data schema. UniDS does not need to adding extra parameters to existing chit-chat dialogue systems. Experimental results demonstrate that the proposed UniDS works comparably well as the state-of-the-art chit-chat dialogue systems and task-oriented dialogue systems. More importantly, UniDS achieves better robustness than pure dialogue systems and satisfactory switch ability between two types of dialogues.",
  "keywords": [
    "deep",
    "end",
    "natural",
    "dialogues",
    "extra",
    "chit-chat dialogue systems",
    "unified",
    "u",
    "a unified dialogue system",
    "we",
    "dialogue",
    "chit-chat and task-oriented dialogues",
    "task-oriented dialogue systems",
    "current",
    "humans dialogue systems"
  ],
  "url": "https://aclanthology.org/2022.dialdoc-1.2/",
  "provenance": {
    "collected_at": "2025-06-05 08:41:12",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}