{
  "id": "2022.findings-acl.184",
  "title": "Square One Bias in {NLP}: Towards a Multi-Dimensional Exploration of the Research Manifold",
  "authors": [
    "Ruder, Sebastian  and\nVuli{\\'c}, Ivan  and\nS{\\o}gaard, Anders"
  ],
  "year": "2022",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2022",
  "abstract": "The prototypical NLP experiment trains a standard architecture on labeled English data and optimizes for accuracy, without accounting for other dimensions such as fairness, interpretability, or computational efficiency. We show through a manual classification of recent NLP research papers that this is indeed the case and refer to it as the square one experimental setup. We observe that NLP research often goes beyond the square one setup, e.g, focusing not only on accuracy, but also on fairness or interpretability, but typically only along a single dimension. Most work targeting multilinguality, for example, considers only accuracy; most work on fairness or interpretability considers only English; and so on. Such one-dimensionality of most research means we are only exploring a fraction of the NLP research search space. We provide historical and recent examples of how the square one bias has led researchers to draw false conclusions or make unwise choices, point to promising yet unexplored directions on the research manifold, and make practical recommendations to enable more multi-dimensional research. We open-source the results of our annotations to enable further analysis.",
  "keywords": [
    "bias",
    "dimensionality",
    "efficiency",
    "we",
    "only accuracy",
    "classification",
    "one bias",
    "it",
    "a manual classification",
    "analysis",
    "recent nlp research papers",
    "dimensional",
    "nlp research",
    "accuracy",
    "the prototypical nlp experiment"
  ],
  "url": "https://aclanthology.org/2022.findings-acl.184/",
  "provenance": {
    "collected_at": "2025-06-05 08:37:20",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}