{
  "id": "2022.nlp4convai-1.11",
  "title": "MTL}-{SLT}: Multi-Task Learning for Spoken Language Tasks",
  "authors": [
    "Huang, Zhiqi  and\nRao, Milind  and\nRaju, Anirudh  and\nZhang, Zhe  and\nBui, Bach  and\nLee, Chul"
  ],
  "year": "2022",
  "venue": "Proceedings of the 4th Workshop on NLP for Conversational AI",
  "abstract": "Language understanding in speech-based systems has attracted extensive interest from both academic and industrial communities in recent years with the growing demand for voice-based applications. Prior works focus on independent research by the automatic speech recognition (ASR) and natural language processing (NLP) communities, or on jointly modeling the speech and NLP problems focusing on a single dataset or single NLP task. To facilitate the development of spoken language research, we introduce MTL-SLT, a multi-task learning framework for spoken language tasks. MTL-SLT takes speech as input, and outputs transcription, intent, named entities, summaries, and answers to text queries, supporting the tasks of spoken language understanding, spoken summarization and spoken question answering respectively. The proposed framework benefits from three key aspects: 1) pre-trained sub-networks of ASR model and language model; 2) multi-task learning objective to exploit shared knowledge from different tasks; 3) end-to-end training of ASR and downstream NLP task based on sequence loss. We obtain state-of-the-art results on spoken language understanding tasks such as SLURP and ATIS. Spoken summarization results are reported on a new dataset: Spoken-Gigaword.",
  "keywords": [
    "end",
    "communities",
    "question",
    "summarization",
    "we",
    "training",
    "natural",
    "queries",
    "loss",
    "learning",
    "sequence",
    "atis spoken summarization results",
    "processing",
    "language model",
    "text"
  ],
  "url": "https://aclanthology.org/2022.nlp4convai-1.11/",
  "provenance": {
    "collected_at": "2025-06-05 08:45:20",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}