{
  "id": "2022.acl-long.336",
  "title": "A Contrastive Framework for Learning Sentence Representations from Pairwise and Triple-wise Perspective in Angular Space",
  "authors": [
    "Zhang, Yuhao  and\nZhu, Hongji  and\nWang, Yongliang  and\nXu, Nan  and\nLi, Xiaobo  and\nZhao, Binqiang"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Learning high-quality sentence representations is a fundamental problem of natural language processing which could benefit a wide range of downstream tasks. Though the BERT-like pre-trained language models have achieved great success, using their sentence representations directly often results in poor performance on the semantic textual similarity task. Recently, several contrastive learning methods have been proposed for learning sentence representations and have shown promising results. However, most of them focus on the constitution of positive and negative representation pairs and pay little attention to the training objective like NT-Xent, which is not sufficient enough to acquire the discriminating power and is unable to model the partial order of semantics between sentences. So in this paper, we propose a new method ArcCSE, with training objectives designed to enhance the pairwise discriminative power and model the entailment relation of triplet sentences. We conduct extensive experiments which demonstrate that our approach outperforms the previous state-of-the-art on diverse sentence related tasks, including STS and SentEval.",
  "keywords": [
    "objectives",
    "little attention",
    "the training objective",
    "semantic",
    "we",
    "training",
    "natural",
    "semantics",
    "sufficient",
    "learning",
    "natural language processing",
    "processing",
    "bert",
    "objective",
    "language"
  ],
  "url": "https://aclanthology.org/2022.acl-long.336/",
  "provenance": {
    "collected_at": "2025-06-05 08:28:50",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}