{
  "id": "2022.lchange-1.13",
  "title": "``Vaderland'', ``Volk'' and ``Natie'': Semantic Change Related to Nationalism in {D}utch Literature Between 1700 and 1880 Captured with Dynamic {B}ernoulli Word Embeddings",
  "authors": [
    "Timmermans, Marije  and\nVanmassenhove, Eva  and\nShterionov, Dimitar"
  ],
  "year": "2022",
  "venue": "Proceedings of the 3rd Workshop on Computational Approaches to Historical Language Change",
  "abstract": "Languages can respond to external events in various ways - the creation of new words or named entities, additional senses might develop for already existing words or the valence of words can change. In this work, we explore the semantic shift of the Dutch words “natie” (“nation”), “volk” (“people”) and “vaderland” (“fatherland”) over a period that is known for the rise of nationalism in Europe: 1700-1880. The semantic change is measured by means of Dynamic Bernoulli Word Embeddings which allow for comparison between word embeddings over different time slices. The word embeddings were generated based on Dutch fiction literature divided over different decades. From the analysis of the absolute drifts, it appears that the word “natie” underwent a relatively small drift. However, the drifts of “vaderland’” and “volk”’ show multiple peaks, culminating around the turn of the nineteenth century. To verify whether this semantic change can indeed be attributed to nationalistic movements, a detailed analysis of the nearest neighbours of the target words is provided. From the analysis, it appears that “natie”, “volk” and “vaderlan”’ became more nationalistically-loaded over time.",
  "keywords": [
    "natie semantic change",
    "natie",
    "semantic",
    "we",
    "means",
    "it",
    "the semantic shift",
    "word",
    "analysis",
    "natie nation volk people",
    "the semantic change",
    "word embeddings",
    "the word embeddings",
    "embeddings",
    "work"
  ],
  "url": "https://aclanthology.org/2022.lchange-1.13/",
  "provenance": {
    "collected_at": "2025-06-05 08:44:07",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}