{
  "id": "2022.acl-long.228",
  "title": "Tailor: Generating and Perturbing Text with Semantic Controls",
  "authors": [
    "Ross, Alexis  and\nWu, Tongshuang  and\nPeng, Hao  and\nPeters, Matthew  and\nGardner, Matt"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Controlled text perturbation is useful for evaluating and improving model generalizability. However, current techniques rely on training a model for every target perturbation, which is expensive and hard to generalize. We present Tailor, a semantically-controlled text generation system. Tailor builds on a pretrained seq2seq model and produces textual outputs conditioned on control codes derived from semantic representations. We craft a set of operations to modify the control codes, which in turn steer generation towards targeted attributes. These operations can be further composed into higher-level ones, allowing for flexible perturbation strategies. We demonstrate the effectiveness of these perturbations in multiple applications. First, we use Tailor to automatically create high-quality contrast sets for four distinct natural language processing (NLP) tasks. These contrast sets contain fewer spurious artifacts and are complementary to manually annotated ones in their lexical diversity. Second, we show that Tailor perturbations can improve model generalization through data augmentation. Perturbing just ∼2% of training data leads to a 5.8-point gain on an NLI challenge set measuring reliance on syntactic heuristics.",
  "keywords": [
    "semantic",
    "model generalization",
    "we",
    "generalizability",
    "current",
    "training",
    "flexible perturbation strategies",
    "natural",
    "model generalizability",
    "semantic representations",
    "seq2seq",
    "processing",
    "text",
    "strategies",
    "generalization"
  ],
  "url": "https://aclanthology.org/2022.acl-long.228/",
  "provenance": {
    "collected_at": "2025-06-05 08:27:22",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}