{
  "id": "2022.in2writing-1.8",
  "title": "The Pure Poet: How Good is the Subjective Credibility and Stylistic Quality of Literary Short Texts Written with an Artificial Intelligence Tool as Compared to Texts Written by Human Authors?",
  "authors": [
    "Gunser, Vivian Emily  and\nGottschling, Steffen  and\nBrucker, Birgit  and\nRichter, Sandra  and\n{\\c{C}}akir, D{\\^i}lan Canan  and\nGerjets, Peter"
  ],
  "year": "2022",
  "venue": "Proceedings of the First Workshop on Intelligent and Interactive Writing Assistants (In2Writing 2022)",
  "abstract": "The application of artificial intelligence (AI) for text generation in creative domains raises questions regarding the credibility of AI-generated content. In two studies, we explored if readers can differentiate between AI-based and human-written texts (generated based on the first line of texts and poems of classic authors) and how the stylistic qualities of these texts are rated. Participants read 9 AI-based continuations and either 9 human-written continuations (Study 1, N=120) or 9 original continuations (Study 2, N=302). Participants’ task was to decide whether a continuation was written with an AI-tool or not, to indicate their confidence in each decision, and to assess the stylistic text quality. Results showed that participants generally had low accuracy for differentiating between text types but were overconfident in their decisions. Regarding the assessment of stylistic quality, AI-continuations were perceived as less well-written, inspiring, fascinating, interesting, and aesthetic than both human-written and original continuations.",
  "keywords": [
    "accuracy",
    "generation",
    "studies",
    "text",
    "human",
    "ai-generated content",
    "two studies",
    "we",
    "qualities",
    "low accuracy",
    "the stylistic qualities",
    "text generation",
    "aesthetic",
    "pure",
    "good"
  ],
  "url": "https://aclanthology.org/2022.in2writing-1.8/",
  "provenance": {
    "collected_at": "2025-06-05 08:42:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}