{
  "id": "2022.acl-long.223",
  "title": "On Continual Model Refinement in Out-of-Distribution Data Streams",
  "authors": [
    "Lin, Bill Yuchen  and\nWang, Sida  and\nLin, Xi  and\nJia, Robin  and\nXiao, Lin  and\nRen, Xiang  and\nYih, Scott"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Real-world natural language processing (NLP) models need to be continually updated to fix the prediction errors in out-of-distribution (OOD) data streams while overcoming catastrophic forgetting. However, existing continual learning (CL) problem setups cannot cover such a realistic and complex scenario. In response to this, we propose a new CL problem formulation dubbed continual model refinement (CMR). Compared to prior CL settings, CMR is more practical and introduces unique challenges (boundary-agnostic and non-stationary distribution shift, diverse mixtures of multiple OOD data clusters, error-centric streams, etc.). We extend several existing CL approaches to the CMR setting and evaluate them extensively. For benchmarking and analysis, we propose a general sampling algorithm to obtain dynamic OOD data streams with controllable non-stationarity, as well as a suite of metrics measuring various aspects of online performance. Our experiments and detailed analysis reveal the promise and challenges of the CMR problem, supporting that studying CMR in dynamic OOD streams can benefit the longevity of deployed NLP models in production.",
  "keywords": [
    "a general sampling algorithm",
    "we",
    "natural",
    "learning",
    "analysis",
    "processing",
    "metrics",
    "deployed nlp models",
    "general",
    "language",
    "nlp",
    "model",
    "detailed",
    "scenario",
    "forgetting"
  ],
  "url": "https://aclanthology.org/2022.acl-long.223/",
  "provenance": {
    "collected_at": "2025-06-05 08:27:18",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}