{
  "id": "2022.findings-acl.172",
  "title": "Revisiting Uncertainty-based Query Strategies for Active Learning with Transformers",
  "authors": [
    "Schr{\\\"o}der, Christopher  and\nNiekler, Andreas  and\nPotthast, Martin"
  ],
  "year": "2022",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2022",
  "abstract": "Active learning is the iterative construction of a classification model through targeted labeling, enabling significant labeling cost savings. As most research on active learning has been carried out before transformer-based language models (“transformers”) became popular, despite its practical importance, comparably few papers have investigated how transformers can be combined with active learning to date. This can be attributed to the fact that using state-of-the-art query strategies for transformers induces a prohibitive runtime overhead, which effectively nullifies, or even outweighs the desired cost savings. For this reason, we revisit uncertainty-based query strategies, which had been largely outperformed before, but are particularly suited in the context of fine-tuning transformers. In an extensive evaluation, we connect transformers to experiments from previous research, assessing their performance on five widely used text classification benchmarks. For active learning with transformers, several other uncertainty-based approaches outperform the well-known prediction entropy query strategy, thereby challenging its status as most popular uncertainty baseline in active learning for text classification.",
  "keywords": [
    "transformer",
    "uncertainty-based query strategies",
    "transformers",
    "tuning",
    "transformer-based language models transformers",
    "language",
    "model",
    "text",
    "nullifies",
    "strategies",
    "a classification model",
    "an extensive evaluation",
    "fine",
    "we",
    "learning"
  ],
  "url": "https://aclanthology.org/2022.findings-acl.172/",
  "provenance": {
    "collected_at": "2025-06-05 08:37:10",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}