{
  "id": "2022.acl-short.32",
  "title": "Complex Evolutional Pattern Learning for Temporal Knowledge Graph Reasoning",
  "authors": [
    "Li, Zixuan  and\nGuan, Saiping  and\nJin, Xiaolong  and\nPeng, Weihua  and\nLyu, Yajuan  and\nZhu, Yong  and\nBai, Long  and\nLi, Wei  and\nGuo, Jiafeng  and\nCheng, Xueqi"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers)",
  "abstract": "A Temporal Knowledge Graph (TKG) is a sequence of KGs corresponding to different timestamps. TKG reasoning aims to predict potential facts in the future given the historical KG sequences. One key of this task is to mine and understand evolutional patterns of facts from these sequences. The evolutional patterns are complex in two aspects, length-diversity and time-variability. Existing models for TKG reasoning focus on modeling fact sequences of a fixed length, which cannot discover complex evolutional patterns that vary in length. Furthermore, these models are all trained offline, which cannot well adapt to the changes of evolutional patterns from then on. Thus, we propose a new model, called Complex Evolutional Network (CEN), which uses a length-aware Convolutional Neural Network (CNN) to handle evolutional patterns of different lengths via an easy-to-difficult curriculum learning strategy. Besides, we propose to learn the model under the online setting so that it can adapt to the changes of evolutional patterns over time. Extensive experiments demonstrate that CEN obtains substantial performance improvement under both the traditional offline and the proposed online settings.",
  "keywords": [
    "the historical kg sequences",
    "we",
    "tkg",
    "graph",
    "convolutional",
    "tkg reasoning focus",
    "a temporal knowledge graph",
    "neural",
    "cnn",
    "it",
    "sequence",
    "kgs",
    "knowledge",
    "model",
    "network"
  ],
  "url": "https://aclanthology.org/2022.acl-short.32/",
  "provenance": {
    "collected_at": "2025-06-05 08:32:51",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}