{
  "id": "2022.wassa-1.34",
  "title": "Polite Task-oriented Dialog Agents: To Generate or to Rewrite?",
  "authors": [
    "Silva, Diogo  and\nSemedo, David  and\nMagalh{\\~a}es, Jo{\\~a}o"
  ],
  "year": "2022",
  "venue": "Proceedings of the 12th Workshop on Computational Approaches to Subjectivity, Sentiment {\\&} Social Media Analysis",
  "abstract": "For task-oriented dialog agents, the tone of voice mediates user-agent interactions, playing a central role in the flow of a conversation. Distinct from domain-agnostic politeness constructs, in specific domains such as online stores, booking platforms, and others, agents need to be capable of adopting highly specific vocabulary, with significant impact on lexical and grammatical aspects of utterances. Then, the challenge is on improving utterances’ politeness while preserving the actual content, an utterly central requirement to achieve the task goal. In this paper, we conduct a novel assessment of politeness strategies for task-oriented dialog agents under a transfer learning scenario. We extend existing generative and rewriting politeness approaches, towards overcoming domain-shifting issues, and enabling the transfer of politeness patterns to a novel domain. Both automatic and human evaluation is conducted on customer-store interactions, over the fashion domain, from which contribute with insightful and experimentally supported lessons regarding the improvement of politeness in task-specific dialog agents.",
  "keywords": [
    "existing generative",
    "we",
    "politeness strategies",
    "polite task-oriented dialog agents",
    "task-oriented dialog agents",
    "learning",
    "transfer",
    "generative",
    "a transfer learning scenario",
    "strategies",
    "human",
    "dialog",
    "conversation",
    "evaluation",
    "scenario"
  ],
  "url": "https://aclanthology.org/2022.wassa-1.34/",
  "provenance": {
    "collected_at": "2025-06-05 08:46:48",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}