{
  "id": "2022.ltedi-1.41",
  "title": "F}ilip{N}@{LT}-{EDI}-{ACL}2022-Detecting signs of Depression from Social Media: Examining the use of summarization methods as data augmentation for text classification",
  "authors": [
    "Nilsson, Filip  and\nKov{\\'a}cs, Gy{\\\"o}rgy"
  ],
  "year": "2022",
  "venue": "Proceedings of the Second Workshop on Language Technology for Equality, Diversity and Inclusion",
  "abstract": "Depression is a common mental disorder that severely affects the quality of life, and can lead to suicide. When diagnosed in time, mild, moderate, and even severe depression can be treated. This is why it is vital to detect signs of depression in time. One possibility for this is the use of text classification models on social media posts. Transformers have achieved state-of-the-art performance on a variety of similar text classification tasks. One drawback, however, is that when the dataset is imbalanced, the performance of these models may be negatively affected. Because of this, in this paper, we examine the effect of balancing a depression detection dataset using data augmentation. In particular, we use abstractive summarization techniques for data augmentation. We examine the effect of this method on the LT-EDI-ACL2022 task. Our results show that when increasing the multiplicity of the minority classes to the right degree, this data augmentation method can in fact improve classification scores on the task.",
  "keywords": [
    "variety",
    "transformers",
    "text classification depression",
    "summarization",
    "we",
    "social media posts transformers",
    "classification",
    "it",
    "text classification models",
    "a variety",
    "classification scores",
    "summarization methods",
    "abstractive summarization techniques",
    "text",
    "similar text classification tasks"
  ],
  "url": "https://aclanthology.org/2022.ltedi-1.41/",
  "provenance": {
    "collected_at": "2025-06-05 08:44:54",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}