{
  "id": "2022.findings-acl.318",
  "title": "GCPG}: A General Framework for Controllable Paraphrase Generation",
  "authors": [
    "Yang, Kexin  and\nLiu, Dayiheng  and\nLei, Wenqiang  and\nYang, Baosong  and\nZhang, Haibo  and\nZhao, Xue  and\nYao, Wenqing  and\nChen, Boxing"
  ],
  "year": "2022",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2022",
  "abstract": "Controllable paraphrase generation (CPG) incorporates various external conditions to obtain desirable paraphrases. However, existing works only highlight a special condition under two indispensable aspects of CPG (i.e., lexically and syntactically CPG) individually, lacking a unified circumstance to explore and analyze their effectiveness. In this paper, we propose a general controllable paraphrase generation framework (GCPG), which represents both lexical and syntactical conditions as text sequences and uniformly processes them in an encoder-decoder paradigm. Under GCPG, we reconstruct commonly adopted lexical condition (i.e., Keywords) and syntactical conditions (i.e., Part-Of-Speech sequence, Constituent Tree, Masked Template and Sentential Exemplar) and study the combination of the two types. In particular, for Sentential Exemplar condition, we propose a novel exemplar construction method — Syntax-Similarity based Exemplar (SSE). SSE retrieves a syntactically similar but lexically different sentence as the exemplar for each target sentence, avoiding exemplar-side words copying problem. Extensive experiments demonstrate that GCPG with SSE achieves state-of-the-art performance on two popular benchmarks. In addition, the combination of lexical and syntactical conditions shows the significant controllable ability of paraphrase generation, and these empirical results could provide novel insight to user-oriented paraphrasing.",
  "keywords": [
    "paraphrase generation",
    "user-oriented paraphrasing",
    "we",
    "syntax",
    "an encoder-decoder paradigm",
    "unified",
    "decoder",
    "sequence",
    "i",
    "text",
    "a general framework",
    "a unified circumstance",
    "general",
    "generation",
    "encoder"
  ],
  "url": "https://aclanthology.org/2022.findings-acl.318/",
  "provenance": {
    "collected_at": "2025-06-05 08:39:07",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}