{
  "id": "2022.acl-long.407",
  "title": "Logic Traps in Evaluating Attribution Scores",
  "authors": [
    "Ju, Yiming  and\nZhang, Yuanzhe  and\nYang, Zhao  and\nJiang, Zhongtao  and\nLiu, Kang  and\nZhao, Jun"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Modern deep learning models are notoriously opaque, which has motivated the development of methods for interpreting how deep models predict. This goal is usually approached with attribution method, which assesses the influence of features on model predictions. As an explanation method, the evaluation criteria of attribution methods is how accurately it reflects the actual reasoning process of the model (faithfulness). Meanwhile, since the reasoning process of deep models is inaccessible, researchers design various evaluation methods to demonstrate their arguments. However, some crucial logic traps in these evaluation methods are ignored in most works, causing inaccurate evaluation and unfair comparison. This paper systematically reviews existing methods for evaluating attribution scores and summarizes the logic traps in these methods. We further conduct experiments to demonstrate the existence of each logic trap. Through both theoretical and experimental analysis, we hope to increase attention on the inaccurate evaluation of attribution scores. Moreover, with this paper, we suggest stopping focusing on improving performance under unreliable evaluation systems and starting efforts on reducing the impact of proposed logic traps.",
  "keywords": [
    "deep",
    "we",
    "inaccurate evaluation",
    "the evaluation criteria",
    "it",
    "unreliable evaluation systems",
    "these evaluation methods",
    "learning",
    "the inaccurate evaluation",
    "analysis",
    "modern deep learning models",
    "process",
    "model",
    "attention",
    "evaluation"
  ],
  "url": "https://aclanthology.org/2022.acl-long.407/",
  "provenance": {
    "collected_at": "2025-06-05 08:29:47",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}