{
  "id": "2022.findings-acl.36",
  "title": "Efficient Argument Structure Extraction with Transfer Learning and Active Learning",
  "authors": [
    "Hua, Xinyu  and\nWang, Lu"
  ],
  "year": "2022",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2022",
  "abstract": "The automation of extracting argument structures faces a pair of challenges on (1) encoding long-term contexts to facilitate comprehensive understanding, and (2) improving data efficiency since constructing high-quality argument structures is time-consuming. In this work, we propose a novel context-aware Transformer-based argument structure prediction model which, on five different domains, significantly outperforms models that rely on features or only encode limited contexts. To tackle the difficulty of data annotation, we examine two complementary methods: (i) transfer learning to leverage existing annotated data to boost model performance in a new target domain, and (ii) active learning to strategically identify a small amount of samples for annotation. We further propose model-independent sample acquisition strategies, which can be generalized to diverse domains. With extensive experiments, we show that our simple-yet-effective acquisition strategies yield competitive results against three strong comparisons. Combined with transfer learning, substantial F1 score boost (5-25) can be further achieved during the early iterations of active learning across domains.",
  "keywords": [
    "extraction",
    "efficient",
    "encode",
    "efficiency",
    "we",
    "model-independent sample acquisition strategies",
    "learning",
    "transfer",
    "transfer learning",
    "our simple-yet-effective acquisition strategies",
    "i",
    "early",
    "2 improving data efficiency",
    "efficient argument",
    "strategies"
  ],
  "url": "https://aclanthology.org/2022.findings-acl.36/",
  "provenance": {
    "collected_at": "2025-06-05 08:35:20",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}