{
  "id": "2022.acl-long.34",
  "title": "Fantastic Questions and Where to Find Them: {F}airytale{QA} {--} An Authentic Dataset for Narrative Comprehension",
  "authors": [
    "Xu, Ying  and\nWang, Dakuo  and\nYu, Mo  and\nRitchie, Daniel  and\nYao, Bingsheng  and\nWu, Tongshuang  and\nZhang, Zheng  and\nLi, Toby Jia-Jun  and\nBradford, Nora  and\nSun, Branda  and\nHoang, Tran Bao  and\nSang, Yisi  and\nHou, Yufang  and\nMa, Xiaojuan  and\nYang, Diyi  and\nPeng, Nanyun  and\nYu, Zhou  and\nWarschauer, Mark"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Question answering (QA) is a fundamental means to facilitate assessment and training of narrative comprehension skills for both machines and young children, yet there is scarcity of high-quality QA datasets carefully designed to serve this purpose. In particular, existing datasets rarely distinguish fine-grained reading skills, such as the understanding of varying narrative elements. Drawing on the reading education research, we introduce FairytaleQA, a dataset focusing on narrative comprehension of kindergarten to eighth-grade students. Generated by educational experts based on an evidence-based theoretical framework, FairytaleQA consists of 10,580 explicit and implicit questions derived from 278 children-friendly stories, covering seven types of narrative elements or relations. Our dataset is valuable in two folds: First, we ran existing QA models on our dataset and confirmed that this annotation helps assess models’ fine-grained learning skills. Second, the dataset supports question generation (QG) task in the education domain. Through benchmarking with QG models, we show that the QG model trained on FairytaleQA is capable of asking high-quality and more diverse questions.",
  "keywords": [
    "question",
    "we",
    "training",
    "means",
    "friendly",
    "fairytaleqa",
    "learning",
    "278 children-friendly stories",
    "stories",
    "generation",
    "high-quality qa datasets",
    "model",
    "f airytale qa",
    "qa",
    "existing qa models"
  ],
  "url": "https://aclanthology.org/2022.acl-long.34/",
  "provenance": {
    "collected_at": "2025-06-05 08:24:45",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}