{
  "id": "2022.findings-acl.167",
  "title": "Dim Wihl Gat Tun: {T}he Case for Linguistic Expertise in {NLP} for Under-Documented Languages",
  "authors": [
    "Forbes, Clarissa  and\nSamir, Farhan  and\nOliver, Bruce  and\nYang, Changbing  and\nCoates, Edith  and\nNicolai, Garrett  and\nSilfverberg, Miikka"
  ],
  "year": "2022",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2022",
  "abstract": "Recent progress in NLP is driven by pretrained models leveraging massive datasets and has predominantly benefited the world’s political and economic superpowers. Technologically underserved languages are left behind because they lack such resources. Hundreds of underserved languages, nevertheless, have available data sources in the form of interlinear glossed text (IGT) from language documentation efforts. IGT remains underutilized in NLP work, perhaps because its annotations are only semi-structured and often language-specific. With this paper, we make the case that IGT data can be leveraged successfully provided that target language expertise is available. We specifically advocate for collaboration with documentary linguists. Our paper provides a roadmap for successful projects utilizing IGT data: (1) It is essential to define which NLP tasks can be accomplished with the given IGT data and how these will benefit the speech community. (2) Great care and target language expertise is required when converting the data into structured formats commonly employed in NLP. (3) Task-specific and user-specific evaluation can help to ascertain that the tools which are created benefit the target language speech community. We illustrate each step through a case study on developing a morphological reinflection system for the Tsimchianic language Gitksan.",
  "keywords": [
    "form",
    "we",
    "it",
    "nlp work",
    "text",
    "task-specific and user-specific evaluation",
    "he",
    "work",
    "language",
    "nlp",
    "tun",
    "evaluation",
    "which nlp tasks",
    "dim",
    "gat"
  ],
  "url": "https://aclanthology.org/2022.findings-acl.167/",
  "provenance": {
    "collected_at": "2025-06-05 08:37:06",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}