{
  "id": "2022.dravidianlangtech-1.27",
  "title": "CUET}-{NLP}@{D}ravidian{L}ang{T}ech-{ACL}2022: Investigating Deep Learning Techniques to Detect Multimodal Troll Memes",
  "authors": [
    "Hasan, Md  and\nJannat, Nusratul  and\nHossain, Eftekhar  and\nSharif, Omar  and\nHoque, Mohammed Moshiul"
  ],
  "year": "2022",
  "venue": "Proceedings of the Second Workshop on Speech and Language Technologies for Dravidian Languages",
  "abstract": "With the substantial rise of internet usage, social media has become a powerful communication medium to convey information, opinions, and feelings on various issues. Recently, memes have become a popular way of sharing information on social media. Usually, memes are visuals with text incorporated into them and quickly disseminate hatred and offensive content. Detecting or classifying memes is challenging due to their region-specific interpretation and multimodal nature. This work presents a meme classification technique in Tamil developed by the CUET NLP team under the shared task (DravidianLangTech-ACL2022). Several computational models have been investigated to perform the classification task. This work also explored visual and textual features using VGG16, ResNet50, VGG19, CNN and CNN+LSTM models. Multimodal features are extracted by combining image (VGG16) and text (CNN, LSTM+CNN) characteristics. Results demonstrate that the textual strategy with CNN+LSTM achieved the highest weightedf1-score (0.52) and recall (0.57). Moreover, the CNN-Text+VGG16 outperformed the other models concerning the multimodal memes detection by achieving the highestf1-score of 0.49, but the LSTM+CNN model allowed the team to achieve4thplace in the shared task.",
  "keywords": [
    "deep",
    "the lstm cnn model",
    "deep learning techniques",
    "- nlp",
    "the cnn-text vgg16",
    "highestf1",
    "the cuet nlp team",
    "lstm",
    "weightedf1",
    "cnn lstm",
    "classification",
    "cnn",
    "information",
    "learning",
    "visual"
  ],
  "url": "https://aclanthology.org/2022.dravidianlangtech-1.27/",
  "provenance": {
    "collected_at": "2025-06-05 08:41:50",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}