{
  "id": "2022.slpat-1.10",
  "title": "Challenges in assistive technology development for an endangered language: an {I}rish ({G}aelic) perspective",
  "authors": [
    "Ni Chasaide, Ailbhe  and\nBarnes, Emily  and\nN{\\'i} Chiar{\\'a}in, Neasa  and\nMcGuirk, Ronan  and\nMorrin, Ois{\\'i}n  and\nNic Corcr{\\'a}in, Muireann  and\nCummins, Julia"
  ],
  "year": "2022",
  "venue": "Ninth Workshop on Speech and Language Processing for Assistive Technologies (SLPAT-2022)",
  "abstract": "This paper describes three areas of assistive technology development which deploy the resources and speech technology for Irish (Gaelic), newly emerging from the ABAIR initiative. These include (i) a screenreading facility for visually impaired people, (ii) an application to help develop phonological awareness and early literacy for dyslexic people (iii) a speech-enabled AAC system for non-speaking people. Each of these is at a different stage of development and poses unique challenges: these are dis-cussed along with the approaches adopted to address them. Three guiding principles underlie development. Firstly, the sociolinguistic context and the needs of the community are essential considerations in setting priorities. Secondly, development needs to be language sensitive. The need for skilled researchers with a deep knowledge of Irish structure is illustrated in the case of (ii) and (iii), where aspects of Irish linguistic structure (phonological, morphological and grammatical) and the striking differences from English pose challenges for systems aimed at bilingual Irish-English users. Thirdly, and most importantly, the users and their support networks are central – not as passive recipients of ready-made technologies, but as active partners at every stage of development, from design to implementation, evaluation and dissemination.",
  "keywords": [
    "deep",
    "support",
    "recipients",
    "implementation evaluation",
    "priorities",
    "technologies",
    "partners",
    "i",
    "early",
    "active partners",
    "knowledge",
    "language",
    "passive recipients",
    "evaluation",
    "ready-made technologies"
  ],
  "url": "https://aclanthology.org/2022.slpat-1.10/",
  "provenance": {
    "collected_at": "2025-06-05 08:46:07",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}