{
  "id": "2022.dialdoc-1.21",
  "title": "T}ask2{D}ial: A Novel Task and Dataset for Commonsense-enhanced Task-based Dialogue Grounded in Documents",
  "authors": [
    "Strathearn, Carl  and\nGkatzia, Dimitra"
  ],
  "year": "2022",
  "venue": "Proceedings of the Second DialDoc Workshop on Document-grounded Dialogue and Conversational Question Answering",
  "abstract": "This paper proposes a novel task on commonsense-enhanced task-based dialogue grounded in documents and describes the Task2Dial dataset, a novel dataset of document-grounded task-based dialogues, where an Information Giver (IG) provides instructions (by consulting a document) to an Information Follower (IF), so that the latter can successfully complete the task. In this unique setting, the IF can ask clarification questions which may not be grounded in the underlying document and require commonsense knowledge to be answered. The Task2Dial dataset poses new challenges: (1) its human reference texts show more lexical richness and variation than other document-grounded dialogue datasets; (2) generating from this set requires paraphrasing as instructional responses might have been modified from the underlying document; (3) requires commonsense knowledge, since questions might not necessarily be grounded in the document; (4) generating requires planning based on context, as task steps need to be provided in order. The Task2Dial dataset contains dialogues with an average 18.15 number of turns and 19.79 tokens per turn, as compared to 12.94 and 12 respectively in existing datasets. As such, learning from this dataset promises more natural, varied and less template-like system utterances.",
  "keywords": [
    "varied",
    "dialogue",
    "2 generating",
    "other document-grounded dialogue datasets",
    "natural",
    "commonsense-enhanced task-based dialogue",
    "information",
    "learning",
    "the document 4 generating",
    "reference",
    "knowledge",
    "generating",
    "dialogues",
    "human",
    "document-grounded task-based dialogues"
  ],
  "url": "https://aclanthology.org/2022.dialdoc-1.21/",
  "provenance": {
    "collected_at": "2025-06-05 08:41:27",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}