{
  "id": "2022.slpat-1.9",
  "title": "C}ue{B}ot: Cue-Controlled Response Generation for Assistive Interaction Usages",
  "authors": [
    "H. Kumar, Shachi  and\nSu, Hsuan  and\nManuvinakurike, Ramesh  and\nPinaroc, Max  and\nPrasad, Sai  and\nSahay, Saurav  and\nNachman, Lama"
  ],
  "year": "2022",
  "venue": "Ninth Workshop on Speech and Language Processing for Assistive Technologies (SLPAT-2022)",
  "abstract": "Conversational assistants are ubiquitous among the general population, however, these systems have not had an impact on people with disabilities, or speech and language disorders, for whom basic day-to-day communication and social interaction is a huge struggle. Language model technology can play a huge role in empowering these users and help them interact with others with less effort via interaction support. To enable this population, we build a system that can represent them in a social conversation and generate responses that can be controlled by the users using cues/keywords. We build models that can speed up this communication by suggesting relevant cues in the dialog response context. We also introduce a keyword-loss to lexically constrain the model response output. We present automatic and human evaluation of our cue/keyword predictor and the controllable dialog system to show that our models perform significantly better than models without control. Our evaluation and user study shows that keyword-control on end-to-end response generation models is powerful and can enable and empower users with degenerative disorders to carry out their day-to-day communication.",
  "keywords": [
    "the general population",
    "end",
    "support",
    "we",
    "degenerative",
    "automatic and human evaluation",
    "a social conversation",
    "degenerative disorders",
    "loss",
    "conversational assistants",
    "disabilities",
    "general",
    "generation",
    "language",
    "model"
  ],
  "url": "https://aclanthology.org/2022.slpat-1.9/",
  "provenance": {
    "collected_at": "2025-06-05 08:46:06",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}