{
  "id": "2022.acl-long.42",
  "title": "Neural Label Search for Zero-Shot Multi-Lingual Extractive Summarization",
  "authors": [
    "Jia, Ruipeng  and\nZhang, Xingxing  and\nCao, Yanan  and\nLin, Zheng  and\nWang, Shi  and\nWei, Furu"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "In zero-shot multilingual extractive text summarization, a model is typically trained on English summarization dataset and then applied on summarization datasets of other languages. Given English gold summaries and documents, sentence-level labels for extractive summarization are usually generated using heuristics. However, these monolingual labels created on English datasets may not be optimal on datasets of other languages, for that there is the syntactic or semantic discrepancy between different languages. In this way, it is possible to translate the English dataset to other languages and obtain different sets of labels again using heuristics. To fully leverage the information of these different sets of labels, we propose NLSSum (Neural Label Search for Summarization), which jointly learns hierarchical weights for these different sets of labels together with our summarization model. We conduct multilingual zero-shot summarization experiments on MLSUM and WikiLingua datasets, and we achieve state-of-the-art results using both human and automatic evaluations across these two datasets.",
  "keywords": [
    "our summarization model",
    "hierarchical",
    "human",
    "english summarization dataset",
    "summaries",
    "neural",
    "multilingual zero-shot summarization experiments",
    "model",
    "it",
    "text",
    "zero-shot multi-lingual extractive summarization",
    "extractive summarization",
    "evaluations",
    "summarization datasets",
    "information"
  ],
  "url": "https://aclanthology.org/2022.acl-long.42/",
  "provenance": {
    "collected_at": "2025-06-05 08:24:52",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}