{
  "id": "2022.acl-demo.16",
  "title": "C}og{KGE}: A Knowledge Graph Embedding Toolkit and Benchmark for Representing Multi-source and Heterogeneous Knowledge",
  "authors": [
    "Jin, Zhuoran  and\nMen, Tianyi  and\nYuan, Hongbang  and\nHe, Zhitao  and\nSui, Dianbo  and\nWang, Chenhao  and\nXue, Zhipeng  and\nChen, Yubo  and\nZhao, Jun"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics: System Demonstrations",
  "abstract": "In this paper, we propose CogKGE, a knowledge graph embedding (KGE) toolkit, which aims to represent multi-source and heterogeneous knowledge. For multi-source knowledge, unlike existing methods that mainly focus on entity-centric knowledge, CogKGE also supports the representations of event-centric, commonsense and linguistic knowledge. For heterogeneous knowledge, besides structured triple facts, CogKGE leverages additional unstructured information, such as text descriptions, node types and temporal information, to enhance the meaning of embeddings. Designing CogKGE aims to provide a unified programming framework for KGE tasks and a series of knowledge representations for downstream tasks. As a research framework, CogKGE consists of five parts, including core, data, model, knowledge and adapter module. As a knowledge discovery toolkit, CogKGE provides pre-trained embedders to discover new facts, cluster entities and check facts. Furthermore, we construct two benchmark datasets for further research on multi-source heterogeneous KGE tasks: EventKG240K and CogNet360K. We also release an online system to discover knowledge visually. Source code, datasets and pre-trained embeddings are publicly available at GitHub, with a short instruction video.",
  "keywords": [
    "code",
    "series",
    "we",
    "graph",
    "instruction",
    "eventkg240k",
    "cluster",
    "kge",
    "unified",
    "information",
    "kge tasks",
    "core",
    "a unified programming framework",
    "multi-source heterogeneous kge tasks",
    "text"
  ],
  "url": "https://aclanthology.org/2022.acl-demo.16/",
  "provenance": {
    "collected_at": "2025-06-05 08:34:31",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}