{
  "id": "2022.nlp4convai-1.16",
  "title": "Stylistic Response Generation by Controlling Personality Traits and Intent",
  "authors": [
    "Saha, Sougata  and\nDas, Souvik  and\nSrihari, Rohini"
  ],
  "year": "2022",
  "venue": "Proceedings of the 4th Workshop on NLP for Conversational AI",
  "abstract": "Personality traits influence human actions and thoughts, which is manifested in day to day conversations. Although glimpses of personality traits are observable in existing open domain conversation corpora, leveraging generic language modelling for response generation overlooks the interlocutor idiosyncrasies, resulting in non-customizable personality agnostic responses. With the motivation of enabling stylistically configurable response generators, in this paper we experiment with end-to-end mechanisms to ground neural response generators based on both (i) interlocutor Big-5 personality traits, and (ii) discourse intent as stylistic control codes. Since most of the existing large scale open domain chat corpora do not include Big-5 personality traits and discourse intent, we employ automatic annotation schemes to enrich the corpora with noisy estimates of personality and intent annotations, and further assess the impact of using such features as control codes for response generation using automatic evaluation metrics, ablation studies and human judgement. Our experiments illustrate the effectiveness of this strategy resulting in improvements to existing benchmarks. Additionally, we yield two silver standard annotated corpora with intents and personality traits annotated, which can be of use to the research community.",
  "keywords": [
    "end",
    "conversations",
    "neural response generators",
    "we",
    "generators",
    "stylistic response generation",
    "neural",
    "idiosyncrasies",
    "the interlocutor idiosyncrasies",
    "i",
    "metrics",
    "generic",
    "response generation",
    "chat",
    "generic language modelling"
  ],
  "url": "https://aclanthology.org/2022.nlp4convai-1.16/",
  "provenance": {
    "collected_at": "2025-06-05 08:45:24",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}