{
  "id": "2022.dravidianlangtech-1.10",
  "title": "MUCIC}@{T}amil{NLP}-{ACL}2022: Abusive Comment Detection in {T}amil Language using 1{D} Conv-{LSTM",
  "authors": [
    "Balouchzahi, Fazlourrahman  and\nGowda, Anusha  and\nShashirekha, Hosahalli  and\nSidorov, Grigori"
  ],
  "year": "2022",
  "venue": "Proceedings of the Second Workshop on Speech and Language Technologies for Dravidian Languages",
  "abstract": "Abusive language content such as hate speech, profanity, and cyberbullying etc., which is common in online platforms is creating lot of problems to the users as well as policy makers. Hence, detection of such abusive language in user-generated online content has become increasingly important over the past few years. Online platforms strive hard to moderate the abusive content to reduce societal harm, comply with laws, and create a more inclusive environment for their users. In spite of various methods to automatically detect abusive languages in online platforms, the problem still persists. To address the automatic detection of abusive languages in online platforms, this paper describes the models submitted by our team - MUCIC to the shared task on “Abusive Comment Detection in Tamil-ACL 2022”. This shared task addresses the abusive comment detection in native Tamil script texts and code-mixed Tamil texts. To address this challenge, two models: i) n-gram-Multilayer Perceptron (n-gram-MLP) model utilizing MLP classifier fed with char-n gram features and ii) 1D Convolutional Long Short-Term Memory (1D Conv-LSTM) model, were submitted. The n-gram-MLP model fared well among these two models with weighted F1-scores of 0.560 and 0.430 for code-mixed Tamil and native Tamil script texts, respectively. This work may be reproduced using the code available inhttps://github.com/anushamdgowda/abusive-detection.",
  "keywords": [
    "code",
    "classifier",
    "lstm",
    "convolutional",
    "nlp - acl",
    "user-generated online content",
    "societal harm",
    "work",
    "language",
    "nlp",
    "model",
    "societal",
    "weighted f1-scores",
    "mlp classifier",
    "conv"
  ],
  "url": "https://aclanthology.org/2022.dravidianlangtech-1.10/",
  "provenance": {
    "collected_at": "2025-06-05 08:41:37",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}