{
  "id": "2022.findings-acl.1",
  "title": "``Is Whole Word Masking Always Better for {C}hinese {BERT}?'': Probing on {C}hinese Grammatical Error Correction",
  "authors": [
    "Dai, Yong  and\nLi, Linyang  and\nZhou, Cong  and\nFeng, Zhangyin  and\nZhao, Enbo  and\nQiu, Xipeng  and\nLi, Piji  and\nTang, Duyu"
  ],
  "year": "2022",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2022",
  "abstract": "Whole word masking (WWM), which masks all subwords corresponding to a word at once, makes a better English BERT model. For the Chinese language, however, there is no subword because each token is an atomic character. The meaning of a word in Chinese is different in that a word is a compositional unit consisting of multiple characters. Such difference motivates us to investigate whether WWM leads to better context understanding ability for Chinese BERT. To achieve this, we introduce two probing tasks related to grammatical error correction and ask pretrained models to revise or insert tokens in a masked language modeling manner. We construct a dataset including labels for 19,075 tokens in 10,448 sentences. We train three Chinese BERT models with standard character-level masking (CLM), WWM, and a combination of CLM and WWM, respectively. Our major findings are as follows: First, when one character needs to be inserted or replaced, the model trained with CLM performs the best. Second, when more than one character needs to be handled, WWM is the key to better performance. Finally, when being fine-tuned on sentence-level downstream tasks, models trained with different masking strategies perform comparably.",
  "keywords": [
    "chinese bert",
    "three chinese bert models",
    "we",
    "different masking strategies",
    "word",
    "manner",
    "bert",
    "strategies",
    "c hinese bert",
    "language",
    "model",
    "modeling",
    "us",
    "major",
    "characters"
  ],
  "url": "https://aclanthology.org/2022.findings-acl.1/",
  "provenance": {
    "collected_at": "2025-06-05 08:34:51",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}