{
  "id": "2022.findings-acl.47",
  "title": "Fast Nearest Neighbor Machine Translation",
  "authors": [
    "Meng, Yuxian  and\nLi, Xiaoya  and\nZheng, Xiayu  and\nWu, Fei  and\nSun, Xiaofei  and\nZhang, Tianwei  and\nLi, Jiwei"
  ],
  "year": "2022",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2022",
  "abstract": "Though nearest neighbor Machine Translation (kNN-MT) (CITATION) has proved to introduce significant performance boosts over standard neural MT systems, it is prohibitively slow since it uses the entire reference corpus as the datastore for the nearest neighbor search. This means each step for each beam in the beam search has to search over the entire reference corpus.kNN-MT is thus two-orders slower than vanilla MT models, making it hard to be applied to real-world applications, especially online services. In this work, we propose FastkNN-MT to address this issue. FastkNN-MT constructs a significantly smaller datastore for the nearest neighbor search: for each word in a source sentence, FastkNN-MT first selects its nearest token-level neighbors, which is limited to tokens that are the same as the query token. Then at each decoding step, in contrast to using the entire corpus as the datastore, the search space is limited to target tokens corresponding to the previously selected reference source tokens. This strategy avoids search through the whole datastore for nearest neighbors and drastically improves decoding efficiency. Without loss of performance, FastkNN-MT is two-orders faster thankNN-MT, and is only two times slower than the standard NMT model. FastkNN-MT enables the practical use ofkNN-MT systems in real-world MT applications. The code is available athttps://github.com/ShannonAI/fast-knn-nmt.",
  "keywords": [
    "code",
    "efficiency",
    "we",
    "translation",
    "neural",
    "it",
    "token",
    "loss",
    "word",
    "fast",
    "work",
    "reference",
    "model",
    "machine",
    "the nearest neighbor search"
  ],
  "url": "https://aclanthology.org/2022.findings-acl.47/",
  "provenance": {
    "collected_at": "2025-06-05 08:35:28",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}