{
  "id": "2022.acl-demo.18",
  "title": "D}ata{L}ab: A Platform for Data Analysis and Intervention",
  "authors": [
    "Xiao, Yang  and\nFu, Jinlan  and\nYuan, Weizhe  and\nViswanathan, Vijay  and\nLiu, Zhoumianze  and\nLiu, Yixin  and\nNeubig, Graham  and\nLiu, Pengfei"
  ],
  "year": "2022",
  "venue": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics: System Demonstrations",
  "abstract": "Despite data’s crucial role in machine learning, most existing tools and research tend to focus on systems on top of existing data rather than how to interpret and manipulate data. In this paper, we propose DataLab, a unified data-oriented platform that not only allows users to interactively analyze the characteristics of data but also provides a standardized interface so that many data processing operations can be provided within a unified interface. Additionally, in view of the ongoing surge in the proliferation of datasets, DataLab has features for dataset recommendation and global vision analysis that help researchers form a better view of the data ecosystem. So far, DataLab covers 1,300 datasets and 3,583 of its transformed version, where 313 datasets support different types of analysis (e.g., with respect to gender bias) with the help of 119M samples annotated by 318 feature functions. DataLab is under active development and will be supported going forward. We have released a web platform, web API, Python SDK, and PyPI published package, which hopefully, can meet the diverse needs of researchers.",
  "keywords": [
    "top",
    "bias",
    "a better view",
    "we",
    "a unified data-oriented platform",
    "a unified interface",
    "unified",
    "analysis",
    "machine",
    "gender bias",
    "view",
    "ecosystem",
    "gender",
    "characteristics",
    "functions"
  ],
  "url": "https://aclanthology.org/2022.acl-demo.18/",
  "provenance": {
    "collected_at": "2025-06-05 08:34:33",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}