{
  "id": "2022.dravidianlangtech-1.30",
  "title": "CUET}-{NLP}@{D}ravidian{L}ang{T}ech-{ACL}2022: Exploiting Textual Features to Classify Sentiment of Multimodal Movie Reviews",
  "authors": [
    "Mustakim, Nasehatul  and\nJannat, Nusratul  and\nHasan, Md  and\nHossain, Eftekhar  and\nSharif, Omar  and\nHoque, Mohammed Moshiul"
  ],
  "year": "2022",
  "venue": "Proceedings of the Second Workshop on Speech and Language Technologies for Dravidian Languages",
  "abstract": "With the proliferation of internet usage, a massive growth of consumer-generated content on social media has been witnessed in recent years that provide people’s opinions on diverse issues. Through social media, users can convey their emotions and thoughts in distinctive forms such as text, image, audio, video, and emoji, which leads to the advancement of the multimodality of the content users on social networking sites. This paper presents a technique for classifying multimodal sentiment using the text modality into five categories: highly positive, positive, neutral, negative, and highly negative categories. A shared task was organized to develop models that can identify the sentiments expressed by the videos of movie reviewers in both Malayalam and Tamil languages. This work applied several machine learning techniques (LR, DT, MNB, SVM) and deep learning (BiLSTM, CNN+BiLSTM) to accomplish the task. Results demonstrate that the proposed model with the decision tree (DT) outperformed the other methods and won the competition by acquiring the highest macrof1-score of 0.24.",
  "keywords": [
    "deep",
    "multimodal movie reviews",
    "five categories",
    "the highest macrof1-score",
    "- nlp",
    "svm",
    "consumer-generated content",
    "cnn",
    "bilstm",
    "learning",
    "ang",
    "reviews",
    "categories",
    "text",
    "macrof1"
  ],
  "url": "https://aclanthology.org/2022.dravidianlangtech-1.30/",
  "provenance": {
    "collected_at": "2025-06-05 08:41:53",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}