{
  "id": "2022.computel-1.6",
  "title": "Automated speech tools for helping communities process restricted-access corpora for language revival efforts",
  "authors": [
    "San, Nay  and\nBartelds, Martijn  and\nOgunremi, Tolulope  and\nMount, Alison  and\nThompson, Ruben  and\nHiggins, Michael  and\nBarker, Roy  and\nSimpson, Jane  and\nJurafsky, Dan"
  ],
  "year": "2022",
  "venue": "Proceedings of the Fifth Workshop on the Use of Computational Methods in the Study of Endangered Languages",
  "abstract": "Many archival recordings of speech from endangered languages remain unannotated and inaccessible to community members and language learning programs. One bottleneck is the time-intensive nature of annotation. An even narrower bottleneck occurs for recordings with access constraints, such as language that must be vetted or filtered by authorised community members before annotation can begin. We propose a privacy-preserving workflow to widen both bottlenecks for recordings where speech in the endangered language is intermixed with a more widely-used language such as English for meta-linguistic commentary and questions (e.g.What is the word for ‘tree’?). We integrate voice activity detection (VAD), spoken language identification (SLI), and automatic speech recognition (ASR) to transcribe the metalinguistic content, which an authorised person can quickly scan to triage recordings that can be annotated by people with lower levels of access. We report work-in-progress processing 136 hours archival audio containing a mix of English and Muruwari. Our collaborative work with the Muruwari custodian of the archival materials show that this workflow reduces metalanguage transcription time by 20% even given only minimal amounts of annotated training data, 10 utterances per language for SLI and for ASR at most 39 minutes, and possibly as little as 39 seconds.",
  "keywords": [
    "communities",
    "we",
    "training",
    "e",
    "word",
    "learning",
    "work",
    "process",
    "language",
    "time",
    "members",
    "sli",
    "a more widely-used language",
    "privacy",
    "annotated"
  ],
  "url": "https://aclanthology.org/2022.computel-1.6/",
  "provenance": {
    "collected_at": "2025-06-05 08:40:28",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}