{
  "id": "2022.ltedi-1.22",
  "title": "SSN}{\\_}{ARMM}@ {LT}-{EDI} -{ACL}2022: Hope Speech Detection for Equality, Diversity, and Inclusion Using {ALBERT} model",
  "authors": [
    "Vijayakumar, Praveenkumar  and\nS, Prathyush  and\nP, Aravind  and\nS, Angel  and\nSivanaiah, Rajalakshmi  and\nRajendram, Sakaya Milton  and\nT T, Mirnalinee"
  ],
  "year": "2022",
  "venue": "Proceedings of the Second Workshop on Language Technology for Equality, Diversity and Inclusion",
  "abstract": "In recent years social media has become one of the major forums for expressing human views and emotions. With the help of smartphones and high-speed internet, anyone can express their views on Social media. However, this can also lead to the spread of hatred and violence in society. Therefore it is necessary to build a method to find and support helpful social media content. In this paper, we studied Natural Language Processing approach for detecting Hope speech in a given sentence. The task was to classify the sentences into ‘Hope speech’ and ‘Non-hope speech’. The dataset was provided by LT-EDI organizers with text from Youtube comments. Based on the task description, we developed a system using the pre-trained language model BERT to complete this task. Our model achieved 1st rank in the Kannada language with a weighted average F1 score of 0.750, 2nd rank in the Malayalam language with a weighted average F1 score of 0.740, 3rd rank in the Tamil language with a weighted average F1 score of 0.390 and 6th rank in the English language with a weighted average F1 score of 0.880.",
  "keywords": [
    "we",
    "natural",
    "their views",
    "it",
    "albert",
    "natural language processing approach",
    "views",
    "processing",
    "bert",
    "text",
    "human views",
    "society",
    "language",
    "model",
    "human"
  ],
  "url": "https://aclanthology.org/2022.ltedi-1.22/",
  "provenance": {
    "collected_at": "2025-06-05 08:44:38",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}