{
  "id": "2022.computel-1.12",
  "title": "Developing a Part-Of-Speech tagger for te reo {M}{\\={a}}ori",
  "authors": [
    "Finn, Aoife  and\nJones, Peter-Lucas  and\nMahelona, Keoni  and\nDuncan, Suzanne  and\nLeoni, Gianna"
  ],
  "year": "2022",
  "venue": "Proceedings of the Fifth Workshop on the Use of Computational Methods in the Study of Endangered Languages",
  "abstract": "This paper discusses the development of a Part-of-Speech tagger for te reo Māori which is the Indigenous language of Aotearoa, also known as New Zealand, see Morrison. Henceforth, Part-of-Speech will be referred to as POS throughout this paper and te reo Māori will be referred to as Māori, while Universal Dependencies will be referred to as UD. Prior to the development of this tagger, there was no POS tagger for Māori from Aotearoa. POS taggers tag words according to their syntactic or grammatical category. However, many traditional syntactic categories, and by consequence POS labels, do not “work for” Māori. By this we mean that, for some of the traditional categories, The definition of, or guidelines for, an existing category is not suitable for Māori. They do not have an existing category for certain word classes of Māori. They do not reflect a Māori worldview of the Māori language. We wanted a tagset that is usable with industry-wide tools, but we also needed a tagset that would meet the needs of Māori. Therefore, we based our tagset and guidelines on the UD tagset and tagging conventions, however the categorization of words has been significantly altered to be appropriate for Māori. This is because at the time of development of our POS tagger, the UD conventions had still not been used to tag a Polyneisan language such as Māori, nor did it provide any guidelines about how to tag them. To that end, we worked with highly-proficient, specially-selected Māori speakers and linguists who are specialists in Māori. This has ensured that our POS labels and guidelines conventions faithfully reflect a Māori speaker’s conceptualization of their language.",
  "keywords": [
    "end",
    "a māori worldview",
    "we",
    "ud",
    "it",
    "dependencies",
    "tag",
    "word",
    "categories",
    "pos",
    "the traditional categories",
    "highly-proficient specially-selected māori speakers",
    "language",
    "universal dependencies",
    "proficient"
  ],
  "url": "https://aclanthology.org/2022.computel-1.12/",
  "provenance": {
    "collected_at": "2025-06-05 08:40:33",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}