{
  "id": "2022.dravidianlangtech-1.39",
  "title": "Findings of the Shared Task on Multimodal Sentiment Analysis and Troll Meme Classification in {D}ravidian Languages",
  "authors": [
    "B, Premjith  and\nChakravarthi, Bharathi Raja  and\nSubramanian, Malliga  and\nB, Bharathi  and\nKp, Soman  and\nV, Dhanalakshmi  and\nK, Sreelakshmi  and\nPandian, Arunaggiri  and\nKumaresan, Prasanna"
  ],
  "year": "2022",
  "venue": "Proceedings of the Second Workshop on Speech and Language Technologies for Dravidian Languages",
  "abstract": "This paper presents the findings of the shared task on Multimodal Sentiment Analysis and Troll meme classification in Dravidian languages held at ACL 2022. Multimodal sentiment analysis deals with the identification of sentiment from video. In addition to video data, the task requires the analysis of corresponding text and audio features for the classification of movie reviews into five classes. We created a dataset for this task in Malayalam and Tamil. The Troll meme classification task aims to classify multimodal Troll memes into two categories. This task assumes the analysis of both text and image features for making better predictions. The performance of the participating teams was analysed using the F1-score. Only one team submitted their results in the Multimodal Sentiment Analysis task, whereas we received six submissions in the Troll meme classification task. The only team that participated in the Multimodal Sentiment Analysis shared task obtained an F1-score of 0.24. In the Troll meme classification task, the winning team achieved an F1-score of 0.596.",
  "keywords": [
    "the f1-score",
    "an f1-score",
    "meme classification",
    "movie",
    "categories",
    "text",
    "the classification",
    "we",
    "the multimodal sentiment analysis",
    "multimodal sentiment analysis",
    "movie reviews",
    "two categories",
    "analysis",
    "reviews",
    "classification"
  ],
  "url": "https://aclanthology.org/2022.dravidianlangtech-1.39/",
  "provenance": {
    "collected_at": "2025-06-05 08:42:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}