{
  "id": "2022.findings-acl.317",
  "title": "A Few-Shot Semantic Parser for {W}izard-of-{O}z Dialogues with the Precise {T}hing{T}alk Representation",
  "authors": [
    "Campagna, Giovanni  and\nSemnani, Sina  and\nKearns, Ryan  and\nKoba Sato, Lucas Jun  and\nXu, Silei  and\nLam, Monica"
  ],
  "year": "2022",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2022",
  "abstract": "Previous attempts to build effective semantic parsers for Wizard-of-Oz (WOZ) conversations suffer from the difficulty in acquiring a high-quality, manually annotated training set. Approaches based only on dialogue synthesis are insufficient, as dialogues generated from state-machine based models are poor approximations of real-life conversations. Furthermore, previously proposed dialogue state representations are ambiguous and lack the precision necessary for building an effective agent. This paper proposes a new dialogue representation and a sample-efficient methodology that can predict precise dialogue states in WOZ conversations. We extended the ThingTalk representation to capture all information an agent needs to respond properly. Our training strategy is sample-efficient: we combine (1) few-shot data sparsely sampling the full dialogue space and (2) synthesized data covering a subset space of dialogues generated by a succinct state-based dialogue model. The completeness of the extended ThingTalk language is demonstrated with a fully operational agent, which is also used in training data synthesis. We demonstrate the effectiveness of our methodology on MultiWOZ 3.0, a reannotation of the MultiWOZ 2.1 dataset in ThingTalk. ThingTalk can represent 98% of the test turns, while the simulator can emulate 85% of the validation set. We train a contextual semantic parser using our strategy, and obtain 79% turn-by-turn exact match accuracy on the reannotated test set.",
  "keywords": [
    "precision",
    "validation",
    "efficient",
    "conversations",
    "semantic",
    "we",
    "dialogue",
    "the full dialogue space",
    "a new dialogue representation",
    "shot",
    "training",
    "effective semantic parsers",
    "information",
    "a few-shot semantic parser",
    "a contextual semantic parser"
  ],
  "url": "https://aclanthology.org/2022.findings-acl.317/",
  "provenance": {
    "collected_at": "2025-06-05 08:39:06",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}