{
  "id": "2023.acl-industry.16",
  "title": "F}ashion{KLIP}: Enhancing {E}-Commerce Image-Text Retrieval with Fashion Multi-Modal Conceptual Knowledge Graph",
  "authors": [
    "Wang, Xiaodan  and\nWang, Chengyu  and\nLi, Lei  and\nLi, Zhixu  and\nChen, Ben  and\nJin, Linbo  and\nHuang, Jun  and\nXiao, Yanghua  and\nGao, Ming"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 5: Industry Track)",
  "abstract": "Image-text retrieval is a core task in the multi-modal domain, which arises a lot of attention from both research and industry communities. Recently, the booming of visual-language pre-trained (VLP) models has greatly enhanced the performance of cross-modal retrieval. However, the fine-grained interactions between objects from different modalities are far from well-established. This issue becomes more severe in the e-commerce domain, which lacks sufficient training data and fine-grained cross-modal knowledge. To alleviate the problem, this paper proposes a novel e-commerce knowledge-enhanced VLP model FashionKLIP. We first automatically establish a multi-modal conceptual knowledge graph from large-scale e-commerce image-text data, and then inject the prior knowledge into the VLP model to align across modalities at the conceptual level. The experiments conducted on a public benchmark dataset demonstrate that FashionKLIP effectively enhances the performance of e-commerce image-text retrieval upon state-of-the-art VLP models by a large margin. The application of the method in real industrial scenarios also proves the feasibility and efficiency of FashionKLIP.",
  "keywords": [
    "e-commerce image-text retrieval",
    "communities",
    "efficiency",
    "we",
    "graph",
    "training",
    "cross",
    "retrieval",
    "sufficient",
    "e -commerce image-text retrieval",
    "visual",
    "different modalities",
    "core",
    "text",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2023.acl-industry.16/",
  "provenance": {
    "collected_at": "2025-06-05 09:52:12",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}