{
  "id": "2023.findings-acl.112",
  "title": "Large Language Models with Controllable Working Memory",
  "authors": [
    "Li, Daliang  and\nRawat, Ankit Singh  and\nZaheer, Manzil  and\nWang, Xin  and\nLukasik, Michal  and\nVeit, Andreas  and\nYu, Felix  and\nKumar, Sanjiv"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Large language models (LLMs) have led to a series of breakthroughs in natural language processing (NLP), partly owing to the massive amounts of world knowledge they memorize during pretraining. While many downstream applications provide the model with an informational context to aid its underlying task, how the model’s world knowledge interacts with the factual information presented in the context remains under explored. As a desirable behavior, an LLM should give precedence to the context whenever it contains task-relevant information that conflicts with the model’s memorized knowledge. This enables model predictions to be grounded in the context, which then facilitates updating specific model predictions without frequently retraining the model. By contrast, when the context is irrelevant to the task, the model should ignore it and fall back on its internal knowledge. In this paper, we undertake a first joint study of the aforementioned two properties, namely controllability and robustness, in the context of LLMs. We demonstrate that state-of-the-art T5 and PaLM models (both pretrained and finetuned) could exhibit low controllability and robustness that does not improve with increasing the model size. As a solution, we propose a simple yet effective method – knowledge aware finetuning (KAFT) – to strengthen both controllability and robustness by injecting counterfactual and irrelevant contexts to standard supervised datasets. Our comprehensive evaluation showcases the utility of KAFT across model architectures and sizes.",
  "keywords": [
    "an llm",
    "series",
    "we",
    "llm",
    "natural language processing nlp",
    "natural",
    "it",
    "properties",
    "information",
    "the aforementioned two properties",
    "llms",
    "processing",
    "our comprehensive evaluation",
    "a series",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.112/",
  "provenance": {
    "collected_at": "2025-06-05 09:54:47",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}