{
  "id": "2023.bea-1.5",
  "title": "Reviewriter: {AI}-Generated Instructions For Peer Review Writing",
  "authors": [
    "Su, Xiaotian  and\nWambsganss, Thiemo  and\nRietsche, Roman  and\nNeshaei, Seyed Parsa  and\nK{\\\"a}ser, Tanja"
  ],
  "year": "2023",
  "venue": "Proceedings of the 18th Workshop on Innovative Use of NLP for Building Educational Applications (BEA 2023)",
  "abstract": "Large Language Models (LLMs) offer novel opportunities for educational applications that have the potential to transform traditional learning for students. Despite AI-enhanced applications having the potential to provide personalized learning experiences, more studies are needed on the design of generative AI systems and evidence for using them in real educational settings. In this paper, we design, implement and evaluate \\texttt{Reviewriter}, a novel tool to provide students with AI-generated instructions for writing peer reviews in German. Our study identifies three key aspects: a) we provide insights into student needs when writing peer reviews with generative models which we then use to develop a novel system to provide adaptive instructions b) we fine-tune three German language models on a selected corpus of 11,925 student-written peer review texts in German and choose German-GPT2 based on quantitative measures and human evaluation, and c) we evaluate our tool with fourteen students, revealing positive technology acceptance based on quantitative measures. Additionally, the qualitative feedback presents the benefits and limitations of generative AI in peer review writing.",
  "keywords": [
    "generative models",
    "gpt2",
    "feedback",
    "opportunities",
    "ai-generated instructions",
    "peer reviews",
    "we",
    "human evaluation",
    "learning",
    "german-gpt2",
    "a",
    "reviews",
    "novel opportunities",
    "llms",
    "generative"
  ],
  "url": "https://aclanthology.org/2023.bea-1.5/",
  "provenance": {
    "collected_at": "2025-06-05 10:21:19",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}