{
  "id": "2023.sicon-1.3",
  "title": "Large Language Models respond to Influence like Humans",
  "authors": [
    "Griffin, Lewis  and\nKleinberg, Bennett  and\nMozes, Maximilian  and\nMai, Kimberly  and\nVau, Maria Do Mar  and\nCaldwell, Matthew  and\nMavor-Parker, Augustine"
  ],
  "year": "2023",
  "venue": "Proceedings of the First Workshop on Social Influence in Conversations (SICon 2023)",
  "abstract": "Two studies tested the hypothesis that a Large Language Model (LLM) can be used to model psychological change following exposure to influential input. The first study tested a generic mode of influence - the Illusory Truth Effect (ITE) - where earlier exposure to a statement boosts a later truthfulness test rating. Analysis of newly collected data from human and LLM-simulated subjects (1000 of each) showed the same pattern of effects in both populations; although with greater per statement variability for the LLM. The second study concerns a specific mode of influence – populist framing of news to increase its persuasion and political mobilization. Newly collected data from simulated subjects was compared to previously published data from a 15 country experiment on 7286 human participants. Several effects from the human study were replicated by the simulated study, including ones that surprised the authors of the human study by contradicting their theoretical expectations; but some significant relationships found in human data were not present in the LLM data. Together the two studies support the view that LLMs have potential to act as models of the effect of influence.",
  "keywords": [
    "two studies",
    "the two studies",
    "llm",
    "earlier exposure",
    "analysis",
    "llms",
    "a generic mode",
    "generic",
    "the llm",
    "a large language model",
    "human and llm-simulated subjects",
    "mode",
    "earlier",
    "language",
    "model"
  ],
  "url": "https://aclanthology.org/2023.sicon-1.3/",
  "provenance": {
    "collected_at": "2025-06-05 10:31:04",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}