{
  "id": "2023.acl-short.142",
  "title": "Evaluating Zero-Shot Event Structures: Recommendations for Automatic Content Extraction ({ACE}) Annotations",
  "authors": [
    "Cai, Erica  and\nO{'}Connor, Brendan"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers)",
  "abstract": "Zero-shot event extraction (EE) methods infer richly structured event records from text, based only on a minimal user specification and no training examples, which enables flexibility in exploring and developing applications. Most event extraction research uses the Automatic Content Extraction (ACE) annotated dataset to evaluate supervised EE methods, but can it be used to evaluate zero-shot and other low-supervision EE? We describe ACE’s event structures and identify significant ambiguities and issues in current evaluation practice, including (1) coreferent argument mentions, (2) conflicting argument head conventions, and (3) ignorance of modality and event class details. By sometimes mishandling these subtleties, current work may dramatically understate the actual performance of zero-shot and other low-supervision EE, considering up to 32% of correctly identified arguments and 25% of correctly ignored event mentions as false negatives. For each issue, we propose recommendations for future evaluations so the research community can better utilize ACE as an event evaluation resource.",
  "keywords": [
    "current evaluation practice",
    "significant ambiguities",
    "extraction",
    "zero-shot event structures recommendations",
    "future evaluations",
    "we",
    "ambiguities",
    "current",
    "shot",
    "these subtleties",
    "training",
    "it",
    "an event evaluation resource",
    "text",
    "zero-shot"
  ],
  "url": "https://aclanthology.org/2023.acl-short.142/",
  "provenance": {
    "collected_at": "2025-06-05 09:50:13",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}