{
  "id": "2023.acl-long.411",
  "title": "Large Language Models Meet {NL}2{C}ode: A Survey",
  "authors": [
    "Zan, Daoguang  and\nChen, Bei  and\nZhang, Fengji  and\nLu, Dianjie  and\nWu, Bingchao  and\nGuan, Bei  and\nYongji, Wang  and\nLou, Jian-Guang"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "The task of generating code from a natural language description, or NL2Code, is considered a pressing and significant challenge in code intelligence. Thanks to the rapid development of pre-training techniques, surging large language models are being proposed for code, sparking the advances in NL2Code. To facilitate further research and applications in this field, in this paper, we present a comprehensive survey of 27 existing large language models for NL2Code, and also review benchmarks and metrics. We provide an intuitive comparison of all existing models on the HumanEval benchmark. Through in-depth observation and analysis, we provide some insights and conclude that the key factors contributing to the success of large language models for NL2Code are “Large Size, Premium Data, Expert Tuning”. In addition, we discuss challenges and opportunities regarding the gap between models and humans. We also create a websitehttps://nl2code.github.ioto track the latest progress through crowd-sourcing. To the best of our knowledge, this is the first survey of large language models for NL2Code, and we believe it will contribute to the ongoing development of the field.",
  "keywords": [
    "code",
    "opportunities",
    "field",
    "we",
    "ode",
    "training",
    "natural",
    "the field",
    "nl",
    "it",
    "analysis",
    "pre-training techniques",
    "metrics",
    "knowledge",
    "language"
  ],
  "url": "https://aclanthology.org/2023.acl-long.411/",
  "provenance": {
    "collected_at": "2025-06-05 09:40:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}