{
  "id": "2023.semeval-1.318",
  "title": "S}em{E}val-2023 Task 6: {L}egal{E}val - Understanding Legal Texts",
  "authors": [
    "Modi, Ashutosh  and\nKalamkar, Prathamesh  and\nKarn, Saurabh  and\nTiwari, Aman  and\nJoshi, Abhinav  and\nTanikella, Sai Kiran  and\nGuha, Shouvik Kumar  and\nMalhan, Sachin  and\nRaghavan, Vivek"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "In populous countries, pending legal cases have been growing exponentially. There is a need for developing NLP-based techniques for processing and automatically understanding legal documents. To promote research in the area of Legal NLP we organized the shared task LegalEval - Understanding Legal Texts at SemEval 2023. LegalEval task has three sub-tasks: Task-A (Rhetorical Roles Labeling) is about automatically structuring legal documents into semantically coherent units, Task-B (Legal Named Entity Recognition) deals with identifying relevant entities in a legal document and Task-C (Court Judgement Prediction with Explanation) explores the possibility of automatically predicting the outcome of a legal case along with providing an explanation for the prediction. In total 26 teams (approx. 100 participants spread across the world) submitted systems paper. In each of the sub-tasks, the proposed systems outperformed the baselines; however, there is a lot of scope for improvement. This paper describes the tasks, and analyzes techniques proposed by various teams.",
  "keywords": [
    "em",
    "we",
    "val",
    "relevant entities",
    "legal nlp",
    "semantically coherent units",
    "nlp-based techniques",
    "processing",
    "-",
    "countries",
    "nlp",
    "entities",
    "entity",
    "populous countries",
    "documents"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.318/",
  "provenance": {
    "collected_at": "2025-06-05 10:31:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}