{
  "id": "2023.acl-long.295",
  "title": "Tackling Ambiguity with Images: Improved Multimodal Machine Translation and Contrastive Evaluation",
  "authors": [
    "Futeral, Matthieu  and\nSchmid, Cordelia  and\nLaptev, Ivan  and\nSagot, Beno{\\^i}t  and\nBawden, Rachel"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "One of the major challenges of machine translation (MT) is ambiguity, which can in some cases be resolved by accompanying context such as images. However, recent work in multimodal MT (MMT) has shown that obtaining improvements from images is challenging, limited not only by the difficulty of building effective cross-modal representations, but also by the lack of specific evaluation and training data. We present a new MMT approach based on a strong text-only MT model, which uses neural adapters, a novel guided self-attention mechanism and which is jointly trained on both visually-conditioned masking and MMT. We also introduce CoMMuTE, a Contrastive Multilingual Multimodal Translation Evaluation set of ambiguous sentences and their possible translations, accompanied by disambiguating images corresponding to each translation. Our approach obtains competitive results compared to strong text-only models on standard English→French, English→German and English→Czech benchmarks and outperforms baselines and state-of-the-art MMT systems by a large margin on our contrastive test set. Our code and CoMMuTE are freely available.",
  "keywords": [
    "code",
    "their possible translations",
    "multimodal machine translation",
    "each translation",
    "machine translation",
    "we",
    "training",
    "translation",
    "cross",
    "neural",
    "self",
    "text",
    "work",
    "model",
    "machine"
  ],
  "url": "https://aclanthology.org/2023.acl-long.295/",
  "provenance": {
    "collected_at": "2025-06-05 09:39:25",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}