{
  "id": "2023.acl-long.539",
  "title": "D}ecomp{E}val: Evaluating Generated Texts as Unsupervised Decomposed Question Answering",
  "authors": [
    "Ke, Pei  and\nHuang, Fei  and\nMi, Fei  and\nWang, Yasheng  and\nLiu, Qun  and\nZhu, Xiaoyan  and\nHuang, Minlie"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Existing evaluation metrics for natural language generation (NLG) tasks face the challenges on generalization ability and interpretability. Specifically, most of the well-performed metrics are required to train on evaluation datasets of specific NLG tasks and evaluation dimensions, which may cause over-fitting to task-specific datasets. Furthermore, existing metrics only provide an evaluation score for each dimension without revealing the evidence to interpret how this score is obtained. To deal with these challenges, we propose a simple yet effective metric called DecompEval. This metric formulates NLG evaluation as an instruction-style question answering task and utilizes instruction-tuned pre-trained language models (PLMs) without training on evaluation datasets, aiming to enhance the generalization ability. To make the evaluation process more interpretable, we decompose our devised instruction-style question about the quality of generated texts into the subquestions that measure the quality of each sentence. The subquestions with their answers generated by PLMs are then recomposed as evidence to obtain the evaluation result. Experimental results show that DecompEval achieves state-of-the-art performance in untrained metrics for evaluating text summarization and dialogue generation, which also exhibits strong dimension-level / task-level generalization ability and interpretability.",
  "keywords": [
    "the generalization ability",
    "text summarization",
    "existing evaluation metrics",
    "question",
    "summarization",
    "we",
    "dialogue",
    "generalization ability",
    "furthermore existing metrics",
    "training",
    "instruction",
    "val",
    "natural",
    "generated texts",
    "dialogue generation"
  ],
  "url": "https://aclanthology.org/2023.acl-long.539/",
  "provenance": {
    "collected_at": "2025-06-05 09:42:46",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}