{
  "id": "2023.acl-industry.75",
  "title": "Weakly supervised hierarchical multi-task classification of customer questions",
  "authors": [
    "Rana, Jitenkumar  and\nYenigalla, Promod  and\nAggarwal, Chetan  and\nMukku, Sandeep Sricharan  and\nSoni, Manan  and\nPatange, Rashmi"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 5: Industry Track)",
  "abstract": "Identifying granular and actionable topics from customer questions (CQ) posted on e-commerce websites helps surface the missing information expected by customers on the product detail page (DP), provide insights to brands and sellers on what critical product information that the customers are looking before making a purchase decision and helps enrich the catalog quality to improve the overall customer experience (CX). We propose a weakly supervised Hierarchical Multi-task Classification Framework (HMCF) to identify topics from customer questions at various granularities. Complexity lies in creating a list of granular topics (taxonomy) for 1000s of product categories and building a scalable classification system. To this end, we introduce a clustering based Taxonomy Creation and Data Labeling (TCDL) module for creating taxonomy and labelled data with minimal supervision. Using TCDL module, taxonomy and labelled data creation task reduces to 2 hours as compared to 2 weeks of manual efforts by a subject matter expert. For classification, we propose a two level HMCF that performs multi-class classification to identify coarse level-1 topic and leverages NLI based label-aware approach to identify granular level-2 topic. We showcase that HMCF (based on BERT and NLI) a) achieves absolute improvement of 13% in Top-1 accuracy over single-task non-hierarchical baselines b) learns a generic domain invariant function that can adapt to constantly evolving taxonomy (open label set) without need of re-training. c) reduces model deployment efforts significantly since it needs only one model that caters to 1000s of product categories.",
  "keywords": [
    "top-1 accuracy",
    "end",
    "various granularities complexity",
    "granularities",
    "product categories",
    "b",
    "we",
    "training",
    "classification",
    "it",
    "information",
    "hierarchical multi-task classification",
    "multi-class classification",
    "categories",
    "bert"
  ],
  "url": "https://aclanthology.org/2023.acl-industry.75/",
  "provenance": {
    "collected_at": "2025-06-05 09:53:02",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}