{
  "id": "2023.sigmorphon-1.4",
  "title": "Joint Learning Model for Low-Resource Agglutinative Language Morphological Tagging",
  "authors": [
    "Abudouwaili, Gulinigeer  and\nAbiderexiti, Kahaerjiang  and\nYi, Nian  and\nWumaier, Aishan"
  ],
  "year": "2023",
  "venue": "Proceedings of the 20th SIGMORPHON workshop on Computational Research in Phonetics, Phonology, and Morphology",
  "abstract": "Due to the lack of data resources, rule-based or transfer learning is mainly used in the morphological tagging of low-resource languages. However, these methods require expert knowledge, ignore contextual features, and have error propagation. Therefore, we propose a joint morphological tagger for low-resource agglutinative languages to alleviate the above challenges. First, we represent the contextual input with multi-dimensional features of agglutinative words. Second, joint training reduces the direct impact of part-of-speech errors on morphological features and increases the indirect influence between the two types of labels through a fusion mechanism. Finally, our model separately predicts part-of-speech and morphological features. Part-of-speech tagging is regarded as sequence tagging. When predicting morphological features, two-label adjacency graphs are dynamically reconstructed by integrating multilingual global features and monolingual local features. Then, a graph convolution network is used to learn the higher-order intersection of labels. A series of experiments show that the proposed model in this paper is superior to other comparative models.",
  "keywords": [
    "series",
    "we",
    "graph",
    "fusion",
    "training",
    "learning",
    "transfer",
    "sequence",
    "dimensional",
    "a series",
    "knowledge",
    "language",
    "model",
    "convolution",
    "tagging"
  ],
  "url": "https://aclanthology.org/2023.sigmorphon-1.4/",
  "provenance": {
    "collected_at": "2025-06-05 10:31:11",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}