{
  "id": "2023.acl-short.150",
  "title": "STT}4{SG}-350: A Speech Corpus for All {S}wiss {G}erman Dialect Regions",
  "authors": [
    "Pl{\\\"u}ss, Michel  and\nDeriu, Jan  and\nSchraner, Yanick  and\nPaonessa, Claudio  and\nHartmann, Julia  and\nSchmidt, Larissa  and\nScheller, Christian  and\nH{\\\"u}rlimann, Manuela  and\nSamard{\\v{z}}i{\\'c}, Tanja  and\nVogel, Manfred  and\nCieliebak, Mark"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers)",
  "abstract": "We present STT4SG-350, a corpus of Swiss German speech, annotated with Standard German text at the sentence level. The data is collected using a web app in which the speakers are shown Standard German sentences, which they translate to Swiss German and record. We make the corpus publicly available. It contains 343 hours of speech from all dialect regions and is the largest public speech corpus for Swiss German to date. Application areas include automatic speech recognition (ASR), text-to-speech, dialect identification, and speaker recognition. Dialect information, age group, and gender of the 316 speakers are provided. Genders are equally represented and the corpus includes speakers of all ages. Roughly the same amount of speech is provided per dialect region, which makes the corpus ideally suited for experiments with speech technology for different dialects. We provide training, validation, and test splits of the data. The test set consists of the same spoken sentences for each dialect region and allows a fair evaluation of the quality of speech technologies in different dialects. We train an ASR model on the training set and achieve an average BLEU score of 74.7 on the test set. The model beats the best published BLEU scores on 2 other Swiss German ASR test sets, demonstrating the quality of the corpus.",
  "keywords": [
    "validation",
    "bleu",
    "all",
    "we",
    "training",
    "a fair evaluation",
    "it",
    "information",
    "technologies",
    "an average bleu score",
    "text",
    "speech technologies",
    "age",
    "model",
    "stt"
  ],
  "url": "https://aclanthology.org/2023.acl-short.150/",
  "provenance": {
    "collected_at": "2025-06-05 09:50:19",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}