{
  "id": "2023.findings-acl.549",
  "title": "Class-Adaptive Self-Training for Relation Extraction with Incompletely Annotated Training Data",
  "authors": [
    "Tan, Qingyu  and\nXu, Lu  and\nBing, Lidong  and\nNg, Hwee Tou"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Relation extraction (RE) aims to extract relations from sentences and documents. Existing relation extraction models typically rely on supervised machine learning. However, recent studies showed that many RE datasets are incompletely annotated. This is known as the false negative problem in which valid relations are falsely annotated as ‘no_relation’. Models trained with such data inevitably make similar mistakes during the inference stage. Self-training has been proven effective in alleviating the false negative problem. However, traditional self-training is vulnerable to confirmation bias and exhibits poor performance in minority classes. To overcome this limitation, we proposed a novel class-adaptive re-sampling self-training framework. Specifically, we re-sampled the pseudo-labels for each class by precision and recall scores. Our re-sampling strategy favored the pseudo-labels of classes with high precision and low recall, which improved the overall recall without significantly compromising precision. We conducted experiments on document-level and biomedical relation extraction datasets, and the results showed that our proposed self-training framework consistently outperforms existing competitive methods on the Re-DocRED and ChemDisgene datasets when the training data are incompletely annotated.",
  "keywords": [
    "bias",
    "precision",
    "extraction",
    "significantly compromising precision",
    "high precision",
    "we",
    "valid",
    "training",
    "self",
    "low recall",
    "however recent studies",
    "vulnerable",
    "the overall recall",
    "-",
    "confirmation bias"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.549/",
  "provenance": {
    "collected_at": "2025-06-05 10:16:05",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}