{
  "id": "2023.bea-1.15",
  "title": "Labels are not necessary: Assessing peer-review helpfulness using domain adaptation based on self-training",
  "authors": [
    "Liu, Chengyuan  and\nDoshi, Divyang  and\nBhargava, Muskaan  and\nShang, Ruixuan  and\nCui, Jialin  and\nXu, Dongkuan  and\nGehringer, Edward"
  ],
  "year": "2023",
  "venue": "Proceedings of the 18th Workshop on Innovative Use of NLP for Building Educational Applications (BEA 2023)",
  "abstract": "A peer-assessment system allows students to provide feedback on each other’s work. An effective peer assessment system urgently requires helpful reviews to facilitate students to make improvements and progress. Automated evaluation of review helpfulness, with the help of deep learning models and natural language processing techniques, gains much interest in the field of peer assessment. However, collecting labeled data with the “helpfulness” tag to build these prediction models remains challenging. A straightforward solution would be using a supervised learning algorithm to train a prediction model on a similar domain and apply it to our peer review domain for inference. But naively doing so can degrade the model performance in the presence of the distributional gap between domains. Such a distributional gap can be effectively addressed by Domain Adaptation (DA). Self-training has recently been shown as a powerful branch of DA to address the distributional gap. The first goal of this study is to evaluate the performance of self-training-based DA in predicting the helpfulness of peer reviews as well as the ability to overcome the distributional gap. Our second goal is to propose an advanced self-training framework to overcome the weakness of the existing self-training by tailoring knowledge distillation and noise injection, to further improve the model performance and better address the distributional gap.",
  "keywords": [
    "deep",
    "natural language processing techniques",
    "our peer review domain",
    "feedback",
    "field",
    "peer reviews",
    "da",
    "training",
    "natural",
    "the field",
    "it",
    "self",
    "tag",
    "learning",
    "helpful reviews"
  ],
  "url": "https://aclanthology.org/2023.bea-1.15/",
  "provenance": {
    "collected_at": "2025-06-05 10:21:27",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}