{
  "id": "2023.acl-long.791",
  "title": "Multimodal Persona Based Generation of Comic Dialogs",
  "authors": [
    "Agrawal, Harsh  and\nMishra, Aditya  and\nGupta, Manish  and\nMausam"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "We focus on the novel problem of persona based dialogue generation for comic strips. Dialogs in comic strips is a unique and unexplored area where every strip contains utterances from various characters with each one building upon the previous utterances and the associated visual scene. Previous works like DialoGPT, PersonaGPT and other dialog generation models encode two-party dialogues and do not account for the visual information. To the best of our knowledge we are the first to propose the paradigm of multimodal persona based dialogue generation. We contribute a novel dataset, ComSet, consisting of 54K strips, harvested from 13 popular comics available online. Further, we propose a multimodal persona-based architecture, MPDialog, to generate dialogues for the next panel in the strip which decreases the perplexity score by ~10 points over strong dialogue generation baseline models. We demonstrate that there is still ample opportunity for improvement, highlighting the importance of building stronger dialogue systems that are able to generate persona-consistent dialogues and understand the context through various modalities.",
  "keywords": [
    "the perplexity score",
    "we",
    "dialogue",
    "dialogpt",
    "dialogpt personagpt",
    "information",
    "various modalities",
    "visual",
    "based generation",
    "persona based dialogue generation",
    "perplexity",
    "other dialog generation models",
    "knowledge",
    "generation",
    "based dialogue generation"
  ],
  "url": "https://aclanthology.org/2023.acl-long.791/",
  "provenance": {
    "collected_at": "2025-06-05 09:46:25",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}