{
  "id": "2023.acl-long.390",
  "title": "When and how to paraphrase for named entity recognition?",
  "authors": [
    "Sharma, Saket  and\nJoshi, Aviral  and\nZhao, Yiyun  and\nMukhija, Namrata  and\nBhathena, Hanoz  and\nSingh, Prateek  and\nSanthanam, Sashank"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "While paraphrasing is a promising approach for data augmentation in classification tasks, its effect on named entity recognition (NER) is not investigated systematically due to the difficulty of span-level label preservation. In this paper, we utilize simple strategies to annotate entity spans in generations and compare established and novel methods of paraphrasing in NLP such as back translation, specialized encoder-decoder models such as Pegasus, and GPT-3 variants for their effectiveness in improving downstream performance for NER across different levels of gold annotations and paraphrasing strength on 5 datasets. We thoroughly explore the influence of paraphrasers, and dynamics between paraphrasing strength and gold dataset size on the NER performance with visualizations and statistical testing. We find that the choice of the paraphraser greatly impacts NER performance, with one of the larger GPT-3 variants exceedingly capable of generating high quality paraphrases, yielding statistically significant improvements in NER performance with increasing paraphrasing strength, while other paraphrasers show more mixed results. Additionally, inline auto annotations generated by larger GPT-3 are strictly better than heuristic based annotations. We also find diminishing benefits of paraphrasing as gold annotations increase for most datasets. Furthermore, while most paraphrasers promote entity memorization in NER, the proposed GPT-3 configuration performs most favorably among the compared paraphrasers when tested on unseen entities, with memorization reducing further with paraphrasing strength. Finally, we explore mention replacement using GPT-3, which provides additional benefits over base paraphrasing for specific datasets.",
  "keywords": [
    "larger gpt-3",
    "we",
    "named entity recognition ner",
    "translation",
    "classification",
    "simple strategies",
    "gpt-3",
    "decoder",
    "the proposed gpt-3 configuration",
    "ner",
    "the larger gpt-3 variants",
    "named entity recognition",
    "strategies",
    "generations",
    "pegasus and gpt-3 variants"
  ],
  "url": "https://aclanthology.org/2023.acl-long.390/",
  "provenance": {
    "collected_at": "2025-06-05 09:40:42",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}