{
  "id": "2023.acl-long.844",
  "title": "On Improving Summarization Factual Consistency from Natural Language Feedback",
  "authors": [
    "Liu, Yixin  and\nDeb, Budhaditya  and\nTeruel, Milagro  and\nHalfaker, Aaron  and\nRadev, Dragomir  and\nAwadallah, Ahmed Hassan"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Despite the recent progress in language generation models, their outputs may not always meet user expectations. In this work, we study whether informational feedback in natural language can be leveraged to improve generation quality and user preference alignment. To this end, we consider factual consistency in summarization, the quality that the summary should only contain information supported by the input documents, as the user-expected preference. We collect a high-quality dataset, DeFacto, containing human demonstrations and informational natural language feedback consisting of corrective instructions, edited summaries, and explanations with respect to the factual consistency of the summary. Using our dataset, we study three natural language generation tasks: (1) editing a summary by following the human feedback, (2) generating human feedback for editing the original summary, and (3) revising the initial summary to correct factual errors by generating both the human feedback and edited summary. We show that DeFacto can provide factually consistent human-edited summaries and further insights into summarization factual consistency thanks to its informational natural language feedback. We further demonstrate that fine-tuned language models can leverage our dataset to improve the summary factual consistency, while large language models lack the zero-shot learning ability in our proposed tasks that require controllable text generation.",
  "keywords": [
    "user preference alignment",
    "end",
    "feedback",
    "controllable text generation",
    "generation quality",
    "summarization",
    "we",
    "human feedback",
    "shot",
    "natural",
    "information",
    "the human feedback",
    "natural language",
    "factually consistent human-edited summaries",
    "text"
  ],
  "url": "https://aclanthology.org/2023.acl-long.844/",
  "provenance": {
    "collected_at": "2025-06-05 09:47:13",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}