{
  "id": "2023.acl-long.518",
  "title": "CLAPS}peech: Learning Prosody from Text Context with Contrastive Language-Audio Pre-Training",
  "authors": [
    "Ye, Zhenhui  and\nHuang, Rongjie  and\nRen, Yi  and\nJiang, Ziyue  and\nLiu, Jinglin  and\nHe, Jinzheng  and\nYin, Xiang  and\nZhao, Zhou"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Improving text representation has attracted much attention to achieve expressive text-to-speech (TTS). However, existing works only implicitly learn the prosody with masked token reconstruction tasks, which leads to low training efficiency and difficulty in prosody modeling. We propose CLAPSpeech, a cross-modal contrastive pre-training framework that learns from the prosody variance of the same text token under different contexts. Specifically, 1) with the design of a text encoder and a prosody encoder, we encourage the model to connect the text context with its corresponding prosody pattern in the joint multi-modal space; 2) we introduce a multi-scale pre-training pipeline to capture prosody patterns in multiple levels. 3) we show how to incorporate CLAPSpeech into existing TTS models for better prosody. Experiments on three datasets not only show that CLAPSpeech could improve the prosody prediction for existing TTS methods, but also demonstrate its generalization ability to adapt to multiple languages and multi-speaker text-to-speech. We also deeply analyze the principle behind the performance of CLAPSpeech. Ablation studies demonstrate the necessity of each component in CLAPSpeech. Source code and audio samples are available athttps://clapspeech.github.io.",
  "keywords": [
    "much attention",
    "code",
    "low training efficiency",
    "the prosody variance",
    "efficiency",
    "we",
    "variance",
    "training",
    "cross",
    "token",
    "its generalization ability",
    "text",
    "a prosody encoder",
    "generalization",
    "a multi-scale pre-training pipeline"
  ],
  "url": "https://aclanthology.org/2023.acl-long.518/",
  "provenance": {
    "collected_at": "2025-06-05 09:42:27",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}