{
  "id": "2023.bionlp-1.45",
  "title": "Overview of the {R}ad{S}um23 Shared Task on Multi-modal and Multi-anatomical Radiology Report Summarization",
  "authors": [
    "Delbrouck, Jean-Benoit  and\nVarma, Maya  and\nChambon, Pierre  and\nLanglotz, Curtis"
  ],
  "year": "2023",
  "venue": "The 22nd Workshop on Biomedical Natural Language Processing and BioNLP Shared Tasks",
  "abstract": "Radiology report summarization is a growing area of research. Given the Findings and/or Background sections of a radiology report, the goal is to generate a summary (called an Impression section) that highlights the key observations and conclusions of the radiology study. Recent efforts have released systems that achieve promising performance as measured by widely used summarization metrics such as BLEU and ROUGE. However, the research area of radiology report summarization currently faces two important limitations. First, most of the results are reported on private datasets. This limitation prevents the ability to reproduce results and fairly compare different systems and solutions. Secondly, to the best of our knowledge, most research is carried out on chest X-rays. To palliate these two limitations, we propose a radiology report summarization (RadSum) challenge on i) a new dataset of eleven different modalities and anatomies pairs based on the MIMIC-III database ii) a multimodal report summarization dataset based on MIMIC-CXR enhanced with a brand-new test-set from Stanford Hospital. In total, we received 112 submissions across 11 teams.",
  "keywords": [
    "anatomies",
    "bleu",
    "overview",
    "summarization",
    "we",
    "widely used summarization metrics",
    "eleven different modalities",
    "i",
    "background",
    "metrics",
    "-",
    "radiology report summarization",
    "rouge",
    "knowledge",
    "modalities"
  ],
  "url": "https://aclanthology.org/2023.bionlp-1.45/",
  "provenance": {
    "collected_at": "2025-06-05 10:22:45",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}