{
  "id": "2023.acl-long.258",
  "title": "Enhancing Language Representation with Constructional Information for Natural Language Understanding",
  "authors": [
    "Xu, Lvxiaowei  and\nWu, Jianwang  and\nPeng, Jiawei  and\nGong, Zhilin  and\nCai, Ming  and\nWang, Tianxiang"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Natural language understanding (NLU) is an essential branch of natural language processing, which relies on representations generated by pre-trained language models (PLMs). However, PLMs primarily focus on acquiring lexico-semantic information, while they may be unable to adequately handle the meaning of constructions. To address this issue, we introduce construction grammar (CxG), which highlights the pairings of form and meaning, to enrich language representation. We adopt usage-based construction grammar as the basis of our work, which is highly compatible with statistical models such as PLMs. Then a HyCxG framework is proposed to enhance language representation through a three-stage solution. First, all constructions are extracted from sentences via a slot-constraints approach. As constructions can overlap with each other, bringing redundancy and imbalance, we formulate the conditional max coverage problem for selecting the discriminative constructions. Finally, we propose a relational hypergraph attention network to acquire representation from constructional information by capturing high-order word interactions among constructions. Extensive experiments demonstrate the superiority of the proposed model on a variety of NLU tasks.",
  "keywords": [
    "variety",
    "form",
    "semantic",
    "we",
    "natural",
    "information",
    "pre-trained language models plms",
    "word",
    "max",
    "natural language processing",
    "a variety",
    "natural language",
    "processing",
    "work",
    "language"
  ],
  "url": "https://aclanthology.org/2023.acl-long.258/",
  "provenance": {
    "collected_at": "2025-06-05 09:38:55",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}