{
  "id": "2023.acl-long.708",
  "title": "Understanding In-Context Learning via Supportive Pretraining Data",
  "authors": [
    "Han, Xiaochuang  and\nSimig, Daniel  and\nMihaylov, Todor  and\nTsvetkov, Yulia  and\nCelikyilmaz, Asli  and\nWang, Tianlu"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "In-context learning (ICL) improves language models’ performance on a variety of NLP tasks by simply demonstrating a handful of examples at inference time. It is not well understood why ICL ability emerges, as the model has never been specifically trained on such demonstrations. Unlike prior work that explores implicit mechanisms behind ICL, we study ICL via investigating the pretraining data. Specifically, we first adapt an iterative, gradient-based approach to find a small subset of pretraining data that supports ICL. We observe that a continued pretraining on this small subset significantly improves the model’s ICL ability, by up to 18%. We then compare the supportive subset constrastively with random subsets of pretraining data and discover: (1) The supportive pretraining data to ICL do not have a higher domain relevance to downstream tasks. (2) The supportive pretraining data have a higher mass of rarely occurring, long-tail tokens. (3) The supportive pretraining data are challenging examples where the information gain from long-range context is below average, indicating learning to incorporate difficult long-range context encourages ICL. Our work takes a first step towards understanding ICL via analyzing instance-level pretraining data. Our insights have a potential to enhance the ICL ability of language models by actively guiding the construction of pretraining data in the future.",
  "keywords": [
    "variety",
    "we",
    "it",
    "information",
    "learning",
    "an iterative gradient-based approach",
    "a variety",
    "nlp tasks",
    "language models",
    "language models performance",
    "work",
    "random",
    "language",
    "nlp",
    "model"
  ],
  "url": "https://aclanthology.org/2023.acl-long.708/",
  "provenance": {
    "collected_at": "2025-06-05 09:45:13",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}