{
  "id": "2023.semeval-1.314",
  "title": "S}em{E}val-2023 Task 11: Learning with Disagreements ({L}e{W}i{D}i)",
  "authors": [
    "Leonardelli, Elisa  and\nAbercrombie, Gavin  and\nAlmanea, Dina  and\nBasile, Valerio  and\nFornaciari, Tommaso  and\nPlank, Barbara  and\nRieser, Verena  and\nUma, Alexandra  and\nPoesio, Massimo"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "NLP datasets annotated with human judgments are rife with disagreements between the judges. This is especially true for tasks depending on subjective judgments such as sentiment analysis or offensive language detection. Particularly in these latter cases, the NLP community has come to realize that the common approach of reconciling’ these different subjective interpretations risks misrepresenting the evidence. Many NLP researchers have therefore concluded that rather than eliminating disagreements from annotated corpora, we should preserve themindeed, some argue that corpora should aim to preserve all interpretations produced by annotators. But this approach to corpus creation for NLP has not yet been widely accepted. The objective of the Le-Wi-Di series of shared tasks is to promote this approach to developing NLP models by providing a unified framework for training and evaluating with such datasets. We report on the second such shared task, which differs from the first edition in three crucial respects: (i) it focuses entirely on NLP, instead of both NLP and computer vision tasks in its first edition; (ii) it focuses on subjective tasks, instead of covering different types of disagreements as training with aggregated labels for subjective NLP tasks is in effect a misrepresentation of the data; and (iii) for the evaluation, we concentrated on soft approaches to evaluation. This second edition of Le-Wi-Di attracted a wide array of partici- pants resulting in 13 shared task submission papers.",
  "keywords": [
    "em",
    "series",
    "the nlp community",
    "we",
    "many nlp researchers",
    "training",
    "it",
    "the objective",
    "a unified framework",
    "unified",
    "nlp models",
    "the le-wi-di series",
    "analysis",
    "i",
    "sentiment analysis"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.314/",
  "provenance": {
    "collected_at": "2025-06-05 10:30:56",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}