{
  "id": "2023.findings-acl.358",
  "title": "Enhancing Hierarchical Text Classification through Knowledge Graph Integration",
  "authors": [
    "Liu, Ye  and\nZhang, Kai  and\nHuang, Zhenya  and\nWang, Kehang  and\nZhang, Yanghai  and\nLiu, Qi  and\nChen, Enhong"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Hierarchical Text Classification (HTC) is an essential and challenging subtask of multi-label text classification with a taxonomic hierarchy. Recent advances in deep learning and pre-trained language models have led to significant breakthroughs in the HTC problem. However, despite their effectiveness, these methods are often restricted by a lack of domain knowledge, which leads them to make mistakes in a variety of situations. Generally, when manually classifying a specific document to the taxonomic hierarchy, experts make inference based on their prior knowledge and experience. For machines to achieve this capability, we propose a novel Knowledge-enabled Hierarchical Text Classification model (K-HTC), which incorporates knowledge graphs into HTC. Specifically, K-HTC innovatively integrates knowledge into both the text representation and hierarchical label learning process, addressing the knowledge limitations of traditional methods. Additionally, a novel knowledge-aware contrastive learning strategy is proposed to further exploit the information inherent in the data. Extensive experiments on two publicly available HTC datasets show the efficacy of our proposed method, and indicate the necessity of incorporating knowledge graphs in HTC tasks.",
  "keywords": [
    "deep",
    "variety",
    "knowledge graph integration",
    "k",
    "we",
    "graph",
    "classification",
    "pre-trained language models",
    "multi-label text classification",
    "information",
    "knowledge graphs",
    "learning",
    "a variety",
    "hierarchical text classification",
    "the taxonomic hierarchy experts"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.358/",
  "provenance": {
    "collected_at": "2025-06-05 09:58:16",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}