{
  "id": "2023.acl-long.202",
  "title": "C}ode4{S}truct: Code Generation for Few-Shot Event Structure Prediction",
  "authors": [
    "Wang, Xingyao  and\nLi, Sha  and\nJi, Heng"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Large Language Model (LLM) trained on a mixture of text and code has demonstrated impressive capability in translating natural language (NL) into structured code. We observe that semantic structures can be conveniently translated into code and propose Code4Struct to leverage such text-to-structure translation capability to tackle structured prediction tasks. As a case study, we formulate Event Argument Extraction (EAE) as converting text into event-argument structures that can be represented as a class object using code. This alignment between structures and code enables us to take advantage of Programming Language (PL) features such as inheritance and type annotation to introduce external knowledge or add constraints. We show that, with sufficient in-context examples, formulating EAE as a code generation problem is advantageous over using variants of text-based prompts. Despite only using 20 training event instances for each event type, Code4Struct is comparable to supervised models trained on 4,202 instances and outperforms current state-of-the-art (SOTA) trained on 20-shot data by 29.5% absolute F1. Code4Struct can use 10-shot training data from a sibling event type to predict arguments for zero-resource event types and outperforms the zero-shot baseline by 12% absolute F1.",
  "keywords": [
    "code",
    "this alignment",
    "text-based prompts",
    "semantic",
    "we",
    "current",
    "llm",
    "large language model llm",
    "shot",
    "training",
    "translation",
    "natural",
    "truct",
    "the zero-shot baseline",
    "12 absolute f1"
  ],
  "url": "https://aclanthology.org/2023.acl-long.202/",
  "provenance": {
    "collected_at": "2025-06-05 09:38:09",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}