{
  "id": "2023.wassa-1.43",
  "title": "Modelling Political Aggression on Social Media Platforms",
  "authors": [
    "Rawat, Akash  and\nNafis, Nazia  and\nBhadane, Dnyaneshwar  and\nKanojia, Diptesh  and\nMurthy, Rudra"
  ],
  "year": "2023",
  "venue": "Proceedings of the 13th Workshop on Computational Approaches to Subjectivity, Sentiment, {\\&} Social Media Analysis",
  "abstract": "Recent years have seen a proliferation of aggressive social media posts, often wreaking even real-world consequences for victims. Aggressive behaviour on social media is especially evident during important sociopolitical events such as elections, communal incidents, and public protests. In this paper, we introduce a dataset in English to model political aggression. The dataset comprises public tweets collated across the time-frames of two of the most recent Indian general elections. We manually annotate this data for the task of aggression detection and analyze this data for aggressive behaviour. To benchmark the efficacy of our dataset, we perform experiments by fine-tuning pre-trained language models and comparing the results with models trained on an existing but general domain dataset. Our models consistently outperform the models trained on existing data. Our best model achieves a macro F1-score of 66.66 on our dataset. We also train models on a combined version of both datasets, achieving best macro F1-score of 92.77, on our dataset. Additionally, we create subsets of code-mixed and non-code-mixed data from the combined dataset to observe variations in results due to the Hindi-English code-mixing phenomenon. We publicly release the anonymized data, code, and models for further research.",
  "keywords": [
    "a macro f1-score",
    "code",
    "fine-tuning pre-trained language models",
    "we",
    "best macro f1-score",
    "general",
    "language",
    "model",
    "pre",
    "time",
    "behaviour",
    "media",
    "events",
    "recent",
    "victims"
  ],
  "url": "https://aclanthology.org/2023.wassa-1.43/",
  "provenance": {
    "collected_at": "2025-06-05 10:33:31",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}