{
  "id": "2023.sigmorphon-1.3",
  "title": "Evaluating Cross Lingual Transfer for Morphological Analysis: a Case Study of {I}ndian Languages",
  "authors": [
    "Pawar, Siddhesh  and\nBhattacharyya, Pushpak  and\nTalukdar, Partha"
  ],
  "year": "2023",
  "venue": "Proceedings of the 20th SIGMORPHON workshop on Computational Research in Phonetics, Phonology, and Morphology",
  "abstract": "Recent advances in pretrained multilingual models such as Multilingual T5 (mT5) have facilitated cross-lingual transfer by learning shared representations across languages. Leveraging pretrained multilingual models for scaling morphology analyzers to low-resource languages is a unique opportunity that has been under-explored so far. We investigate this line of research in the context of Indian languages, focusing on two important morphological sub-tasks: root word extraction and tagging morphosyntactic descriptions (MSD), viz., gender, number, and person (GNP). We experiment with six Indian languages from two language families (Dravidian and Indo-Aryan) to train a multilingual morphology analyzers for the first time for Indian languages. We demonstrate the usability of multilingual models for few-shot cross-lingual transfer through an average 7% increase in GNP tagging in a cross-lingual setting as compared to a monolingual setting through controlled experiments. We provide an overview of the state of the datasets available related to our tasks and point-out a few modeling limitations due to datasets. Lastly, we analyze the cross-lingual transfer of morphological tags for verbs and nouns, which provides a proxy for the quality of representations of word markings learned by the model.",
  "keywords": [
    "families",
    "extraction",
    "overview",
    "we",
    "shot",
    "cross",
    "an overview",
    "word",
    "transfer",
    "analysis",
    "few-shot cross-lingual transfer",
    "two language families",
    "language",
    "model",
    "modeling"
  ],
  "url": "https://aclanthology.org/2023.sigmorphon-1.3/",
  "provenance": {
    "collected_at": "2025-06-05 10:31:10",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}