{
  "id": "2023.findings-acl.882",
  "title": "Learning Query Adaptive Anchor Representation for Inductive Relation Prediction",
  "authors": [
    "Xie, Zhiwen  and\nZhang, Yi  and\nLiu, Jin  and\nZhou, Guangyou  and\nHuang, Jimmy"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Relation prediction on knowledge graphs (KGs) attempts to infer the missing links between entities. Most previous studies are limited to the transductive setting where all entities must be seen during the training, making them unable to perform reasoning on emerging entities. Recently, the inductive setting is proposed to handle the entities in the test phase to be unseen during training, However, it suffers from the inefficient reasoning under the enclosing subgraph extraction issue and the lack of effective entity-independent feature modeling. To this end, we propose a novel Query Adaptive Anchor Representation (QAAR) model for inductive relation prediction. First, we extract one opening subgraph and perform reasoning by one time for all candidate triples, which is more efficient when the number of candidate triples is large. Second, we define some query adaptive anchors which are independent on any specific entity. Based on these anchors, we take advantage of the transferable entity-independent features (relation-aware, structure-aware and distance features) that can be used to produce entity embeddings for emerging unseen entities. Such entity-independent features is modeled by a query-aware graph attention network on the opening subgraph. Experimental results demonstrate that our proposed QAAR outperforms state-of-the-art baselines in inductive relation prediction task.",
  "keywords": [
    "end",
    "extraction",
    "inefficient",
    "efficient",
    "the inefficient reasoning",
    "we",
    "graph",
    "all entities",
    "training",
    "the entities",
    "it",
    "our proposed qaar",
    "knowledge graphs",
    "emerging entities",
    "kgs"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.882/",
  "provenance": {
    "collected_at": "2025-06-05 10:20:37",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}