{
  "id": "2023.acl-long.630",
  "title": "C}larify{D}elphi: Reinforced Clarification Questions with Defeasibility Rewards for Social and Moral Situations",
  "authors": [
    "Pyatkin, Valentina  and\nHwang, Jena D.  and\nSrikumar, Vivek  and\nLu, Ximing  and\nJiang, Liwei  and\nChoi, Yejin  and\nBhagavatula, Chandra"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Context is everything, even in commonsense moral reasoning. Changing contexts can flip the moral judgment of an action; Lying to a friend is wrong in general, but may be morally acceptable if it is intended to protect their life. We present ClarifyDelphi, an interactive system that learns to ask clarification questions (e.g., why did you lie to your friend?) in order to elicit additional salient contexts of a social or moral situation. We posit that questions whose potential answers lead todivergingmoral judgments are the most informative. Thus, we propose a reinforcement learning framework with a defeasibility reward that aims to maximize the divergence between moral judgments of hypothetical answers to a question. Human evaluation demonstrates that our system generates more relevant, informative and defeasible questions compared to competitive baselines. Our work is ultimately inspired by studies in cognitive science that have investigated the flexibility in moral cognition (i.e., the diverse contexts in which moral rules can be bent), and we hope that research in this direction can assist both cognitive and computational investigations of moral judgments.",
  "keywords": [
    "friend",
    "question",
    "we",
    "your friend",
    "it",
    "a question human evaluation",
    "science",
    "i",
    "action",
    "work",
    "e g",
    "general",
    "reinforcement",
    "a friend",
    "studies"
  ],
  "url": "https://aclanthology.org/2023.acl-long.630/",
  "provenance": {
    "collected_at": "2025-06-05 09:44:06",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}