{
  "id": "2023.acl-long.596",
  "title": "SW}i{PE}: A Dataset for Document-Level Simplification of {W}ikipedia Pages",
  "authors": [
    "Laban, Philippe  and\nVig, Jesse  and\nKryscinski, Wojciech  and\nJoty, Shafiq  and\nXiong, Caiming  and\nWu, Chien-Sheng"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Text simplification research has mostly focused on sentence-level simplification, even though many desirable edits - such as adding relevant background information or reordering content - may require document-level context. Prior work has also predominantly framed simplification as a single-step, input-to-output task, only implicitly modeling the fine-grained, span-level edits that elucidate the simplification process. To address both gaps, we introduce the SWiPE dataset, which reconstructs the document-level editing process from English Wikipedia (EW) articles to paired Simple Wikipedia (SEW) articles. In contrast to prior work, SWiPE leverages the entire revision history when pairing pages in order to better identify simplification edits. We work with Wikipedia editors to annotate 5,000 EW-SEW document pairs, labeling more than 40,000 edits with proposed 19 categories. To scale our efforts, we propose several models to automatically label edits, achieving an F-1 score of up to 70.9, indicating that this is a tractable but challenging NLU task. Finally, we categorize the edits produced by several simplification models and find that SWiPE-trained models generate more complex edits while reducing unwanted edits.",
  "keywords": [
    "we",
    "information",
    "i",
    "background",
    "categories",
    "text",
    "relevant background information",
    "work",
    "process",
    "proposed 19 categories",
    "reordering content",
    "wikipedia",
    "entire",
    "single",
    "models"
  ],
  "url": "https://aclanthology.org/2023.acl-long.596/",
  "provenance": {
    "collected_at": "2025-06-05 09:43:36",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}