{
  "id": "2023.acl-long.479",
  "title": "AV}-{T}ran{S}peech: Audio-Visual Robust Speech-to-Speech Translation",
  "authors": [
    "Huang, Rongjie  and\nLiu, Huadai  and\nCheng, Xize  and\nRen, Yi  and\nLi, Linjun  and\nYe, Zhenhui  and\nHe, Jinzheng  and\nZhang, Lichao  and\nLiu, Jinglin  and\nYin, Xiang  and\nZhao, Zhou"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Direct speech-to-speech translation (S2ST) aims to convert speech from one language into another, and has demonstrated significant progress to date. Despite the recent success, current S2ST models still suffer from distinct degradation in noisy environments and fail to translate visual speech (i.e., the movement of lips and teeth). In this work, we present AV-TranSpeech, the first audio-visual speech-to-speech (AV-S2ST) translation model without relying on intermediate text. AV-TranSpeech complements the audio stream with visual information to promote system robustness and opens up a host of practical applications: dictation or dubbing archival films. To mitigate the data scarcity with limited parallel AV-S2ST data, we 1) explore self-supervised pre-training with unlabeled audio-visual data to learn contextual representation, and 2) introduce cross-modal distillation with S2ST models trained on the audio-only corpus to further reduce the requirements of visual data. Experimental results on two language pairs demonstrate that AV-TranSpeech outperforms audio-only models under all settings regardless of the type of noise. With low-resource audio-visual data (10h, 30h), cross-modal distillation yields an improvement of 7.6 BLEU on average compared with baselines. Audio samples are available athttps://AV-TranSpeech.github.io/.",
  "keywords": [
    "bleu",
    "we",
    "current",
    "training",
    "translation",
    "cross",
    "self",
    "information",
    "visual",
    "i",
    "text",
    "7 6 bleu",
    "work",
    "language",
    "model"
  ],
  "url": "https://aclanthology.org/2023.acl-long.479/",
  "provenance": {
    "collected_at": "2025-06-05 09:41:55",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}