{
  "id": "2023.findings-acl.244",
  "title": "A Benchmark on Extremely Weakly Supervised Text Classification: Reconcile Seed Matching and Prompting Approaches",
  "authors": [
    "Wang, Zihan  and\nWang, Tianle  and\nMekala, Dheeraj  and\nShang, Jingbo"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Extremely Weakly Supervised Text Classification (XWS-TC) refers to text classification based on minimal high-level human guidance, such as a few label-indicative seed words or classification instructions. There are two mainstream approaches for XWS-TC, however, never being rigorously compared: (1) training classifiers based on pseudo-labels generated by (softly) matching seed words (Seed) and (2) prompting (and calibrating) language models using classification instruction (and raw texts) to decode label words (Prompt). This paper presents the first XWS-TC benchmark to compare the two approaches on fair grounds, where the datasets, supervisions, and hyperparameter choices are standardized across methods. Our benchmarking results suggest that (1) Both Seed and Prompt approaches are competitive and there is no clear winner; (2) Seed is empirically more tolerant than Prompt to human guidance (e.g., seed words, classification instructions, and label words) changes; (3) Seed is empirically more selective than Prompt to the pre-trained language models; (4) Recent Seed and Prompt methods have close connections and a clustering post-processing step based on raw in-domain texts is a strong performance booster to both. We hope this benchmark serves as a guideline in selecting XWS-TC methods in different scenarios and stimulate interest in developing guidance- and model-robust XWS-TC methods.",
  "keywords": [
    "winner",
    "1 training classifiers",
    "classifiers",
    "decode",
    "classification instructions",
    "prompt approaches",
    "tc",
    "we",
    "classification instruction",
    "training",
    "classification",
    "instruction",
    "processing",
    "prompt",
    "text"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.244/",
  "provenance": {
    "collected_at": "2025-06-05 09:56:38",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}