{
  "id": "2023.semeval-1.310",
  "title": "S}em{E}val-2023 Task 2: Fine-grained Multilingual Named Entity Recognition ({M}ulti{C}o{NER} 2)",
  "authors": [
    "Fetahu, Besnik  and\nKar, Sudipta  and\nChen, Zhiyu  and\nRokhlenko, Oleg  and\nMalmasi, Shervin"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "We present the findings of SemEval-2023 Task 2 on Fine-grained Multilingual Named Entity Recognition (MultiCoNER 2). Divided into 13 tracks, the task focused on methods to identify complex fine-grained named entities (like WRITTENWORK, VEHICLE, MUSICALGRP) across 12 languages, in both monolingual and multilingual scenarios, as well as noisy settings. The task used the MultiCoNER V2 dataset, composed of 2.2 million instances in Bangla, Chinese, English, Farsi, French, German, Hindi, Italian., Portuguese, Spanish, Swedish, and Ukrainian. MultiCoNER 2 was one of the most popular tasks of SemEval-2023. It attracted 842 submissions from 47 teams, and 34 teams submitted system papers. Results showed that complex entity types such as media titles and product names were the most challenging. Methods fusing external knowledge into transformer models achieved the best performance, and the largest gains were on the Creative Work and Group classes, which are still challenging even with external knowledge. Some fine-grained classes proved to be more challenging than others, such as SCIENTIST, ARTWORK, and PRIVATECORP. We also observed that noisy data has a significant impact on model performance, with an average drop of 10% on the noisy subset. The task highlights the need for future research on improving NER robustness on noisy data containing complex entities.",
  "keywords": [
    "em",
    "ner robustness",
    "multiconer",
    "we",
    "the multiconer v2 dataset",
    "scientist",
    "it",
    "scientist artwork",
    "ner",
    "transformer models",
    "complex entities",
    "drop",
    "work",
    "transformer",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.310/",
  "provenance": {
    "collected_at": "2025-06-05 10:30:53",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}