{
  "id": "2023.findings-acl.311",
  "title": "A Multi-modal Debiasing Model with Dynamical Constraint for Robust Visual Question Answering",
  "authors": [
    "Li, Yu  and\nHu, Bojie  and\nZhang, Fengshuo  and\nYu, Yahan  and\nLiu, Jian  and\nChen, Yufeng  and\nXu, Jinan"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Recent studies have pointed out that many well-developed Visual Question Answering (VQA) systems suffer from bias problem. Despite the remarkable performance gained on In-Distribution (ID) datasets, the VQA model might merely capture the superficial correlation from question to answer rather than showing real reasoning abilities. Therefore, when switching to Out-of-Distribution (OOD) dataset, whose test distribution is unknown or even reversed with the training set, significant drops might be demonstrated. Although efforts have been devoted to easing the negative bias effect brought by language prior and analysing its inherent cause, they are still limited by the following two aspects. First, most current debiasing methods achieve promising OOD generalization ability with a major sacrifice of the ID performance. Second, existing researches are restricted by exploiting comprehensive biases, since weakening the language bias is mainly focused, while only a few works consider vision bias. In this paper, we investigate a straightforward way to mitigate bias problem for VQA task. Specifically, we reduce bias effect by subtracting bias score from standard VQA base score. Based on such a direct strategy, we design two bias learning branches to detect more bias information, which are combined with a dynamical constraint loss to alleviate the problem of over-correction and insufficient debiasing effect. We evaluate our method on the challenging VQA v2.0 and VQA-CP V2,0 datasets and the proposed method achievessignificant improvement.",
  "keywords": [
    "bias",
    "two bias learning branches",
    "bias effect",
    "question",
    "we",
    "vision bias",
    "current",
    "promising ood generalization ability",
    "training",
    "standard vqa base score",
    "vqa systems",
    "vqa task",
    "the challenging vqa v2",
    "the negative bias effect",
    "achievessignificant"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.311/",
  "provenance": {
    "collected_at": "2025-06-05 09:57:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}