{
  "id": "2023.starsem-1.2",
  "title": "Leverage Points in Modality Shifts: Comparing Language-only and Multimodal Word Representations",
  "authors": [
    "Tikhonov, Alexey  and\nBylinina, Lisa  and\nPaperno, Denis"
  ],
  "year": "2023",
  "venue": "Proceedings of the 12th Joint Conference on Lexical and Computational Semantics (*SEM 2023)",
  "abstract": "Multimodal embeddings aim to enrich the semantic information in neural representations of language compared to text-only models. While different embeddings exhibit different applicability and performance on downstream tasks, little is known about the systematic representation differences attributed to the visual modality. Our paper compares word embeddings from three vision-and-language models (CLIP, OpenCLIP and Multilingual CLIP, Radford et al. 2021; Ilharco et al. 2021; Carlsson et al. 2022) and three text-only models, with static (FastText, Bojanowski et al. 2017) as well as contextual representations (multilingual BERT Devlin et al. 2018; XLM-RoBERTa, Conneau et al. 2019). This is the first large-scale study of the effect of visual grounding on language representations, including 46 semantic parameters. We identify meaning properties and relations that characterize words whose embeddings are most affected by the inclusion of visual modality in the training data; that is, points where visual grounding turns out most important. We find that the effect of visual modality correlates most with denotational semantic properties related to concreteness, but is also detected for several specific semantic classes, as well as for valence, a sentiment-related connotational property of linguistic expressions.",
  "keywords": [
    "whose embeddings",
    "roberta",
    "denotational semantic properties",
    "three vision-and-language models",
    "semantic",
    "we",
    "several specific semantic classes",
    "46 semantic parameters",
    "training",
    "static fasttext bojanowski",
    "neural",
    "the semantic information",
    "properties",
    "information",
    "word"
  ],
  "url": "https://aclanthology.org/2023.starsem-1.2/",
  "provenance": {
    "collected_at": "2025-06-05 10:31:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}