{
  "id": "2023.trustnlp-1.4",
  "title": "Pay Attention to the Robustness of {C}hinese Minority Language Models! Syllable-level Textual Adversarial Attack on {T}ibetan Script",
  "authors": [
    "Cao, Xi  and\nDawa, Dolma  and\nQun, Nuo  and\nNyima, Trashi"
  ],
  "year": "2023",
  "venue": "Proceedings of the 3rd Workshop on Trustworthy Natural Language Processing (TrustNLP 2023)",
  "abstract": "The textual adversarial attack refers to an attack method in which the attacker adds imperceptible perturbations to the original texts by elaborate design so that the NLP (natural language processing) model produces false judgments. This method is also used to evaluate the robustness of NLP models. Currently, most of the research in this field focuses on English, and there is also a certain amount of research on Chinese. However, to the best of our knowledge, there is little research targeting Chinese minority languages. Textual adversarial attacks are a new challenge for the information processing of Chinese minority languages. In response to this situation, we propose a Tibetan syllable-level black-box textual adversarial attack called TSAttacker based on syllable cosine distance and scoring mechanism. And then, we conduct TSAttacker on six models generated by fine-tuning two PLMs (pre-trained language models) for three downstream tasks. The experiment results show that TSAttacker is effective and generates high-quality adversarial samples. In addition, the robustness of the involved models still has much room for improvement.",
  "keywords": [
    "field",
    "we",
    "pre-trained language models",
    "natural",
    "information",
    "nlp models",
    "processing",
    "knowledge",
    "language",
    "nlp",
    "model",
    "this field",
    "attention",
    "pre",
    "an attack method"
  ],
  "url": "https://aclanthology.org/2023.trustnlp-1.4/",
  "provenance": {
    "collected_at": "2025-06-05 10:32:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}