{
  "id": "2023.semeval-1.195",
  "title": "UO}-{L}ou{TAL} at {S}em{E}val-2023 Task 6: Lightweight Systems for Legal Processing",
  "authors": [
    "Bosch, S{\\'e}bastien  and\nEst{\\`e}ve, Louis  and\nLoo, Joanne  and\nMinard, Anne-Lyse"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "This paper presents the work produced by students of the University of Orlans Masters in Natural Language Processing program by way of participating in SemEval Task 6, LegalEval, which aims to enhance the capabilities of legal professionals through automated systems. Two out of the three sub-tasks available – Rhetorical Role prediction (RR) and Legal Named Entity Recognition (L-NER) – were tackled, with the express intent of developing lightweight and interpretable systems. For the L-NER sub-task, a CRF model was trained, augmented with post-processing rules for some named entity types. A macro F1 score of 0.74 was obtained on the DEV set, and 0.64 on the evaluation set. As for the RR sub-task, two sentence classification systems were built: one based on the Bag-of-Words technique with L-NER system output integrated, the other using a sentence-transformer approach. Rule-based post-processing then converted the results of the sentence classification systems into RR predictions. The better-performing Bag-of-Words system obtained a macro F1 score of 0.49 on the DEV set and 0.57 on the evaluation set.",
  "keywords": [
    "two sentence classification systems",
    "the evaluation set",
    "l-ner system output",
    "classification",
    "bag",
    "natural language processing program",
    "natural",
    "the capabilities",
    "the sentence classification systems",
    "a macro f1 score",
    "ner",
    "processing",
    "the l-ner sub",
    "-",
    "work"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.195/",
  "provenance": {
    "collected_at": "2025-06-05 10:29:17",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}