{
  "id": "2023.findings-acl.335",
  "title": "ECOLA}: Enhancing Temporal Knowledge Embeddings with Contextualized Language Representations",
  "authors": [
    "Han, Zhen  and\nLiao, Ruotong  and\nGu, Jindong  and\nZhang, Yao  and\nDing, Zifeng  and\nGu, Yujia  and\nKoeppl, Heinz  and\nSch{\\\"u}tze, Hinrich  and\nTresp, Volker"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Since conventional knowledge embedding models cannot take full advantage of the abundant textual information, there have been extensive research efforts in enhancing knowledge embedding using texts. However, existing enhancement approaches cannot apply totemporal knowledge graphs(tKGs), which contain time-dependent event knowledge with complex temporal dynamics. Specifically, existing enhancement approaches often assume knowledge embedding is time-independent. In contrast, the entity embedding in tKG models usually evolves, which poses the challenge of aligningtemporally relevanttexts with entities. To this end, we propose to study enhancing temporal knowledge embedding with textual data in this paper. As an approach to this task, we propose Enhanced Temporal Knowledge Embeddings with Contextualized Language Representations (ECOLA), which takes the temporal aspect into account and injects textual information into temporal knowledge embedding. To evaluate ECOLA, we introduce three new datasets for training and evaluating ECOLA. Extensive experiments show that ECOLA significantly enhances temporal KG embedding models with up to 287% relative improvements regarding Hits@1 on the link prediction task. The code and models are publicly available onhttps://github.com/mayhugotong/ECOLA.",
  "keywords": [
    "code",
    "end",
    "we",
    "tkg models",
    "training",
    "conventional knowledge embedding models",
    "information",
    "enhanced temporal knowledge embeddings",
    "temporal kg embedding models",
    "temporal knowledge embeddings",
    "embeddings",
    "knowledge",
    "language",
    "entities",
    "totemporal knowledge graphs"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.335/",
  "provenance": {
    "collected_at": "2025-06-05 09:57:57",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}