{
  "id": "2023.acl-long.505",
  "title": "NLP}ositionality: Characterizing Design Biases of Datasets and Models",
  "authors": [
    "Santy, Sebastin  and\nLiang, Jenny  and\nLe Bras, Ronan  and\nReinecke, Katharina  and\nSap, Maarten"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Design biases in NLP systems, such as performance differences for different populations, often stem from their creator’s positionality, i.e., views and lived experiences shaped by identity and background. Despite the prevalence and risks of design biases, they are hard to quantify because researcher, system, and dataset positionality is often unobserved. We introduce NLPositionality, a framework for characterizing design biases and quantifying the positionality of NLP datasets and models. Our framework continuously collects annotations from a diverse pool of volunteer participants on LabintheWild, and statistically quantifies alignment with dataset labels and model predictions. We apply NLPositionality to existing datasets and models for two tasks—social acceptability and hate speech detection. To date, we have collected 16,299 annotations in over a year for 600 instances from 1,096 annotators across 87 countries. We find that datasets and models align predominantly with Western, White, college-educated, and younger populations. Additionally, certain groups, such as non-binary people and non-native English speakers, are further marginalized by datasets and models as they rank least in alignment across all tasks. Finally, we draw from prior literature to discuss how researchers can examine their own positionality and that of their datasets and models, opening the door for more inclusive NLP systems.",
  "keywords": [
    "lived experiences",
    "design biases",
    "we",
    "i e views",
    "nlp datasets",
    "nlpositionality",
    "nlp ositionality",
    "views",
    "labinthewild and statistically quantifies",
    "quantifies",
    "background",
    "biases",
    "87 countries",
    "countries",
    "alignment"
  ],
  "url": "https://aclanthology.org/2023.acl-long.505/",
  "provenance": {
    "collected_at": "2025-06-05 09:42:16",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}