{
  "id": "2023.dialdoc-1.2",
  "title": "M}o{QA}: Benchmarking Multi-Type Open-Domain Question Answering",
  "authors": [
    "Yen, Howard  and\nGao, Tianyu  and\nLee, Jinhyuk  and\nChen, Danqi"
  ],
  "year": "2023",
  "venue": "Proceedings of the Third DialDoc Workshop on Document-grounded Dialogue and Conversational Question Answering",
  "abstract": "Previous research on open-domain question answering (QA) mainly focuses on questions with short answers. However, information-seeking QA often requires various formats of answers depending on the nature of the questions, e.g., why/how questions typically require a long answer. In this paper, we present MoQA, a benchmark for open-domain QA that requires building one system that can provide short, medium, long, and yes/no answers to different questions accordingly. MoQA builds upon Natural Questions with multiple types of questions and additional crowdsourcing efforts to ensure high query quality. We adapt state-of-the-art models, and reveal unique findings in multi-type open-domain QA: (1) For retriever-reader models, training one retriever on all types achieves the overall best performance, but it is challenging to train one reader model to output answers of different formats, or to train a question classifier to distinguish between types; (2) An end-to-end closed-book QA model trained on multiple types struggles with the task across the board; (3) State-of-the-art large language models such as the largest GPT-3 models (Brown et al., 2020; Ouyang et al., 2022) also lag behind open-book QA models. Our benchmark and analysis call for more effort into building versatile open-domain QA models in the future.",
  "keywords": [
    "end",
    "classifier",
    "versatile open-domain qa models",
    "question",
    "we",
    "multi-type open-domain qa",
    "answer",
    "natural",
    "it",
    "gpt-3",
    "information",
    "open-domain qa",
    "retriever-reader models",
    "analysis",
    "the largest gpt-3 models"
  ],
  "url": "https://aclanthology.org/2023.dialdoc-1.2/",
  "provenance": {
    "collected_at": "2025-06-05 10:24:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}