{
  "id": "2023.findings-acl.30",
  "title": "Generating Deep Questions with Commonsense Reasoning Ability from the Text by Disentangled Adversarial Inference",
  "authors": [
    "Yu, Jianxing  and\nWang, Shiqi  and\nZheng, Libin  and\nSu, Qinliang  and\nLiu, Wei  and\nZhao, Baoquan  and\nYin, Jian"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "This paper proposes a new task of commonsense question generation, which aims to yield deep-level and to-the-point questions from the text. Their answers need to reason over disjoint relevant contexts and external commonsense knowledge, such as encyclopedic facts and causality. The knowledge may not be explicitly mentioned in the text but is used by most humans for problem-shooting. Such complex reasoning with hidden contexts involves deep semantic understanding. Thus, this task has great application value, such as making high-quality quizzes in advanced exams. Due to the lack of modeling complexity, existing methods may produce shallow questions that can be answered by simple word matching. To address these challenges, we propose a new QG model by simultaneously considering asking contents, expressive ways, and answering complexity. We first retrieve text-related commonsense context. Then we disentangle the key factors that control questions in terms of reasoning content and verbalized way. Independence priors and constraints are imposed to facilitate disentanglement. We further develop a discriminator to promote the deep results by considering their answering complexity. Through adversarial inference, we learn the latent factors from data. By sampling the expressive factor from the data distributions, diverse questions can be yielded. Evaluations of two typical data sets show the effectiveness of our approach.",
  "keywords": [
    "deep",
    "question",
    "semantic",
    "we",
    "deep semantic understanding",
    "latent",
    "word",
    "text",
    "commonsense question generation",
    "knowledge",
    "generation",
    "model",
    "evaluations",
    "modeling",
    "great"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.30/",
  "provenance": {
    "collected_at": "2025-06-05 09:53:37",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}