{
  "id": "2023.acl-long.281",
  "title": "Unsupervised Graph-Text Mutual Conversion with a Unified Pretrained Language Model",
  "authors": [
    "Xu, Yi  and\nSheng, Shuqian  and\nQi, Jiexing  and\nFu, Luoyi  and\nLin, Zhouhan  and\nWang, Xinbing  and\nZhou, Chenghu"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Graph-to-text (G2T) generation and text-to-graph (T2G) triple extraction are two essential tasks for knowledge graphs. Existing unsupervised approaches become suitable candidates for jointly learning the two tasks due to their avoidance of using graph-text parallel data. However, they adopt multiple complex modules and still require entity information or relation type for training. To this end, we propose INFINITY, a simple yet effective unsupervised method with a unified pretrained language model that does not introduce external annotation tools or additional parallel information. It achieves fully unsupervised graph-text mutual conversion for the first time. Specifically, INFINITY treats both G2T and T2G as a bidirectional sequence generation task by fine-tuning only one pretrained seq2seq model. A novel back-translation-based framework is then designed to generate synthetic parallel data automatically. Besides, we investigate the impact of graph linearization and introduce the structure-aware fine-tuning strategy to alleviate possible performance deterioration via retaining structural information in graph sequences. As a fully unsupervised framework, INFINITY is empirically verified to outperform state-of-the-art baselines for G2T and T2G tasks. Additionally, we also devise a new training setting called cross learning for low-resource unsupervised information extraction.",
  "keywords": [
    "end",
    "extraction",
    "we",
    "graph",
    "training",
    "translation",
    "cross",
    "it",
    "unified",
    "information",
    "knowledge graphs",
    "low-resource unsupervised information extraction",
    "sequence",
    "learning",
    "seq2seq"
  ],
  "url": "https://aclanthology.org/2023.acl-long.281/",
  "provenance": {
    "collected_at": "2025-06-05 09:39:14",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}