{
  "id": "2023.acl-long.775",
  "title": "Dialogue Summarization with Static-Dynamic Structure Fusion Graph",
  "authors": [
    "Gao, Shen  and\nCheng, Xin  and\nLi, Mingzhe  and\nChen, Xiuying  and\nLi, Jinpeng  and\nZhao, Dongyan  and\nYan, Rui"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Dialogue, the most fundamental and specially privileged arena of language, gains increasing ubiquity across the Web in recent years. Quickly going through the long dialogue context and capturing salient information scattered over the whole dialogue session benefit users in many real-world Web applications such as email thread summarization and meeting minutes draft. Dialogue summarization is a challenging task in that dialogue has dynamic interaction nature and presumably inconsistent information flow among various speakers. Many researchers address this task by modeling dialogue with pre-computed static graph structure using external linguistic toolkits. However, such methods heavily depend on the reliability of external tools and the static graph construction is disjoint with the graph representation learning phase, which makes the graph can’t be dynamically adapted for the downstream summarization task. In this paper, we propose a Static-Dynamic graph-based Dialogue Summarization model (SDDS), which fuses prior knowledge from human expertise and adaptively learns the graph structure in an end-to-end learning fashion. To verify the effectiveness of SDDS, we conduct experiments on three benchmark datasets (SAMSum, MediaSum, and DialogSum) and the results verify the superiority of SDDS.",
  "keywords": [
    "t",
    "end",
    "summarization",
    "email thread summarization",
    "we",
    "dialogue",
    "graph",
    "fusion",
    "salient information",
    "modeling dialogue",
    "that dialogue",
    "information",
    "learning",
    "draft dialogue summarization",
    "the long dialogue context"
  ],
  "url": "https://aclanthology.org/2023.acl-long.775/",
  "provenance": {
    "collected_at": "2025-06-05 09:46:12",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}