{
  "id": "2023.findings-acl.126",
  "title": "Rethinking the Word-level Quality Estimation for Machine Translation from Human Judgement",
  "authors": [
    "Yang, Zhen  and\nMeng, Fandong  and\nYan, Yuanmeng  and\nZhou, Jie"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Word-level Quality Estimation (QE) of Machine Translation (MT) aims to detect potential translation errors in the translated sentence without reference. Typically, conventional works on word-level QE are usually designed to predict the quality of translated words in terms of the post-editing effort, where the word labels in the dataset, i.e., OK or BAD, are automatically generated by comparing words between MT sentences and the post-edited sentences through a Translation Error Rate (TER) toolkit. While the post-editing effort can be used to measure the translation quality to some extent, we find it usually conflicts with human judgment on whether the word is well or poorly translated. To investigate this conflict, we first create a golden benchmark dataset, namelyHJQE(Human Judgement on Quality Estimation), where the source and MT sentences are identical to the original TER-based dataset and the expert translators directly annotate the poorly translated words on their judgments. Based on our analysis, we further propose two tag-correcting strategies which can make the TER-based artificial QE corpus closer toHJQE. We conduct substantial experiments based on the publicly available WMT En-De and En-Zh corpora. The results not only show our proposed dataset is more consistent with human judgment but also confirm the effectiveness of the proposed tag-correcting strategies.For reviewers, the corpora and codes can be found in the attached files.",
  "keywords": [
    "potential translation errors",
    "rate",
    "the proposed tag-correcting strategies",
    "machine translation",
    "we",
    "translation",
    "it",
    "tag",
    "ter",
    "word",
    "analysis",
    "i",
    "strategies",
    "two tag-correcting strategies",
    "reviewers"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.126/",
  "provenance": {
    "collected_at": "2025-06-05 09:54:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}