{
  "id": "2023.acl-long.296",
  "title": "Hybrid Knowledge Transfer for Improved Cross-Lingual Event Detection via Hierarchical Sample Selection",
  "authors": [
    "Guzman Nateras, Luis  and\nDernoncourt, Franck  and\nNguyen, Thien"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "In this paper, we address the Event Detection task under a zero-shot cross-lingual setting where a model is trained on a source language but evaluated on a distinct target language for which there is no labeled data available. Most recent efforts in this field follow a direct transfer approach in which the model is trained using language-invariant features and then directly applied to the target language. However, we argue that these methods fail to take advantage of the benefits of the data transfer approach where a cross-lingual model is trained on target-language data and is able to learn task-specific information from syntactical features or word-label relations in the target language. As such, we propose a hybrid knowledge-transfer approach that leverages a teacher-student framework where the teacher and student networks are trained following the direct and data transfer approaches, respectively. Our method is complemented by a hierarchical training-sample selection scheme designed to address the issue of noisy labels being generated by the teacher model. Our model achieves state-of-the-art results on 9 morphologically-diverse target languages across 3 distinct datasets, highlighting the importance of exploiting the benefits of hybrid transfer.",
  "keywords": [
    "field",
    "we",
    "shot",
    "training",
    "cross",
    "information",
    "word",
    "transfer",
    "hierarchical",
    "knowledge",
    "language",
    "model",
    "this field",
    "hierarchical sample selection",
    "a zero-shot cross-lingual setting"
  ],
  "url": "https://aclanthology.org/2023.acl-long.296/",
  "provenance": {
    "collected_at": "2025-06-05 09:39:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}