{
  "id": "2023.semeval-1.265",
  "title": "CAIR}-{NLP} at {S}em{E}val-2023 Task 2: A Multi-Objective Joint Learning System for Named Entity Recognition",
  "authors": [
    "N, Sangeeth  and\nPaul, Biswajit  and\nChaudhary, Chandramani"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "This paper describes the NER system designed by the CAIR-NLP team for submission to Multilingual Complex Named Entity Recognition (MultiCoNER II) shared task, which presents a novel challenge of recognizing complex, ambiguous, and fine-grained entities in low-context, multi-lingual, multi-domain dataset and evaluation on the noisy subset. We propose a Multi-Objective Joint Learning System (MOJLS) for NER, which aims to enhance the representation of entities and improve label predictions through the joint implementation of a set of learning objectives. Our official submission MOJLS implements four objectives. These include the representation of the named entities should be close to its entity type definition, low-context inputs should have representation close to their augmented context, and also minimization of two label prediction errors, one based on CRF and another biaffine-based predictions, where both are producing similar output label distributions. The official results ranked our system 2nd in five tracks (Multilingual, Spanish, Swedish, Ukrainian, and Farsi) and 3 rd in three (French, Italian, and Portuguese) out of 13 tracks. Also evaluation of the noisy subset, our model achieved relatively better ranks. Official results indicate the effectiveness of the proposed MOJLS in dealing with the contemporary challenges of NER.",
  "keywords": [
    "also evaluation",
    "objectives",
    "the ner system",
    "four objectives",
    "- nlp",
    "multiconer",
    "we",
    "learning",
    "the named entities",
    "ner",
    "named entity recognition",
    "objective",
    "the cair-nlp team",
    "nlp",
    "model"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.265/",
  "provenance": {
    "collected_at": "2025-06-05 10:30:16",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}