{
  "id": "2023.findings-acl.621",
  "title": "Semantic-conditioned Dual Adaptation for Cross-domain Query-based Visual Segmentation",
  "authors": [
    "Wang, Ye  and\nJin, Tao  and\nLin, Wang  and\nCheng, Xize  and\nLi, Linjun  and\nZhao, Zhou"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Visual segmentation from language queries has attracted significant research interest. Despite the effectiveness, existing works require expensive labeling and suffer severe degradation when deployed to an unseen domain. In this paper, we investigate a novel task Cross-domain Query-based Visual Segmentation (CQVS), aiming to adapt the segmentation model from a labeled domain to a new unlabeled domain. The challenges of CQVS stem from three domain discrepancies: (1) multi-modal content shift, (2) uni-modal feature gap and (3) cross-modal relation bias. Existing domain adaptation methods fail to address them comprehensively and precisely (e.g. at pixel level), thus being suboptimal for CQVS. To overcome this limitation, we propose Semantic-conditioned Dual Adaptation (SDA), a novel framework to achieve precise feature- and relation-invariant across domains via a universal semantic structure. The SDA consists of two key components: Content-aware Semantic Modeling (CSM) and Dual Adaptive Branches (DAB). First, CSM introduces a common semantic space across domains to provide uniform guidance. Then, DAB seamlessly leverages this semantic information to develop a contrastive feature branch for category-wise pixel alignment, and design a reciprocal relation branch for relation enhancement via two complementary masks. Extensive experiments on three video benchmarks and three image benchmarks evidence the superiority of our approach over the state-of-the-arts.",
  "keywords": [
    "bias",
    "uni",
    "semantic",
    "we",
    "cross",
    "queries",
    "information",
    "discrepancies",
    "three domain discrepancies",
    "language queries",
    "visual",
    "semantic-conditioned dual adaptation",
    "this semantic information",
    "alignment",
    "language"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.621/",
  "provenance": {
    "collected_at": "2025-06-05 10:17:04",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}