{
  "id": "2023.acl-long.891",
  "title": "Crosslingual Generalization through Multitask Finetuning",
  "authors": [
    "Muennighoff, Niklas  and\nWang, Thomas  and\nSutawika, Lintang  and\nRoberts, Adam  and\nBiderman, Stella  and\nLe Scao, Teven  and\nBari, M Saiful  and\nShen, Sheng  and\nYong, Zheng Xin  and\nSchoelkopf, Hailey  and\nTang, Xiangru  and\nRadev, Dragomir  and\nAji, Alham Fikri  and\nAlmubarak, Khalid  and\nAlbanie, Samuel  and\nAlyafeai, Zaid  and\nWebson, Albert  and\nRaff, Edward  and\nRaffel, Colin"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Multitask prompted finetuning (MTF) has been shown to help large language models generalize to new tasks in a zero-shot setting, but so far explorations of MTF have focused on English data and models. We apply MTF to the pretrained multilingual BLOOM and mT5 model families to produce finetuned variants called BLOOMZ and mT0. We find finetuning large multilingual language models on English tasks with English prompts allows for task genrealization to non-English languages that appear only in the pretraining corpus. Finetuning on multilingual tasks with English prompts further improves performance on English and non-English tasks leading to various state-of-the-art zero-shot results. We also investigate finetuning on multilingual tasks with prompts that have been machine-translated from English to match the language of each dataset. We find training on these machine-translated prompts leads to better performance on human-written prompts in the respective languages. Surprisingly, we find models are capable of zero-shot generalization to tasks in languages they have never intentionally seen. We conjecture that the models are learning higher-level capabilities that are both task- and language-agnostic. In addition, we introduce xP3, a composite of supervised datasets in 46 languages with English and machine-translated prompts. Our code, datasets and models are freely available athttps://github.com/bigscience-workshop/xmtf.",
  "keywords": [
    "code",
    "families",
    "zero-shot generalization",
    "we",
    "shot",
    "training",
    "crosslingual generalization",
    "human-written prompts",
    "english prompts",
    "english and machine-translated prompts",
    "generalization",
    "prompts",
    "these machine-translated prompts",
    "higher-level capabilities",
    "language"
  ],
  "url": "https://aclanthology.org/2023.acl-long.891/",
  "provenance": {
    "collected_at": "2025-06-05 09:47:54",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}