{
  "id": "2023.bea-1.44",
  "title": "The {NCTE} Transcripts: A Dataset of Elementary Math Classroom Transcripts",
  "authors": [
    "Demszky, Dorottya  and\nHill, Heather"
  ],
  "year": "2023",
  "venue": "Proceedings of the 18th Workshop on Innovative Use of NLP for Building Educational Applications (BEA 2023)",
  "abstract": "Classroom discourse is a core medium of instruction analyzing it can provide a window into teaching and learning as well as driving the development of new tools for improving instruction. We introduce the largest dataset of mathematics classroom transcripts available to researchers, and demonstrate how this data can help improve instruction. The dataset consists of 1,660 45-60 minute long 4th and 5th grade elementary mathematics observations collected by the National Center for Teacher Effectiveness (NCTE) between 2010-2013. The anonymized transcripts represent data from 317 teachers across 4 school districts that serve largely historically marginalized students. The transcripts come with rich metadata, including turn-level annotations for dialogic discourse moves, classroom observation scores, demographic information, survey responses and student test scores. We demonstrate that our natural language processing model, trained on our turn-level annotations, can learn to identify dialogic discourse moves and these moves are correlated with better classroom observation scores and learning outcomes. This dataset opens up several possibilities for researchers, educators and policymakers to learn about and improve K-12 instruction. The dataset can be found athttps://github.com/ddemszky/classroom-transcript-analysis.",
  "keywords": [
    "we",
    "instruction",
    "natural",
    "it",
    "information",
    "rich",
    "learning",
    "core",
    "analysis",
    "processing",
    "possibilities",
    "language",
    "model",
    "several possibilities",
    "minute"
  ],
  "url": "https://aclanthology.org/2023.bea-1.44/",
  "provenance": {
    "collected_at": "2025-06-05 10:21:50",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}