{
  "id": "2023.starsem-1.41",
  "title": "Probing neural language models for understanding of words of estimative probability",
  "authors": [
    "Sileo, Damien  and\nMoens, Marie-francine"
  ],
  "year": "2023",
  "venue": "Proceedings of the 12th Joint Conference on Lexical and Computational Semantics (*SEM 2023)",
  "abstract": "Words of Estimative Probability (WEP) are phrases used to express the plausibility of a statement. Examples include terms like \\textit{probably, maybe, likely, doubt, unlikely}, and \\textit{impossible}. Surveys have shown that human evaluators tend to agree when assigning numerical probability levels to these WEPs. For instance, the term \\textit{highly likely} equates to a median probability of $0.90{\\pm}0.08$ according to a survey by \\citet{fagen-ulmschneider}.In this study, our focus is to gauge the competency of neural language processing models in accurately capturing the consensual probability level associated with each WEP. Our first approach is utilizing the UNLI dataset \\cite{chen-etal-2020-uncertain}, which links premises and hypotheses with their perceived joint probability $p$. From this, we craft prompts in the form: \"[\\textsc{Premise}]. [\\textsc{Wep}], [\\textsc{Hypothesis}].” This allows us to evaluate whether language models can predict if the consensual probability level of a WEP aligns closely with $p$.In our second approach, we develop a dataset based on WEP-focused probabilistic reasoning to assess if language models can logically process WEP compositions. For example, given the prompt \"[\\textsc{EventA}] \\textit{is likely}. [\\textsc{EventB}] \\textit{is impossible}.”, a well-functioning language model should not conclude that [\\textsc{EventA$\\&amp;$B}] is likely. Through our study, we observe that both tasks present challenges to out-of-the-box English language models. However, we also demonstrate that fine-tuning these models can lead to significant and transferable improvements.",
  "keywords": [
    "form",
    "we",
    "neural language models",
    "neural",
    "processing",
    "prompt",
    "language models",
    "-",
    "fine",
    "a well-functioning language model",
    "prompts",
    "p",
    "language",
    "model",
    "human"
  ],
  "url": "https://aclanthology.org/2023.starsem-1.41/",
  "provenance": {
    "collected_at": "2025-06-05 10:32:06",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}