{
  "id": "2023.codi-1.20",
  "title": "Two-step Text Summarization for Long-form Biographical Narrative Genre",
  "authors": [
    "Bleiweiss, Avi"
  ],
  "year": "2023",
  "venue": "Proceedings of the 4th Workshop on Computational Approaches to Discourse (CODI 2023)",
  "abstract": "Transforming narrative structure to implicit discourse relations in long-form text has recently seen a mindset shift toward assessing generation consistency. To this extent, summarization of lengthy biographical discourse is of practical benefit to readers, as it helps them decide whether immersing for days or weeks in a bulky book turns a rewarding experience. Machine-generated summaries can reduce the cognitive load and the time spent by authors to write the summary. Nevertheless, summarization faces significant challenges of factual inconsistencies with respect to the inputs. In this paper, we explored a two-step summary generation aimed to retain source-summary faithfulness. Our method uses a graph representation to rank sentence saliency in each of the novel chapters, leading to distributing summary segments in distinct regions of the chapter. Basing on the previously extracted sentences we produced an abstractive summary in a manner more computationally tractable for detecting inconsistent information. We conducted a series of quantitative analyses on a test set of four long biographical novels and showed to improve summarization quality in automatic evaluation over both single-tier settings and external baselines.",
  "keywords": [
    "this extent summarization",
    "series",
    "tier",
    "form",
    "summarization",
    "we",
    "a two-step summary generation",
    "nevertheless summarization",
    "graph",
    "factual inconsistencies",
    "it",
    "information",
    "automatic evaluation",
    "two-step text summarization",
    "manner"
  ],
  "url": "https://aclanthology.org/2023.codi-1.20/",
  "provenance": {
    "collected_at": "2025-06-05 10:24:17",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}