{
  "id": "2023.acl-long.442",
  "title": "Generating Visual Spatial Description via Holistic 3{D} Scene Understanding",
  "authors": [
    "Zhao, Yu  and\nFei, Hao  and\nJi, Wei  and\nWei, Jianguo  and\nZhang, Meishan  and\nZhang, Min  and\nChua, Tat-Seng"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Visual spatial description (VSD) aims to generate texts that describe the spatial relations of the given objects within images. Existing VSD work merely models the 2D geometrical vision features, thus inevitably falling prey to the problem of skewed spatial understanding of target objects. In this work, we investigate the incorporation of 3D scene features for VSD. With an external 3D scene extractor, we obtain the 3D objects and scene features for input images, based on which we construct a target object-centered 3D spatial scene graph (Go3D-S2G), such that we model the spatial semantics of target objects within the holistic 3D scenes. Besides, we propose a scene subgraph selecting mechanism, sampling topologically-diverse subgraphs from Go3D-S2G, where the diverse local structure features are navigated to yield spatially-diversified text generation. Experimental results on two VSD datasets demonstrate that our framework outperforms the baselines significantly, especially improving on the cases with complex visual spatial relations. Meanwhile, our method can produce more spatially-diversified generation.",
  "keywords": [
    "work",
    "object",
    "generation",
    "semantics",
    "text",
    "the spatial semantics",
    "we",
    "visual",
    "graph",
    "more spatially-diversified generation",
    "that",
    "this work",
    "go3d-s2g",
    "scene features",
    "baselines"
  ],
  "url": "https://aclanthology.org/2023.acl-long.442/",
  "provenance": {
    "collected_at": "2025-06-05 09:41:24",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}