{
  "id": "2023.acl-long.174",
  "title": "CORE}: Cooperative Training of Retriever-Reranker for Effective Dialogue Response Selection",
  "authors": [
    "Tao, Chongyang  and\nFeng, Jiazhan  and\nShen, Tao  and\nLiu, Chang  and\nLi, Juntao  and\nGeng, Xiubo  and\nJiang, Daxin"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Establishing retrieval-based dialogue systems that can select appropriate responses from the pre-built index has gained increasing attention. Recent common practice is to construct a two-stage pipeline with a fast retriever (e.g., bi-encoder) for first-stage recall followed by a smart response reranker (e.g., cross-encoder) for precise ranking. However, existing studies either optimize the retriever and reranker in independent ways, or distill the knowledge from a pre-trained reranker into the retriever in an asynchronous way, leading to sub-optimal performance of both modules. Thus, an open question remains about how to train them for a better combination of the best of both worlds. To this end, we present a cooperative training of the response retriever and the reranker whose parameters are dynamically optimized by the ground-truth labels as well as list-wise supervision signals from each other. As a result, the two modules can learn from each other and evolve together throughout the training. Experimental results on two benchmarks demonstrate the superiority of our method.",
  "keywords": [
    "end",
    "question",
    "we",
    "dialogue",
    "training",
    "cross",
    "increasing attention",
    "retrieval",
    "effective dialogue response selection",
    "retrieval-based dialogue systems",
    "core",
    "however existing studies",
    "the retriever",
    "-",
    "first-stage recall"
  ],
  "url": "https://aclanthology.org/2023.acl-long.174/",
  "provenance": {
    "collected_at": "2025-06-05 09:37:45",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}