{
  "id": "2023.findings-acl.571",
  "title": "Zero-Shot Classification by Logical Reasoning on Natural Language Explanations",
  "authors": [
    "Han, Chi  and\nPei, Hengzhi  and\nDu, Xinya  and\nJi, Heng"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Humans can classify data of an unseen category by reasoning on its language explanations. This ability is owing to the compositional nature of language: we can combine previously seen attributes to describe the new category. For example, we might describe a sage thrasher as “it has a slim straight relatively short bill, yellow eyes and a long tail”, so that others can use their knowledge of attributes “slim straight relatively short bill”, “yellow eyes” and “long tail” to recognize a sage thrasher. Inspired by this observation, in this work we tackle zero-shot classification task by logically parsing and reasoning on natural language explanations. To this end, we propose the framework CLORE (Classification by LOgical Reasoning on Explanations). While previous methods usually regard textual information as implicit features, CLORE parses explanations into logical structures and then explicitly reasons along this structure on the input to produce a classification score. Experimental results on explanation-based zero-shot classification benchmarks demonstrate that CLORE is superior to baselines, which we show is mainly due to higher scores on tasks requiring more logical reasoning. We also demonstrate that our framework can be extended to zero-shot classification on visual modality. Alongside classification decisions, CLORE can provide the logical parsing and reasoning process as a clear form of rationale. Through empirical analysis we demonstrate that CLORE is also less affected by linguistic biases than baselines.",
  "keywords": [
    "parsing",
    "end",
    "form",
    "we",
    "zero-shot classification task",
    "zero-shot classification",
    "shot",
    "linguistic biases",
    "classification",
    "natural",
    "it",
    "information",
    "visual",
    "analysis",
    "classification decisions"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.571/",
  "provenance": {
    "collected_at": "2025-06-05 10:16:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}