{
  "id": "2023.acl-long.225",
  "title": "Knowledge-enhanced Mixed-initiative Dialogue System for Emotional Support Conversations",
  "authors": [
    "Deng, Yang  and\nZhang, Wenxuan  and\nYuan, Yifei  and\nLam, Wai"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Unlike empathetic dialogues, the system in emotional support conversations (ESC) is expected to not only convey empathy for comforting the help-seeker, but also proactively assist in exploring and addressing their problems during the conversation. In this work, we study the problem of mixed-initiative ESC where the user and system can both take the initiative in leading the conversation. Specifically, we conduct a novel analysis on mixed-initiative ESC systems with a tailor-designed schema that divides utterances into different types with speaker roles and initiative types. Four emotional support metrics are proposed to evaluate the mixed-initiative interactions. The analysis reveals the necessity and challenges of building mixed-initiative ESC systems. In the light of this, we propose a knowledge-enhanced mixed-initiative framework (KEMI) for ESC, which retrieves actual case knowledge from a large-scale mental health knowledge graph for generating mixed-initiative responses. Experimental results on two ESC datasets show the superiority of KEMI in both content-preserving evaluation and mixed initiative related analyses.",
  "keywords": [
    "support",
    "conversations",
    "we",
    "dialogue",
    "graph",
    "emotional support conversations esc",
    "emotional support conversations",
    "the conversation",
    "analysis",
    "four emotional support metrics",
    "metrics",
    "knowledge-enhanced mixed-initiative dialogue system",
    "empathetic dialogues",
    "work",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2023.acl-long.225/",
  "provenance": {
    "collected_at": "2025-06-05 09:38:28",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}