{
  "id": "2023.wassa-1.21",
  "title": "Context-Dependent Embedding Utterance Representations for Emotion Recognition in Conversations",
  "authors": [
    "Pereira, Patr{\\'i}cia  and\nMoniz, Helena  and\nDias, Isabel  and\nCarvalho, Joao Paulo"
  ],
  "year": "2023",
  "venue": "Proceedings of the 13th Workshop on Computational Approaches to Subjectivity, Sentiment, {\\&} Social Media Analysis",
  "abstract": "Emotion Recognition in Conversations (ERC) has been gaining increasing importance as conversational agents become more and more common. Recognizing emotions is key for effective communication, being a crucial component in the development of effective and empathetic conversational agents. Knowledge and understanding of the conversational context are extremely valuable for identifying the emotions of the interlocutor. We thus approach Emotion Recognition in Conversations leveraging the conversational context, i.e., taking into attention previous conversational turns. The usual approach to model the conversational context has been to produce context-independent representations of each utterance and subsequently perform contextual modeling of these. Here we propose context-dependent embedding representations of each utterance by leveraging the contextual representational power of pre-trained transformer language models. In our approach, we feed the conversational context appended to the utterance to be classified as input to the RoBERTa encoder, to which we append a simple classification module, thus discarding the need to deal with context after obtaining the embeddings since these constitute already an efficient representation of such context. We also investigate how the number of introduced conversational turns influences our model performance. The effectiveness of our approach is validated on the open-domain DailyDialog dataset and on the task-oriented EmoWOZ dataset.",
  "keywords": [
    "roberta",
    "pre-trained transformer language models",
    "efficient",
    "the task-oriented emowoz dataset",
    "conversations",
    "we",
    "a simple classification module",
    "classification",
    "context-dependent embedding utterance representations",
    "the conversational context",
    "the embeddings",
    "i",
    "the roberta encoder",
    "conversations erc",
    "embeddings"
  ],
  "url": "https://aclanthology.org/2023.wassa-1.21/",
  "provenance": {
    "collected_at": "2025-06-05 10:33:13",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}