{
  "id": "2023.acl-long.255",
  "title": "Exploring the Capacity of Pretrained Language Models for Reasoning about Actions and Change",
  "authors": [
    "He, Weinan  and\nHuang, Canming  and\nXiao, Zhanhao  and\nLiu, Yongmei"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Reasoning about actions and change (RAC) is essential to understand and interact with the ever-changing environment. Previous AI research has shown the importance of fundamental and indispensable knowledge of actions, i.e., preconditions and effects. However, traditional methods rely on logical formalization which hinders practical applications. With recent transformer-based language models (LMs), reasoning over text is desirable and seemingly feasible, leading to the question of whether LMs can effectively and efficiently learn to solve RAC problems. We propose four essential RAC tasks as a comprehensive textual benchmark and generate problems in a way that minimizes the influence of other linguistic requirements (e.g., grounding) to focus on RAC. The resulting benchmark, TRAC, encompassing problems of various complexities, facilitates a more granular evaluation of LMs, precisely targeting the structural generalization ability much needed for RAC. Experiments with three high-performing transformers indicate that additional efforts are needed to tackle challenges raised by TRAC.",
  "keywords": [
    "transformers",
    "the structural generalization ability",
    "question",
    "we",
    "rac",
    "complexities",
    "a more granular evaluation",
    "various complexities",
    "three high-performing transformers",
    "i",
    "text",
    "generalization",
    "transformer",
    "e g",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2023.acl-long.255/",
  "provenance": {
    "collected_at": "2025-06-05 09:38:52",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}