{
  "id": "2023.bionlp-1.61",
  "title": "APTS}umm at {B}io{L}ay{S}umm Task 1: Biomedical Breakdown, Improving Readability by Relevancy Based Selection",
  "authors": [
    "Poornash, A.s.  and\nDeshmukh, Atharva  and\nSharma, Archit  and\nSaha, Sriparna"
  ],
  "year": "2023",
  "venue": "The 22nd Workshop on Biomedical Natural Language Processing and BioNLP Shared Tasks",
  "abstract": "In this paper we tackle a lay summarization task which aims to produce lay-summary of biomedical articles. BioLaySumm in the BioNLP Workshop at ACL 2023 (Goldsack et al., 2023), has presented us with this lay summarization task for biomedical articles. Our proposed models provide a three-step abstractive approach for summarizing biomedical articles. Our methodology involves breaking down the original document into distinct sections, generating candidate summaries for each subsection, then finally re-ranking and selecting the top performing paragraph for each section. We run ablation studies to establish that each step in our pipeline is critical for improvement in the quality of lay summary. This model achieved the second-highest rank in terms of readability scores (Luo et al., 2022). Our work distinguishes itself from previous studies by not only considering the content of the paper but also its structure, resulting in more coherent and comprehensible lay summaries. We hope that our model for generating lay summaries of biomedical articles will be a useful resource for individuals across various domains, including academia, industry, and healthcare, who require rapid comprehension of key scientific research.",
  "keywords": [
    "ablation studies",
    "summarization",
    "we",
    "this lay summarization task",
    "lay",
    "scientific",
    "key scientific research",
    "previous studies",
    "bionlp",
    "umm",
    "work",
    "summaries",
    "model",
    "studies",
    "the bionlp workshop"
  ],
  "url": "https://aclanthology.org/2023.bionlp-1.61/",
  "provenance": {
    "collected_at": "2025-06-05 10:22:58",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}