{
  "id": "2023.bionlp-1.49",
  "title": "Team:{PULSAR} at {P}rob{S}um 2023:{PULSAR}: Pre-training with Extracted Healthcare Terms for Summarising Patients' Problems and Data Augmentation with Black-box Large Language Models",
  "authors": [
    "Li, Hao  and\nWu, Yuping  and\nSchlegel, Viktor  and\nBatista-Navarro, Riza  and\nNguyen, Thanh-Tung  and\nRamesh Kashyap, Abhinav  and\nZeng, Xiao-Jun  and\nBeck, Daniel  and\nWinkler, Stefan  and\nNenadic, Goran"
  ],
  "year": "2023",
  "venue": "The 22nd Workshop on Biomedical Natural Language Processing and BioNLP Shared Tasks",
  "abstract": "Medical progress notes play a crucial role in documenting a patient’s hospital journey, including his or her condition, treatment plan, and any updates for healthcare providers. Automatic summarisation of a patient’s problems in the form of a “problem list” can aid stakeholders in understanding a patient’s condition, reducing workload and cognitive bias. BioNLP 2023 Shared Task 1A focusses on generating a list of diagnoses and problems from the provider’s progress notes during hospitalisation. In this paper, we introduce our proposed approach to this task, which integrates two complementary components. One component employs large language models (LLMs) for data augmentation; the other is an abstractive summarisation LLM with a novel pre-training objective for generating the patients’ problems summarised as a list. Our approach was ranked second among all submissions to the shared task. The performance of our model on the development and test datasets shows that our approach is more robust on unknown data, with an improvement of up to 3.1 points over the same size of the larger model.",
  "keywords": [
    "bias",
    "form",
    "we",
    "a patient s condition",
    "llm",
    "training",
    "patients",
    "a novel pre-training objective",
    "objective",
    "the patients problems",
    "a patient s problems",
    "bionlp",
    "-",
    "black-box large language models",
    "language"
  ],
  "url": "https://aclanthology.org/2023.bionlp-1.49/",
  "provenance": {
    "collected_at": "2025-06-05 10:22:48",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}