{
  "id": "2023.acl-long.625",
  "title": "Multitask Pre-training of Modular Prompt for {C}hinese Few-Shot Learning",
  "authors": [
    "Sun, Tianxiang  and\nHe, Zhengfu  and\nZhu, Qin  and\nQiu, Xipeng  and\nHuang, Xuanjing"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Prompt tuning is a parameter-efficient approach to adapting pre-trained language models to downstream tasks. Although prompt tuning has been shown to match the performance of full model tuning when training data is sufficient, it tends to struggle in few-shot learning settings. In this paper, we present Multi-task Pre-trained Modular Prompt (MP2) to boost prompt tuning for few-shot learning. MP2 is a set of combinable prompts pre-trained on 38 Chinese tasks. On downstream tasks, the pre-trained prompts are selectively activated and combined, leading to strong compositional generalization to unseen tasks. To bridge the gap between pre-training and fine-tuning, we formulate upstream and downstream tasks into a unified machine reading comprehension task. Extensive experiments under two learning paradigms, i.e., gradient descent and black-box tuning, show that MP2 significantly outperforms prompt tuning, full model tuning, and prior prompt pre-training methods in few-shot settings. In addition, we demonstrate that MP2 can achieve surprisingly fast and strong adaptation to downstream tasks by merely learning 8 parameters to combine the pre-trained modular prompts.",
  "keywords": [
    "the pre-trained prompts",
    "few-shot learning settings",
    "multi-task pre-trained modular prompt",
    "efficient",
    "few-shot learning",
    "we",
    "shot",
    "parameter",
    "training",
    "the pre-trained modular prompts",
    "pre-trained language models",
    "it",
    "unified",
    "modular prompt",
    "sufficient"
  ],
  "url": "https://aclanthology.org/2023.acl-long.625/",
  "provenance": {
    "collected_at": "2025-06-05 09:44:02",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}