{
  "id": "2023.findings-acl.616",
  "title": "Neural Topic Modeling based on Cycle Adversarial Training and Contrastive Learning",
  "authors": [
    "Wang, Boyu  and\nZhang, Linhai  and\nZhou, Deyu  and\nCao, Yi  and\nDing, Jiandong"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Neural topic models have been widely used to extract common topics across documents. Recently, contrastive learning has been applied to variational autoencoder-based neural topic models, achieving promising results. However, due to the limitation of the unidirectional structure of the variational autoencoder, the encoder is enhanced with the contrastive loss instead of the decoder, leading to a gap between model training and evaluation. To address the limitation, we propose a novel neural topic modeling framework based on cycle adversarial training and contrastive learning to apply contrastive learning on the generator directly. Specifically, a self-supervised contrastive loss is proposed to make the generator capture similar topic information, which leads to better topic-word distributions. Meanwhile, a discriminative contrastive loss is proposed to cooperate with the self-supervised contrastive loss to balance the generation and discrimination. Moreover, based on the reconstruction ability of the cycle generative adversarial network, a novel data augmentation strategy is designed and applied to the topic distribution directly. Experiments have been conducted on four benchmark datasets and results show that the proposed approach outperforms competitive baselines.",
  "keywords": [
    "the decoder",
    "autoencoder",
    "the generation",
    "we",
    "training",
    "the generator",
    "the encoder",
    "generative adversarial network",
    "neural",
    "self",
    "decoder",
    "loss",
    "information",
    "word",
    "learning"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.616/",
  "provenance": {
    "collected_at": "2025-06-05 10:17:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}