{
  "id": "2023.sigmorphon-1.9",
  "title": "Lightweight morpheme labeling in context: Using structured linguistic representations to support linguistic analysis for the language documentation context",
  "authors": [
    "Shandilya, Bhargav  and\nPalmer, Alexis"
  ],
  "year": "2023",
  "venue": "Proceedings of the 20th SIGMORPHON workshop on Computational Research in Phonetics, Phonology, and Morphology",
  "abstract": "Linguistic analysis is a core task in the process of documenting, analyzing, and describing endangered and less-studied languages. In addition to providing insight into the properties of the language being studied, having tools to automatically label words in a language for grammatical category and morphological features can support a range of applications useful for language pedagogy and revitalization. At the same time, most modern NLP methods for these tasks require both large amounts of data in the language and compute costs well beyond the capacity of most research groups and language communities. In this paper, we present a gloss-to-gloss (g2g) model for linguistic analysis (specifically, morphological analysis and part-of-speech tagging) that is lightweight in terms of both data requirements and computational expense. The model is designed for the interlinear glossed text (IGT) format, in which we expect the source text of a sentence in a low-resource language, a translation of that sentence into a language of wider communication, and a detailed glossing of the morphological properties of each word in the sentence. We first produce silver standard parallel glossed data by automatically labeling the high-resource translation. The model then learns to transform source language morphological labels into output labels for the target language, mediated by a structured linguistic representation layer. We test the model on both low-resource and high-resource languages, and find that our simple CNN-based model achieves comparable performance to a state-of-the-art transformer-based model, at a fraction of the computational cost.",
  "keywords": [
    "the high-resource translation",
    "our simple cnn-based model",
    "communities",
    "layer",
    "we",
    "the morphological properties",
    "translation",
    "cnn",
    "most modern nlp methods",
    "properties",
    "format",
    "word",
    "analysis",
    "core",
    "language communities"
  ],
  "url": "https://aclanthology.org/2023.sigmorphon-1.9/",
  "provenance": {
    "collected_at": "2025-06-05 10:31:15",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}