{
  "id": "2023.findings-acl.525",
  "title": "Multi-lingual and Multi-cultural Figurative Language Understanding",
  "authors": [
    "Kabra, Anubha  and\nLiu, Emmy  and\nKhanuja, Simran  and\nAji, Alham Fikri  and\nWinata, Genta  and\nCahyawijaya, Samuel  and\nAremu, Anuoluwapo  and\nOgayo, Perez  and\nNeubig, Graham"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Figurative language permeates human communication, but at the same time is relatively understudied in NLP. Datasets have been created in English to accelerate progress towards measuring and improving figurative language processing in language models (LMs). However, the use of figurative language is an expression of our cultural and societal experiences, making it difficult for these phrases to be universally applicable. In this work, we create a figurative language inference dataset, {pasted macro ‘DATASETNAME’}, for seven diverse languages associated with a variety of cultures: Hindi, Indonesian, Javanese, Kannada, Sundanese, Swahili and Yoruba. Our dataset reveals that each language relies on cultural and regional concepts for figurative expressions, with the highest overlap between languages originating from the same region. We assess multilingual LMs’ abilities to interpret figurative language in zero-shot and few-shot settings. All languages exhibit a significant deficiency compared to English, with variations in performance reflecting the availability of pre-training and fine-tuning data, emphasizing the need for LMs to be exposed to a broader range of linguistic and cultural variation during training. Data and code is released athttps://anonymous.4open.science/r/Multilingual-Fig-QA-7B03/",
  "keywords": [
    "variety",
    "code",
    "a significant deficiency",
    "we",
    "shot",
    "training",
    "nlp datasets",
    "it",
    "deficiency",
    "science",
    "understudied",
    "a variety",
    "abilities",
    "tuning",
    "processing"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.525/",
  "provenance": {
    "collected_at": "2025-06-05 10:15:45",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}