{
  "id": "2023.findings-acl.249",
  "title": "Injecting Comparison Skills in Task-Oriented Dialogue Systems for Database Search Results Disambiguation",
  "authors": [
    "Kim, Yongil  and\nHwang, Yerin  and\nShin, Joongbo  and\nBae, Hyunkyung  and\nJung, Kyomin"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "In task-oriented dialogue (TOD) systems designed to aid users accomplish specific goals in one or more domains, the agent retrieves entities that satisfy user constraints from the database. However, when multiple database search results exist, an ambiguity occurs regarding which results to select and present to the user. Existing TOD systems handle this ambiguity by randomly selecting one or few results and presenting their names to the user. However, in a real scenario, users do not always accept a randomly recommended entity, and users should have access to more comprehensive information about the search results. To address this limitation, we propose a novel task called Comparison-Based database search Ambiguity handling (CBA), which handles ambiguity in database search results by comparing the properties of multiple entities to enable users to choose according to their preferences. Accordingly, we introduce a new framework for automatically collecting high-quality dialogue data along with the Disambiguating Schema-guided Dialogue (DSD) dataset, an augmented version of the SGD dataset. Experimental studies on the DSD dataset demonstrate that training baseline models with the dataset effectively address the CBA task. Our dataset and code will be publicized.",
  "keywords": [
    "code",
    "the disambiguating schema-guided dialogue",
    "we",
    "dialogue",
    "properties",
    "information",
    "high-quality dialogue data",
    "sgd",
    "multiple entities",
    "the properties",
    "task-oriented dialogue tod systems",
    "studies",
    "entities",
    "task-oriented dialogue systems",
    "entity"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.249/",
  "provenance": {
    "collected_at": "2025-06-05 09:56:42",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}