{
  "id": "2023.starsem-1.30",
  "title": "A Tale of Two Laws of Semantic Change: Predicting Synonym Changes with Distributional Semantic Models",
  "authors": [
    "Lietard, Bastien  and\nKeller, Mikaela  and\nDenis, Pascal"
  ],
  "year": "2023",
  "venue": "Proceedings of the 12th Joint Conference on Lexical and Computational Semantics (*SEM 2023)",
  "abstract": "Lexical Semantic Change is the study of how the meaning of words evolves through time. Another related question is whether and how lexical relations over pairs of words, such as synonymy, change over time. There are currently two competing, apparently opposite hypotheses in the historical linguistic literature regarding how synonymous words evolve: the Law of Differentiation (LD) argues that synonyms tend to take on different meanings over time, whereas the Law of Parallel Change (LPC) claims that synonyms tend to undergo the same semantic change and therefore remain synonyms. So far, there has been little research using distributional models to assess to what extent these laws apply on historical corpora. In this work, we take a first step toward detecting whether LD or LPC operates for given word pairs. After recasting the problem into a more tractable task, we combine two linguistic resources to propose the first complete evaluation framework on this problem and provide empirical evidence in favor of a dominance of LD. We then propose various computational approaches to the problem using Distributional Semantic Models and grounded in recent literature on Lexical Semantic Change detection. Our best approaches achieve a balanced accuracy above 0.6 on our dataset. We discuss challenges still faced by these approaches, such as polysemy or the potential confusion between synonymy and hypernymy.",
  "keywords": [
    "semantic change",
    "question",
    "the same semantic change",
    "semantic",
    "we",
    "confusion",
    "word",
    "ld",
    "accuracy",
    "work",
    "distributional semantic models",
    "lexical semantic change",
    "a balanced accuracy",
    "lexical semantic change detection",
    "evaluation"
  ],
  "url": "https://aclanthology.org/2023.starsem-1.30/",
  "provenance": {
    "collected_at": "2025-06-05 10:31:57",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}