{
  "id": "2023.acl-long.220",
  "title": "Guiding Computational Stance Detection with Expanded Stance Triangle Framework",
  "authors": [
    "Liu, Zhengyuan  and\nYap, Yong Keong  and\nChieu, Hai Leong  and\nChen, Nancy"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Stance detection determines whether the author of a piece of text is in favor of, against, or neutral towards a specified target, and can be used to gain valuable insights into social media. The ubiquitous indirect referral of targets makes this task challenging, as it requires computational solutions to model semantic features and infer the corresponding implications from a literal statement. Moreover, the limited amount of available training data leads to subpar performance in out-of-domain and cross-target scenarios, as data-driven approaches are prone to rely on superficial and domain-specific features. In this work, we decompose the stance detection task from a linguistic perspective, and investigate key components and inference paths in this task. The stance triangle is a generic linguistic framework previously proposed to describe the fundamental ways people express their stance. We further expand it by characterizing the relationship between explicit and implicit objects. We then use the framework to extend one single training corpus with additional annotation. Experimental results show that strategically-enriched data can significantly improve the performance on out-of-domain and cross-target evaluation.",
  "keywords": [
    "a specified target",
    "semantic",
    "we",
    "training",
    "cross",
    "it",
    "a generic linguistic framework",
    "a piece",
    "piece",
    "text",
    "generic",
    "work",
    "specified",
    "evaluation",
    "semantic features"
  ],
  "url": "https://aclanthology.org/2023.acl-long.220/",
  "provenance": {
    "collected_at": "2025-06-05 09:38:24",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}