{
  "id": "2023.findings-acl.493",
  "title": "Pre-trained Language Model with Prompts for Temporal Knowledge Graph Completion",
  "authors": [
    "Xu, Wenjie  and\nLiu, Ben  and\nPeng, Miao  and\nJia, Xu  and\nPeng, Min"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Temporal Knowledge graph completion (TKGC) is a crucial task that involves reasoning at known timestamps to complete the missing part of facts and has attracted more and more attention in recent years. Most existing methods focus on learning representations based on graph neural networks while inaccurately extracting information from timestamps and insufficiently utilizing the implied information in relations. To address these problems, we propose a novel TKGC model, namely Pre-trained Language Model with Prompts for TKGC (PPT). We convert a series of sampled quadruples into pre-trained language model inputs and convert intervals between timestamps into different prompts to make coherent sentences with implicit semantic information. We train our model with a masking strategy to convert TKGC task into a masked token prediction task, which can leverage the semantic information in pre-trained language models. Experiments on three benchmark datasets and extensive analysis demonstrate that our model has great competitiveness compared to other models with four metrics. Our model can effectively incorporate information from temporal knowledge graphs into the language models.",
  "keywords": [
    "different prompts",
    "pre-trained language model inputs",
    "series",
    "semantic",
    "we",
    "more and more attention",
    "graph",
    "neural",
    "the semantic information",
    "tkgc task",
    "token",
    "pre-trained language models experiments",
    "information",
    "a novel tkgc model",
    "four metrics"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.493/",
  "provenance": {
    "collected_at": "2025-06-05 10:15:19",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}