{
  "id": "2023.bionlp-1.42",
  "title": "R}ad{A}dapt: Radiology Report Summarization via Lightweight Domain Adaptation of Large Language Models",
  "authors": [
    "Van Veen, Dave  and\nVan Uden, Cara  and\nAttias, Maayane  and\nPareek, Anuj  and\nBluethgen, Christian  and\nPolacin, Malgorzata  and\nChiu, Wah  and\nDelbrouck, Jean-Benoit  and\nZambrano Chaves, Juan  and\nLanglotz, Curtis  and\nChaudhari, Akshay  and\nPauly, John"
  ],
  "year": "2023",
  "venue": "The 22nd Workshop on Biomedical Natural Language Processing and BioNLP Shared Tasks",
  "abstract": "We systematically investigate lightweight strategies to adapt large language models (LLMs) for the task of radiology report summarization (RRS). Specifically, we focus on domain adaptation via pretraining (on natural language, biomedical text, or clinical text) and via discrete prompting or parameter-efficient fine-tuning. Our results consistently achieve best performance by maximally adapting to the task via pretraining on clinical text and fine-tuning on RRS examples. Importantly, this method fine-tunes a mere 0.32% of parameters throughout the model, in contrast to end-to-end fine-tuning (100% of parameters). Additionally, we study the effect of in-context examples and out-of-distribution (OOD) training before concluding with a radiologist reader study and qualitative analysis. Our findings highlight the importance of domain adaptation in RRS and provide valuable insights toward developing effective natural language processing solutions for clinical tasks.",
  "keywords": [
    "tuning",
    "end",
    "language",
    "processing",
    "discrete prompting",
    "natural",
    "model",
    "lightweight strategies",
    "text",
    "efficient",
    "large language models",
    "strategies",
    "prompting",
    "fine",
    "summarization"
  ],
  "url": "https://aclanthology.org/2023.bionlp-1.42/",
  "provenance": {
    "collected_at": "2025-06-05 10:22:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}