{
  "id": "2023.findings-acl.759",
  "title": "Connectivity Patterns are Task Embeddings",
  "authors": [
    "Xi, Zhiheng  and\nZheng, Rui  and\nZhang, Yuansen  and\nHuang, Xuanjing  and\nWei, Zhongyu  and\nPeng, Minlong  and\nSun, Mingming  and\nZhang, Qi  and\nGui, Tao"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Task embeddings are task-specific vectors designed to construct a semantic space of tasks, which can be used to predict the most transferable source task for a given target task via the similarity between task embeddings. However, existing methods use optimized parameters and representations as task embeddings, resulting in substantial computational complexity and storage requirements. In this work, we draw inspiration from the operating mechanism of deep neural networks (DNNs) and biological brains, where neuronal activations are sparse and task-specific, and we use the connectivity patterns of neurons as a unique identifier associated with the task. The proposed method learns to assign importance masks for sub-structures of DNNs, and accordingly indicate the task-specific connectivity patterns. In addition to the storage advantages brought by the binary masking mechanism and structured sparsity, the early-bird nature of the sparse optimization process can deliver an efficient computation advantage. Experiments show that our method consistently outperforms other baselines in predicting inter-task transferability across data regimes and transfer settings, while keeping high efficiency in computation and storage.",
  "keywords": [
    "deep",
    "high efficiency",
    "the sparse optimization process",
    "a unique identifier",
    "task embeddings task embeddings",
    "efficient",
    "efficiency",
    "semantic",
    "we",
    "activations",
    "task-specific vectors",
    "neural",
    "transfer",
    "a semantic space",
    "early"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.759/",
  "provenance": {
    "collected_at": "2025-06-05 10:18:56",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}