{
  "id": "2023.acl-long.761",
  "title": "What is the Real Intention behind this Question? Dataset Collection and Intention Classification",
  "authors": [
    "Mirzaei, Maryam Sadat  and\nMeshgi, Kourosh  and\nSekine, Satoshi"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Asking and answering questions are inseparable parts of human social life. The primary purposes of asking questions are to gain knowledge or request help which has been the subject of question-answering studies. However, questions can also reflect negative intentions and include implicit offenses, such as highlighting one’s lack of knowledge or bolstering an alleged superior knowledge, which can lead to conflict in conversations; yet has been scarcely researched. This paper is the first study to introduce a dataset (Question Intention Dataset) that includes questions with positive/neutral and negative intentions and the underlying intention categories within each group. We further conduct a meta-analysis to highlight tacit and apparent intents. We also propose a classification method using Transformers augmented by TF-IDF-based features and report the results of several models for classifying the main intention categories. We aim to highlight the importance of taking intentions into account, especially implicit and negative ones, to gain insight into conflict-evoking questions and better understand human-human communication on the web for NLP applications.",
  "keywords": [
    "transformers",
    "the underlying intention categories",
    "conversations",
    "question",
    "we",
    "the main intention categories",
    "classification",
    "a classification method",
    "nlp applications",
    "analysis",
    "categories",
    "intention classification",
    "question-answering studies",
    "knowledge",
    "nlp"
  ],
  "url": "https://aclanthology.org/2023.acl-long.761/",
  "provenance": {
    "collected_at": "2025-06-05 09:46:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}