{
  "id": "2023.acl-long.824",
  "title": "M}ulti{EMO}: An Attention-Based Correlation-Aware Multimodal Fusion Framework for Emotion Recognition in Conversations",
  "authors": [
    "Shi, Tao  and\nHuang, Shao-Lun"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Emotion Recognition in Conversations (ERC) is an increasingly popular task in the Natural Language Processing community, which seeks to achieve accurate emotion classifications of utterances expressed by speakers during a conversation. Most existing approaches focus on modeling speaker and contextual information based on the textual modality, while the complementarity of multimodal information has not been well leveraged, few current methods have sufficiently captured the complex correlations and mapping relationships across different modalities. Furthermore, existing state-of-the-art ERC models have difficulty classifying minority and semantically similar emotion categories. To address these challenges, we propose a novel attention-based correlation-aware multimodal fusion framework named MultiEMO, which effectively integrates multimodal cues by capturing cross-modal mapping relationships across textual, audio and visual modalities based on bidirectional multi-head cross-attention layers. The difficulty of recognizing minority and semantically hard-to-distinguish emotion classes is alleviated by our proposed Sample-Weighted Focal Contrastive (SWFC) loss. Extensive experiments on two benchmark ERC datasets demonstrate that our MultiEMO framework consistently outperforms existing state-of-the-art approaches in all emotion categories on both datasets, the improvements in minority and semantically similar emotions are especially significant.",
  "keywords": [
    "a conversation",
    "conversations",
    "we",
    "fusion",
    "current",
    "cross",
    "natural",
    "semantically similar emotions",
    "loss",
    "information",
    "visual",
    "different modalities",
    "m",
    "all emotion categories",
    "processing"
  ],
  "url": "https://aclanthology.org/2023.acl-long.824/",
  "provenance": {
    "collected_at": "2025-06-05 09:46:55",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}