{
  "id": "2023.trustnlp-1.26",
  "title": "On The Real-world Performance of Machine Translation: Exploring Social Media Post-authors' Perspectives",
  "authors": [
    "Gupta, Ananya  and\nTakeuchi, Jae  and\nKnijnenburg, Bart"
  ],
  "year": "2023",
  "venue": "Proceedings of the 3rd Workshop on Trustworthy Natural Language Processing (TrustNLP 2023)",
  "abstract": "Many social networking sites (SNS) offer machine translation of posts in an effort to increase understanding, engagement, and connectivity between users across language barriers. However, the translations of these posts are still not 100% accurate and can be a cause of misunderstandings that can harm post-authors’ professional or personal relationships. An exacerbating factor is on most SNS, authors cannot view the translation of their own posts, nor make corrections to inaccurate translations. This paper reports findings from a survey (N = 189) and an interview (N = 15) to explore users’ concerns regarding this automatic form of machine translation. Our findings show that users are concerned about potential inaccuracies in the meaning of the translations of their posts, and would thus appreciate being able to view and potentially correct such translations. Additionally, we found that when users write posts in their native language, they write them for specific audiences, so they do not always want them translated. This underscores the urgency of providing users with more control over the translation of their posts.",
  "keywords": [
    "inaccuracies",
    "sns offer machine translation",
    "machine translation",
    "form",
    "we",
    "translation",
    "interview",
    "such translations",
    "the translation",
    "the translations",
    "-",
    "potential inaccuracies",
    "specific audiences",
    "barriers",
    "audiences"
  ],
  "url": "https://aclanthology.org/2023.trustnlp-1.26/",
  "provenance": {
    "collected_at": "2025-06-05 10:32:53",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}