{
  "id": "2023.starsem-1.11",
  "title": "JSEEG}raph: Joint Structured Event Extraction as Graph Parsing",
  "authors": [
    "You, Huiling  and\nVrelid, Lilja  and\nTouileb, Samia"
  ],
  "year": "2023",
  "venue": "Proceedings of the 12th Joint Conference on Lexical and Computational Semantics (*SEM 2023)",
  "abstract": "We propose a graph-based event extraction framework JSEEGraph that approaches the task of event extraction as general graph parsing in the tradition of Meaning Representation Parsing. It explicitly encodes entities and events in a single semantic graph, and further has the flexibility to encode a wider range of additional IE relations and jointly infer individual tasks. JSEEGraph performs in an end-to-end manner via general graph parsing: (1) instead of flat sequence labelling, nested structures between entities/triggers are efficiently encoded as separate nodes in the graph, allowing for nested and overlapping entities and triggers; (2) both entities, relations, and events can be encoded in the same graph, where entities and event triggers are represented as nodes and entity relations and event arguments are constructed via edges; (3) joint inference avoids error propagation and enhances the interpolation of different IE tasks. We experiment on two benchmark datasets of varying structural complexities; ACE05 and Rich ERE, covering three languages: English, Chinese, and Spanish. Experimental results show that JSEEGraph can handle nested event structures, that it is beneficial to solve different IE tasks jointly, and that event argument extraction in particular benefits from entity extraction. Our code and models are released as open-source.",
  "keywords": [
    "code",
    "different ie tasks",
    "end",
    "extraction",
    "semantic",
    "we",
    "nested and overlapping entities",
    "graph",
    "complexities",
    "additional ie relations",
    "it",
    "general graph",
    "entities triggers",
    "rich",
    "sequence"
  ],
  "url": "https://aclanthology.org/2023.starsem-1.11/",
  "provenance": {
    "collected_at": "2025-06-05 10:31:42",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}