{
  "id": "2023.acl-long.822",
  "title": "Rethinking Annotation: Can Language Learners Contribute?",
  "authors": [
    "Yoo, Haneul  and\nPutri, Rifki Afina  and\nLee, Changyoon  and\nLee, Youngin  and\nAhn, So-Yeon  and\nKang, Dongyeop  and\nOh, Alice"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Researchers have traditionally recruited native speakers to provide annotations for the widely used benchmark datasets. But there are languages for which recruiting native speakers is difficult, and it would help to get learners of those languages to annotate the data. In this paper, we investigate whether language learners can contribute annotations to the benchmark datasets. In a carefully controlled annotation experiment, we recruit 36 language learners, provide two types of additional resources (dictionaries and machine-translated sentences), and perform mini-tests to measure their language proficiency. We target three languages, English, Korean, and Indonesian, and four NLP tasks, sentiment analysis, natural language inference, named entity recognition, and machine reading comprehension. We find that language learners, especially those with intermediate or advanced language proficiency, are able to provide fairly accurate labels with the help of additional resources. Moreover, we show that data annotation improves learners’ language proficiency in terms of vocabulary and grammar. The implication of our findings is that broadening the annotation task to include language learners can open up the opportunity to build benchmark datasets for languages for which it is difficult to recruit native speakers.",
  "keywords": [
    "36 language learners",
    "we",
    "language learners",
    "their language proficiency",
    "natural",
    "it",
    "learners language proficiency",
    "analysis",
    "-",
    "mini",
    "four nlp tasks",
    "proficiency",
    "dictionaries",
    "language",
    "learners"
  ],
  "url": "https://aclanthology.org/2023.acl-long.822/",
  "provenance": {
    "collected_at": "2025-06-05 09:46:53",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}