{
  "id": "2023.sicon-1.7",
  "title": "Exploring Linguistic Style Matching in Online Communities: The Role of Social Context and Conversation Dynamics",
  "authors": [
    "Ananthasubramaniam, Aparna  and\nChen, Hong  and\nYan, Jason  and\nAlkiek, Kenan  and\nPei, Jiaxin  and\nSeth, Agrima  and\nDunagan, Lavinia  and\nChoi, Minje  and\nLitterer, Benjamin  and\nJurgens, David"
  ],
  "year": "2023",
  "venue": "Proceedings of the First Workshop on Social Influence in Conversations (SICon 2023)",
  "abstract": "Linguistic style matching (LSM) in conversations can be reflective of several aspects of social influence such as power or persuasion. However, how LSM relates to the outcomes of online communication on platforms such as Reddit is an unknown question. In this study, we analyze a large corpus of two-party conversation threads in Reddit where we identify all occurrences of LSM using two types of style: the use of function words and formality. Using this framework, we examine how levels of LSM differ in conversations depending on several social factors within Reddit: post and subreddit features, conversation depth, user tenure, and the controversiality of a comment. Finally, we measure the change of LSM following loss of status after community banning. Our findings reveal the interplay of LSM in Reddit conversations with several community metrics, suggesting the importance of understanding conversation engagement when understanding community dynamics.",
  "keywords": [
    "conversation dynamics linguistic style",
    "communities",
    "conversations",
    "question",
    "we",
    "loss",
    "reddit conversations",
    "two-party conversation threads",
    "metrics",
    "function",
    "online communities",
    "several community metrics",
    "conversation depth user tenure",
    "conversation engagement",
    "conversation"
  ],
  "url": "https://aclanthology.org/2023.sicon-1.7/",
  "provenance": {
    "collected_at": "2025-06-05 10:31:07",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}