{
  "id": "2023.findings-acl.600",
  "title": "Spontaneous gestures encoded by hand positions improve language models: An Information-Theoretic motivated study",
  "authors": [
    "Xu, Yang  and\nCheng, Yang"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "The multi-modality nature of human communication has been utilized to enhance the performance of language modeling-related tasks. Driven by the development of large-scale end-to-end learning techniques and the availability of multi-modal data, it becomes possible to represent non-verbal communication behaviors through joint-learning, and directly study their interaction with verbal communication. However, there is still gaps in existing studies to better address the underlying mechanism of how non-verbal expression contributes to the overall communication purpose. Therefore, we explore two questions using mixed-modal language models trained against monologue video data: first, whether incorporating gesture representations can improve the language model’s performance (perplexity); second, whether spontaneous gestures demonstrate entropy rate constancy (ERC), which is an empirical pattern found in most verbal language data that supports the rational communication assumption from Information Theory. We have positive and interesting findings for both questions: speakers indeed use spontaneous gestures to convey “meaningful” information that enhances verbal communication, which can be captured with a simple spatial encoding scheme. More importantly, gestures are produced and organized rationally in a similar way as words, which optimizes the communication efficiency.",
  "keywords": [
    "end",
    "rate",
    "efficiency",
    "we",
    "the communication efficiency",
    "it",
    "information",
    "learning",
    "existing studies",
    "mixed-modal language models",
    "language models",
    "perplexity",
    "language",
    "language modeling-related tasks",
    "studies"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.600/",
  "provenance": {
    "collected_at": "2025-06-05 10:16:47",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}