{
  "id": "2023.acl-srw.47",
  "title": "``When Words Fail, Emojis Prevail'': A Novel Architecture for Generating Sarcastic Sentences With Emoji Using Valence Reversal and Semantic Incongruity",
  "authors": [
    "Kader, Faria Binte  and\nHossain Nujat, Nafisa  and\nSogir, Tasmia Binte  and\nKabir, Mohsinul  and\nMahmud, Hasan  and\nHasan, Md Kamrul"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 4: Student Research Workshop)",
  "abstract": "Sarcasm is a form of figurative language that serves as a humorous tool for mockery and ridicule. We present a novel architecture for sarcasm generation with emoji from a non-sarcastic input sentence in English. We divide the generation task into two sub tasks: one for generating textual sarcasm and another for collecting emojis associated with those sarcastic sentences. Two key elements of sarcasm are incorporated into the textual sarcasm generation task: valence reversal and semantic incongruity with context, where the context may involve shared commonsense or general knowledge between the speaker and their audience. The majority of existing sarcasm generation works have focused on this textual form. However, in the real world, when written texts fall short of effectively capturing the emotional cues of spoken and face-to-face communication, people often opt for emojis to accurately express their emotions. Due to the wide range of applications of emojis, incorporating appropriate emojis to generate textual sarcastic sentences helps advance sarcasm generation. We conclude our study by evaluating the generated sarcastic sentences using human judgement. All the codes and data used in this study has been made publicly available.",
  "keywords": [
    "audience",
    "form",
    "semantic",
    "we",
    "their audience",
    "semantic incongruity",
    "incongruity",
    "the generated sarcastic sentences",
    "existing sarcasm generation works",
    "the generation task",
    "semantic incongruity sarcasm",
    "general",
    "knowledge",
    "language",
    "generation"
  ],
  "url": "https://aclanthology.org/2023.acl-srw.47/",
  "provenance": {
    "collected_at": "2025-06-05 09:51:55",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}