{
  "id": "2023.acl-demo.58",
  "title": "D}eep{P}avlov Dream: Platform for Building Generative {AI} Assistants",
  "authors": [
    "Zharikova, Diliara  and\nKornev, Daniel  and\nIgnatov, Fedor  and\nTalimanchuk, Maxim  and\nEvseev, Dmitry  and\nPetukhova, Ksenya  and\nSmilga, Veronika  and\nKarpov, Dmitry  and\nShishkina, Yana  and\nKosenko, Dmitry  and\nBurtsev, Mikhail"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 3: System Demonstrations)",
  "abstract": "An open-source DeepPavlov Dream Platform is specifically tailored for development of complex dialog systems like Generative AI Assistants. The stack prioritizes efficiency, modularity, scalability, and extensibility with the goal to make it easier to develop complex dialog systems from scratch. It supports modular approach to implementation of conversational agents enabling their development through the choice of NLP components and conversational skills from a rich library organized into the distributions of ready-for-use multi-skill AI assistant systems. In DeepPavlov Dream, multi-skill Generative AI Assistant consists of NLP components that extract features from user utterances, conversational skills that generate or retrieve a response, skill and response selectors that facilitate choice of relevant skills and the best response, as well as a conversational orchestrator that enables creation of multi-skill Generative AI Assistants scalable up to industrial grade AI assistants. The platform allows to integrate large language models into dialog pipeline, customize with prompt engineering, handle multiple prompts during the same dialog session and create simple multimodal assistants.",
  "keywords": [
    "generative ai assistants",
    "nlp components",
    "efficiency",
    "it",
    "rich",
    "multiple prompts",
    "conversational skills",
    "generative",
    "prompt",
    "-",
    "efficiency modularity scalability",
    "easier",
    "prompts",
    "a conversational orchestrator",
    "language"
  ],
  "url": "https://aclanthology.org/2023.acl-demo.58/",
  "provenance": {
    "collected_at": "2025-06-05 09:51:25",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}