{
  "id": "2023.acl-long.867",
  "title": "NOTABLE}: Transferable Backdoor Attacks Against Prompt-based {NLP} Models",
  "authors": [
    "Mei, Kai  and\nLi, Zheng  and\nWang, Zhenting  and\nZhang, Yang  and\nMa, Shiqing"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Prompt-based learning is vulnerable to backdoor attacks. Existing backdoor attacks against prompt-based models consider injecting backdoors into the entire embedding layers or word embedding vectors. Such attacks can be easily affected by retraining on downstream tasks and with different prompting strategies, limiting the transferability of backdoor attacks. In this work, we propose transferable backdoor attacks against prompt-based models, called NOTABLE, which is independent of downstream tasks and prompting strategies. Specifically, NOTABLE injects backdoors into the encoders of PLMs by utilizing an adaptive verbalizer to bind triggers to specific words (i.e., anchors). It activates the backdoor by pasting input with triggers to reach adversary-desired anchors, achieving independence from downstream tasks and prompting strategies. We conduct experiments on six NLP tasks, three popular models, and three prompting strategies. Empirical results show that NOTABLE achieves superior attack performance (i.e., attack success rate over 90% on all the datasets), and outperforms two state-of-the-art baselines. Evaluations on three defenses show the robustness of NOTABLE. Our code can be found athttps://github.com/RU-System-Software-and-Security/Notable.",
  "keywords": [
    "code",
    "rate",
    "six nlp tasks",
    "different prompting strategies",
    "we",
    "it",
    "prompt-based models",
    "the entire embedding layers",
    "word",
    "learning",
    "vulnerable",
    "prompt",
    "i",
    "the encoders",
    "strategies"
  ],
  "url": "https://aclanthology.org/2023.acl-long.867/",
  "provenance": {
    "collected_at": "2025-06-05 09:47:33",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}