{
  "id": "2023.acl-long.652",
  "title": "Hybrid Uncertainty Quantification for Selective Text Classification in Ambiguous Tasks",
  "authors": [
    "Vazhentsev, Artem  and\nKuzmin, Gleb  and\nTsvigun, Akim  and\nPanchenko, Alexander  and\nPanov, Maxim  and\nBurtsev, Mikhail  and\nShelmanov, Artem"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Many text classification tasks are inherently ambiguous, which results in automatic systems having a high risk of making mistakes, in spite of using advanced machine learning models. For example, toxicity detection in user-generated content is a subjective task, and notions of toxicity can be annotated according to a variety of definitions that can be in conflict with one another. Instead of relying solely on automatic solutions, moderation of the most difficult and ambiguous cases can be delegated to human workers. Potential mistakes in automated classification can be identified by using uncertainty estimation (UE) techniques. Although UE is a rapidly growing field within natural language processing, we find that state-of-the-art UE methods estimate only epistemic uncertainty and show poor performance, or under-perform trivial methods for ambiguous tasks such as toxicity detection. We argue that in order to create robust uncertainty estimation methods for ambiguous tasks it is necessary to account also for aleatoric uncertainty. In this paper, we propose a new uncertainty estimation method that combines epistemic and aleatoric UE methods. We show that by using our hybrid method, we can outperform state-of-the-art UE methods for toxicity detection and other ambiguous text classification tasks.",
  "keywords": [
    "variety",
    "field",
    "we",
    "classification",
    "natural",
    "it",
    "automated classification",
    "learning",
    "a variety",
    "natural language processing",
    "processing",
    "text",
    "many text classification tasks",
    "ue",
    "language"
  ],
  "url": "https://aclanthology.org/2023.acl-long.652/",
  "provenance": {
    "collected_at": "2025-06-05 09:44:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}