{
  "id": "2023.findings-acl.764",
  "title": "Improving Radiology Summarization with Radiograph and Anatomy Prompts",
  "authors": [
    "Hu, Jinpeng  and\nChen, Zhihong  and\nLiu, Yang  and\nWan, Xiang  and\nChang, Tsung-Hui"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "The impression is crucial for the referring physicians to grasp key information since it is concluded from the findings and reasoning of radiologists. To alleviate the workload of radiologists and reduce repetitive human labor in impression writing, many researchers have focused on automatic impression generation. However, recent works on this task mainly summarize the corresponding findings and pay less attention to the radiology images. In clinical, radiographs can provide more detailed valuable observations to enhance radiologists’ impression writing, especially for complicated cases. Besides, each sentence in findings usually focuses on single anatomy, such that they only need to be matched to corresponding anatomical regions instead of the whole image, which is beneficial for textual and visual features alignment. Therefore, we propose a novel anatomy-enhanced multimodal model to promote impression generation. In detail, we first construct a set of rules to extract anatomies and put these prompts into each sentence to highlight anatomy characteristics. Then, two separate encoders are applied to extract features from the radiograph and findings. Afterward, we utilize a contrastive learning module to align these two representations at the overall level and use a co-attention to fuse them at the sentence level with the help of anatomy-enhanced sentence representation. The experimental results on two benchmark datasets confirm the effectiveness of the proposed method, which achieves state-of-the-art results.",
  "keywords": [
    "anatomies",
    "less attention",
    "summarization",
    "we",
    "it",
    "information",
    "learning",
    "visual",
    "radiology summarization",
    "two separate encoders",
    "impression generation",
    "-",
    "automatic impression generation",
    "encoders",
    "alignment"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.764/",
  "provenance": {
    "collected_at": "2025-06-05 10:19:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}