{
  "id": "2023.matching-1.5",
  "title": "Corpus-Based Task-Specific Relation Discovery",
  "authors": [
    "Ramanan, Karthik"
  ],
  "year": "2023",
  "venue": "Proceedings of the First Workshop on Matching From Unstructured and Structured Data (MATCHING 2023)",
  "abstract": "Relation extraction is a crucial language processing task for various downstream applications, including knowledge base completion, question answering, and summarization. Traditional relation-extraction techniques, however, rely on a predefined set of relations and model the extraction as a classification task. Consequently, such closed-world extraction methods are insufficient for inducing novel relations from a corpus. Unsupervised techniques like OpenIE, which extract <head, relation, tail> triples, generate relations that are too general for practical information extraction applications. In this work, we contribute the following: 1) We motivate and introduce a new task, corpus-based task-specific relation discovery. 2) We adapt existing data sources to create Wiki-Art, a novel dataset for task-specific relation discovery. 3) We develop a novel framework for relation discovery using zero-shot entity linking, prompting, and type-specific clustering. Our approach effectively connects unstructured text spans to their shared underlying relations, bridging the data-representation gap and significantly outperforming baselines on both quantitative and qualitative metrics. Our code and data are available in our GitHub repository.",
  "keywords": [
    "code",
    "a classification task",
    "extraction",
    "question",
    "we",
    "zero-shot entity",
    "shot",
    "classification",
    "openie",
    "practical information extraction applications",
    "information",
    "processing",
    "text",
    "metrics",
    "insufficient"
  ],
  "url": "https://aclanthology.org/2023.matching-1.5/",
  "provenance": {
    "collected_at": "2025-06-05 10:25:44",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}