{
  "id": "2023.acl-tutorials.5",
  "title": "Indirectly Supervised Natural Language Processing",
  "authors": [
    "Yin, Wenpeng  and\nChen, Muhao  and\nZhou, Ben  and\nNing, Qiang  and\nChang, Kai-Wei  and\nRoth, Dan"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 6: Tutorial Abstracts)",
  "abstract": "This tutorial targets researchers and practitioners who are interested in ML technologies for NLP from indirect supervision. In particular, we will present a diverse thread of indirect supervision studies that try to answer the following questions: (i) when and how can we provide supervision for a target task T, if all we have is data that corresponds to a “related” task T′? (ii) humans do not use exhaustive supervision; they rely on occasional feedback, and learn from incidental signals from various sources; how can we effectively incorporate such supervision in machine learning? (iii) how can we leverage multi-modal supervision to help NLP? To the end, we will discuss several lines of research that address those challenges, including (i) indirect supervision from T ′ that handles T with outputs spanning from a moderate size to an open space, (ii) the use of sparsely occurring and incidental signals, such as partial labels, noisy labels, knowledge-based constraints, and cross-domain or cross-task annotations—all having statistical associations with the task, (iii) principled ways to measure and understand why these incidental signals can contribute to our target tasks, and (iv) indirect supervision from vision-language signals. We will conclude the tutorial by outlining directions for further investigation.",
  "keywords": [
    "t",
    "end",
    "feedback",
    "all",
    "we",
    "cross",
    "natural",
    "indirect supervision studies",
    "technologies",
    "i",
    "-",
    "practitioners",
    "knowledge",
    "language",
    "nlp"
  ],
  "url": "https://aclanthology.org/2023.acl-tutorials.5/",
  "provenance": {
    "collected_at": "2025-06-05 09:53:09",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}