{
  "id": "2023.codi-1.10",
  "title": "Discourse Information for Document-Level Temporal Dependency Parsing",
  "authors": [
    "Niu, Jingcheng  and\nNg, Victoria  and\nRees, Erin  and\nDe Montigny, Simon  and\nPenn, Gerald"
  ],
  "year": "2023",
  "venue": "Proceedings of the 4th Workshop on Computational Approaches to Discourse (CODI 2023)",
  "abstract": "In this study, we examine the benefits of incorporating discourse information into document-level temporal dependency parsing. Specifically, we evaluate the effectiveness of integrating both high-level discourse profiling information, which describes the discourse function of sentences, and surface-level sentence position information into temporal dependency graph (TDG) parsing. Unexpectedly, our results suggest that simple sentence position information, particularly when encoded using our novel sentence-position embedding method, performs the best, perhaps because it does not rely on noisy model-generated feature inputs. Our proposed system surpasses the current state-of-the-art TDG parsing systems in performance. Furthermore, we aim to broaden the discussion on the relationship between temporal dependency parsing and discourse analysis, given the substantial similarities shared between the two tasks. We argue that discourse analysis results should not be merely regarded as an additional input feature for temporal dependency parsing. Instead, adopting advanced discourse analysis techniques and research insights can lead to more effective and comprehensive approaches to temporal information extraction tasks.",
  "keywords": [
    "parsing",
    "similarities",
    "extraction",
    "model",
    "it",
    "temporal dependency parsing",
    "the substantial similarities",
    "information",
    "temporal information extraction tasks",
    "dependency",
    "we",
    "temporal dependency graph tdg",
    "graph",
    "document-level temporal dependency parsing",
    "current"
  ],
  "url": "https://aclanthology.org/2023.codi-1.10/",
  "provenance": {
    "collected_at": "2025-06-05 10:24:12",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}