{
  "id": "2023.acl-long.224",
  "title": "Towards Boosting the Open-Domain Chatbot with Human Feedback",
  "authors": [
    "Lu, Hua  and\nBao, Siqi  and\nHe, Huang  and\nWang, Fan  and\nWu, Hua  and\nWang, Haifeng"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Many open-domain dialogue models pre-trained with social media comments can generate coherent replies but have difficulties producing engaging responses. This phenomenon might mainly result from the deficiency of annotated human-human conversations and the misalignment with human preference. In this paper, we propose a novel and efficient framework Diamante to boost the open-domain chatbot, where two kinds of human feedback (including explicit demonstration and implicit preference) are collected and leveraged. By asking annotators to select or amend the model-generated candidate responses, Diamante efficiently collects the human demonstrated responses and constructs a Chinese chit-chat dataset. To enhance the alignment with human preference, Diamante leverages the implicit preference in the data collection process and introduces the generation-evaluation joint training. Comprehensive experiments indicate that the Diamante dataset and joint training paradigm can significantly boost the performance of pre-trained dialogue models. The overall engagingness of the previous state-of-the-art model has been improved remarkably by 50% in Chinese open-domain conversations.",
  "keywords": [
    "feedback",
    "efficient",
    "conversations",
    "we",
    "dialogue",
    "human feedback",
    "training",
    "misalignment",
    "chatbot",
    "the open-domain chatbot",
    "deficiency",
    "many open-domain dialogue models",
    "replies",
    "difficulties",
    "annotated human-human conversations"
  ],
  "url": "https://aclanthology.org/2023.acl-long.224/",
  "provenance": {
    "collected_at": "2025-06-05 09:38:27",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}