{
  "id": "2023.acl-long.268",
  "title": "Ethical Considerations for Machine Translation of Indigenous Languages: Giving a Voice to the Speakers",
  "authors": [
    "Mager, Manuel  and\nMager, Elisabeth  and\nKann, Katharina  and\nVu, Ngoc Thang"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "In recent years machine translation has become very successful for high-resource language pairs. This has also sparked new interest in research on the automatic translation of low-resource languages, including Indigenous languages. However, the latter are deeply related to the ethnic and cultural groups that speak (or used to speak) them. The data collection, modeling and deploying machine translation systems thus result in new ethical questions that must be addressed. Motivated by this, we first survey the existing literature on ethical considerations for the documentation, translation, and general natural language processing for Indigenous languages. Afterward, we conduct and analyze an interview study to shed light on the positions of community leaders, teachers, and language activists regarding ethical concerns for the automatic translation of their languages. Our results show that the inclusion, at different degrees, of native speakers and community members is vital to performing better and more ethical research on Indigenous languages.",
  "keywords": [
    "machine translation",
    "we",
    "translation",
    "general natural language processing",
    "natural",
    "machine translation systems",
    "the automatic translation",
    "interview",
    "an interview study",
    "processing",
    "the documentation translation",
    "general",
    "language",
    "machine",
    "modeling"
  ],
  "url": "https://aclanthology.org/2023.acl-long.268/",
  "provenance": {
    "collected_at": "2025-06-05 09:39:03",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}