{
  "id": "2023.semeval-1.208",
  "title": "S}eals{\\_}{L}ab at {S}em{E}val-2023 Task 12: Sentiment Analysis for Low-resource {A}frican Languages, {H}ausa and {I}gbo",
  "authors": [
    "Raychawdhary, Nilanjana  and\nDas, Amit  and\nDozier, Gerry  and\nD. Seals, Cheryl"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "One of the most extensively researched applications in natural language processing (NLP) is sentiment analysis. While the majority of the study focuses on high-resource languages (e.g., English), this research will focus on low-resource African languages namely Igbo and Hausa. The annotated tweets of both languages have a significant number of code-mixed tweets. The curated datasets necessary to build complex AI applications are not available for the majority of African languages. To optimize the use of such datasets, research is needed to determine the viability of present NLP procedures as well as the development of novel techniques. This paper outlines our efforts to develop a sentiment analysis (for positive and negative as well as neutral) system for tweets from the Hausa, and Igbo languages. Sentiment analysis can computationally analyze and discover sentiments in a text or document. We worked on the first thorough compilation of AfriSenti-SemEval 2023 Shared Task 12 Twitter datasets that are human-annotated for the most widely spoken languages in Nigeria, such as Hausa and Igbo. Here we trained the modern pre-trained language model AfriBERTa large on the AfriSenti-SemEval Shared Task 12 Twitter dataset to create sentiment classification. In particular, the results demonstrate that our model trained on AfriSenti-SemEval Shared Task 12 datasets and produced with an F1 score of 80.85% for Hausa and 80.82% for Igbo languages on the sentiment analysis test. In AfriSenti-SemEval 2023 shared task 12 (Task A), we consistently ranked top 10 by achieving a mean F1 score of more than 80% for both the Hausa and Igbo languages.",
  "keywords": [
    "code",
    "we",
    "classification",
    "12 sentiment analysis",
    "natural language processing nlp",
    "natural",
    "a",
    "analysis",
    "afriberta",
    "processing",
    "i",
    "a mean f1 score",
    "text",
    "-",
    "sentiment classification"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.208/",
  "provenance": {
    "collected_at": "2025-06-05 10:29:27",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}