{
  "id": "2023.findings-acl.520",
  "title": "Forecasting Earnings Surprises from Conference Call Transcripts",
  "authors": [
    "Koval, Ross  and\nAndrews, Nicholas  and\nYan, Xifeng"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "There is a multitude of textual data relevant to the financial markets, spanning genres such as financial news, earnings conference calls, and social media posts. Earnings conference calls are one of the most important to information flow as they reflect a direct communication between company executives, financial analysts, and large shareholders. Since these calls contain content that is forward-looking in nature, they can be used to forecast the future performance of the company relative to market expectations. However, they typically contain over 5,000 words of text and large amounts of industry jargon. This length and domain-specific language present problems for many generic pretrained language models. In this work, we introduce a novel task of predicting earnings surprises from earnings call transcripts and contribute a new long document dataset that tests financial understanding with complex signals. We explore a variety of approaches for this long document classification task and establish some strong baselines. Furthermore, we demonstrate that it is possible to predict companies’ future earnings surprises from solely the text of their conference calls with reasonable accuracy. Finally, we probe the models through different interpretability methods and reveal some intuitive explanations of the linguistic features captured that go beyond traditional sentiment analysis.",
  "keywords": [
    "variety",
    "we",
    "classification",
    "it",
    "information",
    "a variety",
    "analysis",
    "text",
    "generic",
    "accuracy",
    "sentiment",
    "work",
    "language",
    "companies",
    "traditional sentiment analysis"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.520/",
  "provenance": {
    "collected_at": "2025-06-05 10:15:41",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}