{
  "id": "2023.findings-acl.348",
  "title": "Retrieval-Based Transformer for Table Augmentation",
  "authors": [
    "Glass, Michael  and\nWu, Xueqing  and\nNaik, Ankita Rajaram  and\nRossiello, Gaetano  and\nGliozzo, Alfio"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Data preparation, also called data wrangling, is considered one of the most expensive and time-consuming steps when performing analytics or building machine learning models. Preparing data typically involves collecting and merging data from complex heterogeneous, and often large-scale data sources, such as data lakes. In this paper, we introduce a novel approach toward automatic data wrangling in an attempt to alleviate the effort of end-users, e.g. data analysts, in structuring dynamic views from data lakes in the form of tabular data. Given a corpus of tables, we propose a retrieval augmented transformer model that is self-trained for the table augmentation tasks of row/column population and data imputation. Our self-learning strategy consists in randomly ablating tables from the corpus and training the retrieval-based model with the objective of reconstructing the partial tables given as input with the original values or headers. We adopt this strategy to first train the dense neural retrieval model encoding portions of tables to vectors, and then the end-to-end model trained to perform table augmentation tasks. We test on EntiTables, the standard benchmark for table augmentation, as well as introduce a new benchmark to advance further research: WebTables. Our model consistently and substantially outperforms both supervised statistical methods and the current state-of-the-art transformer-based models.",
  "keywords": [
    "end",
    "form",
    "we",
    "current",
    "retrieval-based transformer",
    "neural",
    "the objective",
    "machine learning models",
    "self",
    "retrieval",
    "views",
    "learning",
    "dynamic views",
    "objective",
    "the retrieval-based model"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.348/",
  "provenance": {
    "collected_at": "2025-06-05 09:58:08",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}