{
  "id": "2023.acl-long.880",
  "title": "To Revise or Not to Revise: Learning to Detect Improvable Claims for Argumentative Writing Support",
  "authors": [
    "Skitalinskaya, Gabriella  and\nWachsmuth, Henning"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Optimizing the phrasing of argumentative text is crucial in higher education and professional development. However, assessing whether and how the different claims in a text should be revised is a hard task, especially for novice writers. In this work, we explore the main challenges to identifying argumentative claims in need of specific revisions. By learning from collaborative editing behaviors in online debates, we seek to capture implicit revision patterns in order to develop approaches aimed at guiding writers in how to further improve their arguments. We systematically compare the ability of common word embedding models to capture the differences between different versions of the same text, and we analyze their impact on various types of writing issues. To deal with the noisy nature of revision-based corpora, we propose a new sampling strategy based on revision distance. Opposed to approaches from prior work, such sampling can be done without employing additional annotations and judgments. Moreover, we provide evidence that using contextual information and domain knowledge can further improve prediction results. How useful a certain type of context is, depends on the issue the claim is suffering from, though.",
  "keywords": [
    "support",
    "we",
    "information",
    "word",
    "learning",
    "text",
    "work",
    "knowledge",
    "improvable claims",
    "a new sampling strategy",
    "specific revisions",
    "writers",
    "the phrasing",
    "the main challenges",
    "additional annotations"
  ],
  "url": "https://aclanthology.org/2023.acl-long.880/",
  "provenance": {
    "collected_at": "2025-06-05 09:47:44",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}