{
  "id": "2023.findings-acl.670",
  "title": "AUGUST}: an Automatic Generation Understudy for Synthesizing Conversational Recommendation Datasets",
  "authors": [
    "Lu, Yu  and\nBao, Junwei  and\nMa, Zichen  and\nHan, Xiaoguang  and\nWu, Youzheng  and\nCui, Shuguang  and\nHe, Xiaodong"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "High-quality data is essential for conversational recommendation systems and serves as the cornerstone of the network architecture development and training strategy design. Existing works contribute heavy human efforts to manually labeling or designing and extending recommender dialogue templates. However, they suffer from: (i) the limited number of human annotators results in datasets can hardly capture rich and large-scale cases in the real world, (ii) the limited experience and knowledge of annotators accounts for the uninformative corpus and inappropriate recommendations. In this paper, we propose a novel automatic dataset synthesis approach that can generate large-scale and high-quality recommendation dialogues through a data2text generation process, where unstructured recommendation conversations are generated from structured graphs based on user-item information from the real world. In doing so, we comprehensively exploit: (i) rich personalized user profiles from traditional recommendation datasets, (ii) rich external knowledge from knowledge graphs, and (iii) the conversation ability contained in human-to-human conversational recommendation datasets. Extensive experiments validate the benefit brought by the automatically synthesized data under low-resource scenarios, and demonstrate the promising potential to facilitate developing a more effective conversational recommendation system.",
  "keywords": [
    "recommender dialogue templates",
    "the limited experience",
    "human-to-human conversational recommendation datasets",
    "conversations",
    "a data2text generation process",
    "we",
    "dialogue",
    "training",
    "an automatic generation understudy",
    "information",
    "knowledge graphs",
    "rich",
    "conversational recommendation systems",
    "unstructured recommendation conversations",
    "i"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.670/",
  "provenance": {
    "collected_at": "2025-06-05 10:17:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}