{
  "id": "2023.findings-acl.296",
  "title": "H}onest{B}ait: Forward References for Attractive but Faithful Headline Generation",
  "authors": [
    "Chen, Chih Yao  and\nWu, Dennis  and\nKu, Lun-Wei"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Current methods for generating attractive headlines often learn directly from data, which bases attractiveness on the number of user clicks and views. Although clicks or views do reflect user interest, they can fail to reveal how much interest is raised by the writing style and how much is due to the event or topic itself. Also, such approaches can lead to harmful inventions by over-exaggerating the content, aggravating the spread of false information. In this work, we propose HonestBait, a novel framework for solving these issues from another aspect: generating headlines using forward references (FRs), a writing technique often used for clickbait. A self-verification process is included during training to avoid spurious inventions. We begin with a preliminary user study to understand how FRs affect user interest, after which we present PANCO, an innovative dataset containing pairs of fake news with verified news for attractive but faithful news headline generation. Auto matic metrics and human evaluations show that our framework yields more attractive results (+11.25% compared to human-written verified news headlines) while maintaining high veracity, which helps promote real information to fight against fake news.",
  "keywords": [
    "another aspect generating headlines",
    "we",
    "current",
    "training",
    "self",
    "verified",
    "information",
    "human-written verified news headlines",
    "views",
    "metrics",
    "human evaluations",
    "work",
    "process",
    "generating",
    "generation"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.296/",
  "provenance": {
    "collected_at": "2025-06-05 09:57:22",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}