{
  "id": "2023.nlrse-1.7",
  "title": "Knowledge-Augmented Language Model Prompting for Zero-Shot Knowledge Graph Question Answering",
  "authors": [
    "Baek, Jinheon  and\nAji, Alham Fikri  and\nSaffari, Amir"
  ],
  "year": "2023",
  "venue": "Proceedings of the 1st Workshop on Natural Language Reasoning and Structured Explanations (NLRSE)",
  "abstract": "Large Language Models (LLMs) are capable of performing zero-shot closed-book question answering tasks, based on their internal knowledge stored in parameters during pre-training. However, such internalized knowledge might be insufficient and incorrect, which could lead LLMs to generate factually wrong answers. Furthermore, fine-tuning LLMs to update their knowledge is expensive. To this end, we propose to augment the knowledge directly in the input of LLMs. Specifically, we first retrieve the relevant facts to the input question from the knowledge graph based on semantic similarities between the question and its associated facts. After that, we prepend the retrieved facts to the input question in the form of the prompt, which is then forwarded to LLMs to generate the answer. Our framework, Knowledge-Augmented language model PromptING (KAPING), requires no model training, thus completely zero-shot. We validate the performance of our KAPING framework on the knowledge graph question answering task, that aims to answer the user’s question based on facts over a knowledge graph, on which ours outperforms relevant zero-shot baselines by up to 48% in average, across multiple LLMs of various sizes.",
  "keywords": [
    "end",
    "semantic similarities",
    "the knowledge graph",
    "question",
    "form",
    "semantic",
    "we",
    "graph",
    "shot",
    "training",
    "zero-shot knowledge graph question",
    "answer",
    "multiple llms",
    "furthermore fine-tuning llms",
    "llms"
  ],
  "url": "https://aclanthology.org/2023.nlrse-1.7/",
  "provenance": {
    "collected_at": "2025-06-05 10:26:08",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}