{
  "id": "2023.acl-long.217",
  "title": "Cross-lingual Continual Learning",
  "authors": [
    "M{'}hamdi, Meryem  and\nRen, Xiang  and\nMay, Jonathan"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "The longstanding goal of multi-lingual learning has been to develop a universal cross-lingual model that can withstand the changes in multi-lingual data distributions. There has been a large amount of work to adapt such multi-lingual models to unseen target languages. However, the majority of work in this direction focuses on the standard one-hop transfer learning pipeline from source to target languages, whereas in realistic scenarios, new languages can be incorporated at any time in a sequential manner. In this paper, we present a principled Cross-lingual Continual Learning (CCL) evaluation paradigm, where we analyze different categories of approaches used to continually adapt to emerging data from different languages. We provide insights into what makes multilingual sequential learning particularly challenging. To surmount such challenges, we benchmark a representative set of cross-lingual continual learning algorithms and analyze their knowledge preservation, accumulation, and generalization capabilities compared to baselines on carefully curated datastreams. The implications of this analysis include a recipe for how to measure and balance different cross-lingual continual learning desiderata, which go beyond conventional transfer learning.",
  "keywords": [
    "we",
    "cross",
    "a sequential manner",
    "learning",
    "transfer",
    "analysis",
    "manner",
    "conventional transfer learning",
    "categories",
    "generalization",
    "work",
    "knowledge",
    "model",
    "capabilities",
    "evaluation"
  ],
  "url": "https://aclanthology.org/2023.acl-long.217/",
  "provenance": {
    "collected_at": "2025-06-05 09:38:21",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}