{
  "id": "2023.semeval-1.218",
  "title": "DSH}acker at {S}em{E}val-2023 Task 3: Genres and Persuasion Techniques Detection with Multilingual Data Augmentation through Machine Translation and Text Generation",
  "authors": [
    "Modzelewski, Arkadiusz  and\nSosnowski, Witold  and\nWilczynska, Magdalena  and\nWierzbicki, Adam"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "In our article, we present the systems developed for SemEval-2023 Task 3, which aimed to evaluate the ability of Natural Language Processing (NLP) systems to detect genres and persuasion techniques in multiple languages. We experimented with several data augmentation techniques, including machine translation (MT) and text generation. For genre detection, synthetic texts for each class were created using the OpenAI GPT-3 Davinci language model. In contrast, to detect persuasion techniques, we relied on augmenting the dataset through text translation using the DeepL translator. Fine-tuning the models using augmented data resulted in a top-ten ranking across all languages, indicating the effectiveness of the approach. The models for genre detection demonstrated excellent performance, securing the first, second, and third positions in Spanish, German, and Italian, respectively. Moreover, one of the models for persuasion techniques’ detection secured the third position in Polish. Our contribution constitutes the system architecture that utilizes DeepL and GPT-3 for data augmentation for the purpose of detecting both genre and persuasion techniques.",
  "keywords": [
    "machine translation",
    "we",
    "text generation",
    "translation",
    "the openai gpt-3",
    "natural",
    "gpt-3",
    "machine translation mt",
    "processing",
    "davinci language model",
    "text",
    "fine",
    "generation",
    "language",
    "nlp"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.218/",
  "provenance": {
    "collected_at": "2025-06-05 10:29:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}