{
  "id": "2023.acl-long.798",
  "title": "Towards Understanding Omission in Dialogue Summarization",
  "authors": [
    "Zou, Yicheng  and\nSong, Kaitao  and\nTan, Xu  and\nFu, Zhongkai  and\nZhang, Qi  and\nLi, Dongsheng  and\nGui, Tao"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Dialogue summarization aims to condense the lengthy dialogue into a concise summary, and has recently achieved significant progress. However, the result of existing methods is still far from satisfactory. Previous works indicated that omission is a major factor in affecting the quality of summarization, but few of them have further explored the omission problem, such as how omission affects summarization results and how to detect omission, which is critical for reducing omission and improving summarization quality. Moreover, analyzing and detecting omission relies on summarization datasets with omission labels (i.e., which dialogue utterances are omitted in the summarization), which are not available in the current literature. In this paper, we propose the OLDS dataset, which provides high-quality omission labels for dialogue summarization. By analyzing this dataset, we find that a large improvement in summarization quality can be achieved by providing ground-truth omission labels for the summarization model to recover omission information, which demonstrates the importance of omission detection for omission mitigation in dialogue summarization. Therefore, we formulate an omission detection task and demonstrate our proposed dataset can support the training and evaluation of this task well. We also call for research action on omission detection based on our proposed datasets. Our dataset and codes are publicly available.",
  "keywords": [
    "dialogue utterances",
    "the lengthy dialogue",
    "summarization",
    "we",
    "dialogue",
    "current",
    "dialogue summarization dialogue summarization",
    "training",
    "information",
    "summarization results",
    "dialogue summarization",
    "the summarization model",
    "summarization quality",
    "the summarization",
    "action"
  ],
  "url": "https://aclanthology.org/2023.acl-long.798/",
  "provenance": {
    "collected_at": "2025-06-05 09:46:30",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}