{
  "id": "2023.findings-acl.568",
  "title": "What to Fuse and How to Fuse: Exploring Emotion and Personality Fusion Strategies for Explainable Mental Disorder Detection",
  "authors": [
    "Zanwar, Sourabh  and\nLi, Xiaofei  and\nWiechmann, Daniel  and\nQiao, Yu  and\nKerz, Elma"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Mental health disorders (MHD) are increasingly prevalent worldwide and constitute one of the greatest challenges facing our healthcare systems and modern societies in general. In response to this societal challenge, there has been a surge in digital mental health research geared towards the development of new techniques for unobtrusive and efficient automatic detection of MHD. Within this area of research, natural language processing techniques are playing an increasingly important role, showing promising detection results from a variety of textual data. Recently, there has been a growing interest in improving mental illness detection from textual data by way of leveraging emotions: ‘Emotion fusion’ refers to the process of integrating emotion information with general textual information to obtain enhanced information for decision-making. However, while the available research has shown that MHD prediction can be improved through a variety of different fusion strategies, previous works have been confined to a particular fusion strategy applied to a specific dataset, and so is limited by the lack of meaningful comparability. In this work, we integrate and extend this research by conducting extensive experiments with three types of deep learning-based fusion strategies: (i) feature-level fusion, where a pre-trained masked language model for mental health detection (MentalRoBERTa) was infused with a comprehensive set of engineered features, (ii) model fusion, where the MentalRoBERTa model was infused with hidden representations of other language models and (iii) task fusion, where a multi-task framework was leveraged to learn the features for auxiliary tasks. In addition to exploring the role of different fusion strategies, we expand on previous work by broadening the information infusion to include a second domain related to mental health, namely personality. We evaluate algorithm performance on data from two benchmark datasets, encompassing five mental health conditions: attention deficit hyperactivity disorder, anxiety, bipolar disorder, depression and psychological stress.",
  "keywords": [
    "deep",
    "variety",
    "efficient",
    "deep learning-based fusion strategies",
    "we",
    "fusion",
    "natural",
    "other language models",
    "general textual information",
    "information",
    "learning",
    "personality fusion strategies",
    "a variety",
    "this societal challenge",
    "mentalroberta"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.568/",
  "provenance": {
    "collected_at": "2025-06-05 10:16:20",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}