{
  "id": "2023.acl-long.616",
  "title": "Your spouse needs professional help: Determining the Contextual Appropriateness of Messages through Modeling Social Relationships",
  "authors": [
    "Jurgens, David  and\nSeth, Agrima  and\nSargent, Jackson  and\nAghighi, Athena  and\nGeraci, Michael"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Understanding interpersonal communication requires, in part, understanding the social context and norms in which a message is said. However, current methods for identifying offensive content in such communication largely operate independent of context, with only a few approaches considering community norms or prior conversation as context. Here, we introduce a new approach to identifying inappropriate communication by explicitly modeling the social relationship between the individuals. We introduce a new dataset of contextually-situated judgments of appropriateness and show that large language models can readily incorporate relationship information to accurately identify appropriateness in a given context. Using data from online conversations and movie dialogues, we provide insight into how the relationships themselves function as implicit norms and quantify the degree to which context-sensitivity is needed in different conversation settings. Further, we also demonstrate that contextual-appropriateness judgments are predictive of other social factors expressed in language such as condescension and politeness.",
  "keywords": [
    "different conversation settings",
    "conversations",
    "we",
    "current",
    "information",
    "prior conversation",
    "language",
    "movie dialogues",
    "movie",
    "dialogues",
    "large language models",
    "conversation",
    "online conversations",
    "approach",
    "norms"
  ],
  "url": "https://aclanthology.org/2023.acl-long.616/",
  "provenance": {
    "collected_at": "2025-06-05 09:43:54",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}