{
  "id": "2023.acl-long.405",
  "title": "MMD}ialog: A Large-scale Multi-turn Dialogue Dataset Towards Multi-modal Open-domain Conversation",
  "authors": [
    "Feng, Jiazhan  and\nSun, Qingfeng  and\nXu, Can  and\nZhao, Pu  and\nYang, Yaming  and\nTao, Chongyang  and\nZhao, Dongyan  and\nLin, Qingwei"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Responding with multi-modal content has been recognized as an essential capability for an intelligent conversational agent. In this paper, we introduce the MMDialog dataset to facilitate multi-modal conversation better. MMDialog is composed of a curated set of 1.08 million real-world dialogues with 1.53 million unique images across 4,184 topics. MMDialog has two main and unique advantages. First, it is the largest multi-modal conversation dataset by the number of dialogues by 88x. Second, it contains massive topics to generalize the open domain. To build an engaging dialogue system with this dataset, we propose and normalize two response prediction tasks based on retrieval and generative scenarios. In addition, we build two baselines for the above tasks with state-of-the-art techniques and report their experimental performance. We also propose a novel evaluation metric MM-Relevance to measure the multi-modal responses. Our dataset is available inhttps://github.com/victorsungo/MMDialog.",
  "keywords": [
    "an engaging dialogue system",
    "we",
    "dialogue",
    "multi-modal conversation",
    "ialog",
    "it",
    "retrieval",
    "generative",
    "metric",
    "generative scenarios",
    "an intelligent conversational agent",
    "multi-modal open-domain conversation",
    "dialogues",
    "conversational",
    "conversation"
  ],
  "url": "https://aclanthology.org/2023.acl-long.405/",
  "provenance": {
    "collected_at": "2025-06-05 09:40:54",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}