{
  "id": "2023.acl-long.124",
  "title": "Denoising Bottleneck with Mutual Information Maximization for Video Multimodal Fusion",
  "authors": [
    "Wu, Shaoxiang  and\nDai, Damai  and\nQin, Ziwei  and\nLiu, Tianyu  and\nLin, Binghuai  and\nCao, Yunbo  and\nSui, Zhifang"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Video multimodal fusion aims to integrate multimodal signals in videos, such as visual, audio and text, to make a complementary prediction with multiple modalities contents. However, unlike other image-text multimodal tasks, video has longer multimodal sequences with more redundancy and noise in both visual and audio modalities. Prior denoising methods like forget gate are coarse in the granularity of noise filtering. They often suppress the redundant and noisy information at the risk of losing critical information. Therefore, we propose a denoising bottleneck fusion (DBF) model for fine-grained video multimodal fusion. On the one hand, we employ a bottleneck mechanism to filter out noise and redundancy with a restrained receptive field. On the other hand, we use a mutual information maximization module to regulate the filter-out module to preserve key information within different modalities. Our DBF model achieves significant improvement over current state-of-the-art baselines on multiple benchmarks covering multimodal sentiment analysis and multimodal summarization tasks. It proves that our model can effectively capture salient features from noisy and redundant video, audio, and text inputs. The code for this paper will be publicly available athttps://github.com/WSXRHFG/DBF",
  "keywords": [
    "code",
    "field",
    "summarization",
    "we",
    "fusion",
    "current",
    "salient features",
    "multiple modalities contents",
    "it",
    "information",
    "a restrained receptive field",
    "multimodal sentiment analysis",
    "visual",
    "different modalities",
    "analysis"
  ],
  "url": "https://aclanthology.org/2023.acl-long.124/",
  "provenance": {
    "collected_at": "2025-06-05 09:37:02",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}