{
  "id": "2023.dialdoc-1.8",
  "title": "A Dialogue System for Assessing Activities of Daily Living: Improving Consistency with Grounded Knowledge",
  "authors": [
    "Sheng, Zhecheng  and\nFinzel, Raymond  and\nLucke, Michael  and\nDufresne, Sheena  and\nGini, Maria  and\nPakhomov, Serguei"
  ],
  "year": "2023",
  "venue": "Proceedings of the Third DialDoc Workshop on Document-grounded Dialogue and Conversational Question Answering",
  "abstract": "In healthcare, the ability to care for oneself is reflected in the “Activities of Daily Living (ADL),” which serve as a measure of functional ability (functioning). A lack of functioning may lead to poor living conditions requiring personal care and assistance. To accurately identify those in need of support, assistance programs continuously evaluate participants’ functioning across various domains. However, the assessment process may encounter consistency issues when multiple assessors with varying levels of expertise are involved. Novice assessors, in particular, may lack the necessary preparation for real-world interactions with participants. To address this issue, we developed a dialogue system that simulates interactions between assessors and individuals of varying functioning in a natural and reproducible way. The dialogue system consists of two major modules, one for natural language understanding (NLU) and one for natural language generation (NLG), respectively. In order to generate responses consistent with the underlying knowledge base, the dialogue system requires both an understanding of the user’s query and of biographical details of an individual being simulated. To fulfill this requirement, we experimented with query classification and generated responses based on those biographical details using some recently released InstructGPT-like models.",
  "keywords": [
    "support",
    "we",
    "dialogue",
    "a dialogue system",
    "classification",
    "natural",
    "natural language generation",
    "natural language",
    "instructgpt",
    "query classification",
    "the activities",
    "activities",
    "process",
    "knowledge",
    "language"
  ],
  "url": "https://aclanthology.org/2023.dialdoc-1.8/",
  "provenance": {
    "collected_at": "2025-06-05 10:24:28",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}