{
  "id": "2023.acl-long.503",
  "title": "Knowledgeable Parameter Efficient Tuning Network for Commonsense Question Answering",
  "authors": [
    "Zhao, Ziwang  and\nHu, Linmei  and\nZhao, Hanyu  and\nShao, Yingxia  and\nWang, Yequan"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Commonsense question answering is important for making decisions about everyday matters. Although existing commonsense question answering works based on fully fine-tuned PLMs have achieved promising results, they suffer from prohibitive computation costs as well as poor interpretability. Some works improve the PLMs by incorporating knowledge to provide certain evidence, via elaborately designed GNN modules which require expertise. In this paper, we propose a simple knowledgeable parameter efficient tuning network to couple PLMs with external knowledge for commonsense question answering. Specifically, we design a trainable parameter-sharing adapter attached to a parameter-freezing PLM to incorporate knowledge at a small cost. The adapter is equipped with both entity- and query-related knowledge via two auxiliary knowledge-related tasks (i.e., span masking and relation discrimination). To make the adapter focus on the relevant knowledge, we design gating and attention mechanisms to respectively filter and fuse the query information from the PLM. Extensive experiments on two benchmark datasets show that KPE is parameter-efficient and can effectively incorporate knowledge for improving commonsense question answering.",
  "keywords": [
    "efficient",
    "question",
    "we",
    "parameter",
    "information",
    "commonsense question answering",
    "tuning",
    "answering",
    "knowledge",
    "network",
    "attention",
    "gating and attention mechanisms",
    "promising",
    "gating",
    "external knowledge"
  ],
  "url": "https://aclanthology.org/2023.acl-long.503/",
  "provenance": {
    "collected_at": "2025-06-05 09:42:14",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}