{
  "id": "2023.bea-1.64",
  "title": "The {BEA} 2023 Shared Task on Generating {AI} Teacher Responses in Educational Dialogues",
  "authors": [
    "Tack, Ana{\\\"i}s  and\nKochmar, Ekaterina  and\nYuan, Zheng  and\nBibauw, Serge  and\nPiech, Chris"
  ],
  "year": "2023",
  "venue": "Proceedings of the 18th Workshop on Innovative Use of NLP for Building Educational Applications (BEA 2023)",
  "abstract": "This paper describes the results of the first shared task on generation of teacher responses in educational dialogues. The goal of the task was to benchmark the ability of generative language models to act as AI teachers, replying to a student in a teacher-student dialogue. Eight teams participated in the competition hosted on CodaLab and experimented with a wide variety of state-of-the-art models, including Alpaca, Bloom, DialoGPT, DistilGPT-2, Flan-T5, GPT- 2, GPT-3, GPT-4, LLaMA, OPT-2.7B, and T5- base. Their submissions were automatically scored using BERTScore and DialogRPT metrics, and the top three among them were further manually evaluated in terms of pedagogical ability based on Tack and Piech (2022). The NAISTeacher system, which ranked first in both automated and human evaluation, generated responses with GPT-3.5 Turbo using an ensemble of prompts and DialogRPT-based ranking of responses for given dialogue contexts. Despite promising achievements of the participating teams, the results also highlight the need for evaluation metrics better suited to educational contexts.",
  "keywords": [
    "variety",
    "bertscore and dialogrpt metrics",
    "gpt-3 5 turbo",
    "dialogue",
    "alpaca bloom dialogpt",
    "dialogpt",
    "a wide variety",
    "ensemble",
    "bertscore",
    "educational dialogues",
    "gpt-3",
    "generative language models",
    "distilgpt-2",
    "a teacher-student dialogue",
    "an ensemble"
  ],
  "url": "https://aclanthology.org/2023.bea-1.64/",
  "provenance": {
    "collected_at": "2025-06-05 10:22:06",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}