{
  "id": "2023.semeval-1.73",
  "title": "JUST}{\\_}{ONE} at {S}em{E}val-2023 Task 10: Explainable Detection of Online Sexism ({EDOS})",
  "authors": [
    "Obeidat, Doaa  and\nShnaigat, Wala{'}a  and\nNammas, Heba  and\nAbdullah, Malak"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "The problem of online sexism, which refers to offensive content targeting women based on their gender or the intersection of their gender with one or more additional identity characteristics, such as race or religion, has become a widespread phenomenon on social media. This can include sexist comments and memes. To address this issue, the SemEval-2023 international workshop introduced the “Explainable Detection of Online Sexism Challenge”, which aims to explain the classifications given by AI models for detecting sexism. In this paper, we present the contributions of our team, JUSTONE, to all three sub-tasks of the challenge: subtask A, a binary classification task; subtask B, a four-class classification task; and subtask C, a fine-grained classification task. To accomplish this, we utilized pre-trained language models, specifically BERT and RoBERTa from Hugging Face, and a selective ensemble method in task 10 of the SemEval 2023 competition. As a result, our team achieved the following rankings and scores in different tasks: 19th out of 84 with a Macro-F1 score of 0.8538 in task A, 22nd out of 69 with a Macro-F1 score of 0.6417 in task B, and 14th out of 63 with a Macro-F1 score of 0.4774 in task C.",
  "keywords": [
    "roberta",
    "a macro-f1 score",
    "b",
    "we",
    "classification",
    "ensemble",
    "c",
    "the classifications",
    "bert",
    "-",
    "a fine-grained classification task",
    "language",
    "class",
    "a four-class classification task",
    "pre"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.73/",
  "provenance": {
    "collected_at": "2025-06-05 10:27:38",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}