{
  "id": "2023.findings-acl.428",
  "title": "RQUGE}: Reference-Free Metric for Evaluating Question Generation by Answering the Question",
  "authors": [
    "Mohammadshahi, Alireza  and\nScialom, Thomas  and\nYazdani, Majid  and\nYanki, Pouya  and\nFan, Angela  and\nHenderson, James  and\nSaeidi, Marzieh"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Existing metrics for evaluating the quality of automatically generated questions such as BLEU, ROUGE, BERTScore, and BLEURT compare the reference and predicted questions, providing a high score when there is a considerable lexical overlap or semantic similarity between the candidate and the reference questions. This approach has two major shortcomings. First, we need expensive human-provided reference questions. Second, it penalises valid questions that may not have high lexical or semantic similarity to the reference questions. In this paper, we propose a new metric, RQUGE, based on the answerability of the candidate question given the context. The metric consists of a question-answering and a span scorer modules, using pre-trained models from existing literature, thus it can be used without any further training. We demonstrate that RQUGE has a higher correlation with human judgment without relying on the reference question. Additionally, RQUGE is shown to be more robust to several adversarial corruptions. Furthermore, we illustrate that we can significantly improve the performance of QA models on out-of-domain datasets by fine-tuning on synthetic data generated by a question generation model and reranked by RQUGE.",
  "keywords": [
    "automatically generated questions",
    "bleurt",
    "qa models",
    "bleu",
    "question",
    "semantic",
    "we",
    "valid",
    "semantic similarity",
    "training",
    "fine-tuning",
    "bertscore",
    "it",
    "bleu rouge bertscore",
    "a question generation model"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.428/",
  "provenance": {
    "collected_at": "2025-06-05 10:14:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}