{
  "id": "2023.clinicalnlp-1.47",
  "title": "Utterance Classification with Logical Neural Network: Explainable {AI} for Mental Disorder Diagnosis",
  "authors": [
    "Toleubay, Yeldar  and\nAgravante, Don Joven  and\nKimura, Daiki  and\nLin, Baihan  and\nBouneffouf, Djallel  and\nTatsubori, Michiaki"
  ],
  "year": "2023",
  "venue": "Proceedings of the 5th Clinical Natural Language Processing Workshop",
  "abstract": "In response to the global challenge of mental health problems, we proposes a Logical Neural Network (LNN) based Neuro-Symbolic AI method for the diagnosis of mental disorders. Due to the lack of effective therapy coverage for mental disorders, there is a need for an AI solution that can assist therapists with the diagnosis. However, current Neural Network models lack explainability and may not be trusted by therapists. The LNN is a Recurrent Neural Network architecture that combines the learning capabilities of neural networks with the reasoning capabilities of classical logic-based AI. The proposed system uses input predicates from clinical interviews to output a mental disorder class, and different predicate pruning techniques are used to achieve scalability and higher scores. In addition, we provide an insight extraction method to aid therapists with their diagnosis. The proposed system addresses the lack of explainability of current Neural Network models and provides a more trustworthy solution for mental disorder diagnosis.",
  "keywords": [
    "extraction",
    "clinical interviews",
    "current neural network models",
    "a logical neural network",
    "we",
    "interviews",
    "current",
    "classification",
    "neural",
    "the learning capabilities",
    "recurrent",
    "the reasoning capabilities",
    "neural networks",
    "class",
    "capabilities"
  ],
  "url": "https://aclanthology.org/2023.clinicalnlp-1.47/",
  "provenance": {
    "collected_at": "2025-06-05 10:23:55",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}