{
  "id": "2023.semeval-1.211",
  "title": "P}anwar{J}ayant at {S}em{E}val-2023 Task 10: Exploring the Effectiveness of Conventional Machine Learning Techniques for Online Sexism Detection",
  "authors": [
    "Panwar, Jayant  and\nMamidi, Radhika"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "The rapid growth of online communication using social media platforms has led to an increase in the presence of hate speech, especially in terms of sexist language online. The proliferation of such hate speech has a significant impact on the mental health and well-being of the users and hence the need for automated systems to detect and filter such texts. In this study, we explore the effectiveness of conventional machine learning techniques for detecting sexist text. We explore five conventional classifiers, namely, Logistic Regression, Decision Tree, XGBoost, Support Vector Machines, and Random Forest. The results show that different classifiers perform differently on each task due to their different inherent architectures which may be suited to a certain problem more. These models are trained on the shared task dataset, which includes both sexist and non-sexist texts. All in all, this study explores the potential of conventional machine learning techniques in detecting online sexist content. The results of this study highlight the strengths and weaknesses of all classifiers with respect to all subtasks. The results of this study will be useful for researchers and practitioners interested in developing systems for detecting or filtering online hate speech.",
  "keywords": [
    "em",
    "support",
    "classifiers",
    "we",
    "conventional machine learning techniques",
    "all classifiers",
    "five conventional classifiers",
    "different classifiers",
    "random forest",
    "vector",
    "xgboost support vector machines",
    "text",
    "practitioners",
    "language",
    "random"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.211/",
  "provenance": {
    "collected_at": "2025-06-05 10:29:30",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}