{
  "id": "2023.findings-acl.867",
  "title": "Model Interpretability and Rationale Extraction by Input Mask Optimization",
  "authors": [
    "Brinner, Marc  and\nZarrie{\\ss}, Sina"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Concurrent with the rapid progress in neural network-based models in NLP, the need for creating explanations for the predictions of these black-box models has risen steadily. Yet, especially for complex inputs like texts or images, existing interpretability methods still struggle with deriving easily interpretable explanations that also accurately represent the basis for the model’s decision. To this end, we propose a new, model-agnostic method to generate extractive explanations for predictions made by neural networks, that is based on masking parts of the input which the model does not consider to be indicative of the respective class. The masking is done using gradient-based optimization combined with a new regularization scheme that enforces sufficiency, comprehensiveness, and compactness of the generated explanation. Our method achieves state-of-the-art results in a challenging paragraph-level rationale extraction task, showing that this task can be performed without training a specialized model. We further apply our method to image inputs and obtain high-quality explanations for image classifications, which indicates that the objectives for optimizing explanation masks in text generalize to inputs of other modalities.",
  "keywords": [
    "objectives",
    "end",
    "gradient-based optimization",
    "extraction",
    "image classifications",
    "sufficiency",
    "we",
    "other modalities",
    "input mask optimization",
    "neural",
    "sufficiency comprehensiveness",
    "neural networks",
    "text",
    "the generated explanation",
    "nlp"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.867/",
  "provenance": {
    "collected_at": "2025-06-05 10:20:25",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}