{
  "id": "2023.findings-acl.453",
  "title": "I} run as fast as a rabbit, can you? A Multilingual Simile Dialogues Datasets",
  "authors": [
    "Ma, Longxuan  and\nZhang, Wei-Nan  and\nZhou, Shuhan  and\nSun, Churui  and\nKe, Changxin  and\nLiu, Ting"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "A simile is a figure of speech that compares two different things (called the tenor and the vehicle) via shared properties. The tenor and the vehicle are usually connected with comparator words such as “like” or “as”. The simile phenomena are unique and complex in a real-life dialogue scene where the tenor and the vehicle can be verbal phrases or sentences, mentioned by different speakers, exist in different sentences, or occur in reversed order. However, the current simile research usually focuses on similes in a triplet tuple (tenor, property, vehicle) or a single sentence where the tenor and vehicle are usually entities or noun phrases, which could not reflect complex simile phenomena in real scenarios. In this paper, we propose a novel and high-quality multilingual simile dialogue (MSD) dataset to facilitate the study of complex simile phenomena. The MSD is the largest manually annotated simile data (~21K) and it contains both English and Chinese data. Meanwhile, the MSD data can also be used on dialogue tasks to test the ability of dialogue systems when using similes. We design 3 simile tasks (recognition, interpretation, and generation) and 2 dialogue tasks (retrieval and generation) with MSD. For each task, we provide experimental results from strong pre-trained or state-of-the-art models. The experiments demonstrate the challenge of MSD and we will release the data/code on GitHub.",
  "keywords": [
    "code",
    "we",
    "dialogue",
    "current",
    "it",
    "dialogue systems",
    "dialogue tasks",
    "properties",
    "retrieval",
    "a real-life dialogue scene",
    "i",
    "2 dialogue tasks retrieval",
    "generation",
    "entities",
    "shared properties"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.453/",
  "provenance": {
    "collected_at": "2025-06-05 10:14:46",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}