{
  "id": "2023.findings-acl.833",
  "title": "Fighting Bias With Bias: Promoting Model Robustness by Amplifying Dataset Biases",
  "authors": [
    "Reif, Yuval  and\nSchwartz, Roy"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "NLP models often rely on superficial cues known as dataset biases to achieve impressive performance, and can fail on examples where these biases do not hold. Recent work sought to develop robust, unbiased models by filtering biased examples from training sets. In this work, we argue that such filtering can obscure the true capabilities of models to overcome biases, which might never be removed in full from the dataset. We suggest that in order to drive the development of models robust to subtle biases, dataset biases should be amplified in the training set. We introduce an evaluation framework defined by a bias-amplified training set and an anti-biased test set, both automatically extracted from existing datasets. Experiments across three notions of bias, four datasets and two models show that our framework is substantially more challenging for models than the original data splits, and even more challenging than hand-crafted challenge sets. Our evaluation framework can use any existing dataset, even those considered obsolete, to test model robustness. We hope our work will guide the development of robust models that do not rely on superficial biases and correlations. To this end, we publicly release our code and data.",
  "keywords": [
    "code",
    "bias",
    "our evaluation framework",
    "end",
    "robust unbiased models",
    "unbiased",
    "we",
    "training",
    "the true capabilities",
    "nlp models",
    "biased",
    "an evaluation framework",
    "subtle biases",
    "a bias-amplified training set",
    "fighting bias"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.833/",
  "provenance": {
    "collected_at": "2025-06-05 10:19:57",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}