{
  "id": "2023.acl-long.414",
  "title": "Linguistic representations for fewer-shot relation extraction across domains",
  "authors": [
    "Gururaja, Sireesh  and\nDutt, Ritam  and\nLiao, Tinglong  and\nRos{\\'e}, Carolyn"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Recent work has demonstrated the positive impact of incorporating linguistic representations as additional context and scaffolds on the in-domain performance of several NLP tasks. We extend this work by exploring the impact of linguistic representations on cross-domain performance in a few-shot transfer setting. An important question is whether linguistic representations enhance generalizability by providing features that function as cross-domain pivots. We focus on the task of relation extraction on three datasets of procedural text in two domains, cooking and materials science. Our approach augments a popular transformer-based architecture by alternately incorporating syntactic and semantic graphs constructed by freely available off-the-shelf tools. We examine their utility for enhancing generalization, and investigate whether earlier findings, e.g. that semantic representations can be more helpful than syntactic ones, extend to relation extraction in multiple domains. We find that while the inclusion of these graphs results in significantly higher performance in few-shot transfer, both types of graph exhibit roughly equivalent utility.",
  "keywords": [
    "extraction",
    "question",
    "semantic",
    "we",
    "generalizability",
    "graph",
    "several nlp tasks",
    "shot",
    "cross",
    "syntactic and semantic graphs",
    "science",
    "transfer",
    "earlier findings",
    "semantic representations",
    "text"
  ],
  "url": "https://aclanthology.org/2023.acl-long.414/",
  "provenance": {
    "collected_at": "2025-06-05 09:41:01",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}