{
  "id": "2023.iwslt-1.19",
  "title": "BUT} Systems for {IWSLT} 2023 {M}arathi - {H}indi Low Resource Speech Translation Task",
  "authors": [
    "Kesiraju, Santosh  and\nBene{\\v{s}}, Karel  and\nTikhonov, Maksim  and\n{\\v{C}}ernock{\\'y}, Jan"
  ],
  "year": "2023",
  "venue": "Proceedings of the 20th International Conference on Spoken Language Translation (IWSLT 2023)",
  "abstract": "This paper describes the systems submitted for Marathi to Hindi low-resource speech translation task. Our primary submission is based on an end-to-end direct speech translation system, whereas the contrastive one is a cascaded system. The backbone of both the systems is a Hindi-Marathi bilingual ASR system trained on 2790 hours of imperfect transcribed speech. The end-to-end speech translation system was directly initialized from the ASR, and then fine-tuned for direct speech translation with an auxiliary CTC loss for translation. The MT model for the cascaded system is initialized from a cross-lingual language model, which was then fine-tuned using 1.6 M parallel sentences. All our systems were trained from scratch on publicly available datasets. In the end, we use a language model to re-score the n-best hypotheses. Our primary submission achieved 30.5 and 39.6 BLEU whereas the contrastive system obtained 21.7 and 28.6 BLEU on official dev and test sets respectively. The paper also presents the analysis on several experiments that were conducted and outlines the strategies for improving speech translation in low-resource scenarios.",
  "keywords": [
    "end",
    "bleu",
    "we",
    "direct speech translation",
    "translation",
    "cross",
    "the strategies",
    "loss",
    "speech translation",
    "a cross-lingual language model",
    "analysis",
    "a language model",
    "strategies",
    "language",
    "model"
  ],
  "url": "https://aclanthology.org/2023.iwslt-1.19/",
  "provenance": {
    "collected_at": "2025-06-05 10:24:53",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}