{
  "id": "2023.findings-acl.489",
  "title": "Towards Better Hierarchical Text Classification with Data Generation",
  "authors": [
    "Wang, Yue  and\nQiao, Dan  and\nLi, Juntao  and\nChang, Jinxiong  and\nZhang, Qishen  and\nLiu, Zhongyi  and\nZhang, Guannan  and\nZhang, Min"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Hierarchical text classification (HTC) focuses on classifying one text into multiple labels, which are organized as a hierarchical taxonomy. Due to its wide involution in realistic scenarios, HTC attracts long-term attention from both industry and academia. However, the high cost of hierarchical multi-label annotation makes HTC suffer from the data scarcity problem. In view of the difficulty in balancing the controllability of multiple structural labels and text diversity, automatically generating high-quality data for HTC is challenging and under-explored. To fill this blank, we propose a novel data generation framework tailored for HTC, which can achieve both label controllability and text diversity by extracting high-quality semantic-level and phrase-level hierarchical label information. Experimental results on three benchmarks demonstrate that, compared with existing data augmentation methods, the data generated from our method can bring the most significant performance improvements of several strong HTC models. Extensive analysis confirms that the improvements yielded by our proposed method do correlate to the enhancement of label controllability and text diversity.",
  "keywords": [
    "semantic",
    "we",
    "a hierarchical taxonomy",
    "classification",
    "information",
    "better hierarchical text classification",
    "analysis",
    "text",
    "hierarchical multi-label annotation",
    "hierarchical",
    "generation",
    "long-term attention",
    "view",
    "attention",
    "term"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.489/",
  "provenance": {
    "collected_at": "2025-06-05 10:15:16",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}