{
  "id": "2023.acl-long.164",
  "title": "Hierarchical Verbalizer for Few-Shot Hierarchical Text Classification",
  "authors": [
    "Ji, Ke  and\nLian, Yixin  and\nGao, Jingsheng  and\nWang, Baoyuan"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Due to the complex label hierarchy and intensive labeling cost in practice, the hierarchical text classification (HTC) suffers a poor performance especially when low-resource or few-shot settings are considered. Recently, there is a growing trend of applying prompts on pre-trained language models (PLMs), which has exhibited effectiveness in the few-shot flat text classification tasks. However, limited work has studied the paradigm of prompt-based learning in the HTC problem when the training data is extremely scarce. In this work, we define a path-based few-shot setting and establish a strict path-based evaluation metric to further explore few-shot HTC tasks. To address the issue, we propose the hierarchical verbalizer (“HierVerb”), a multi-verbalizer framework treating HTC as a single- or multi-label classification problem at multiple layers and learning vectors as verbalizers constrained by hierarchical structure and hierarchical contrastive learning. In this manner, HierVerb fuses label hierarchy knowledge into verbalizers and remarkably outperforms those who inject hierarchy through graph encoders, maximizing the benefits of PLMs. Extensive experiments on three popular HTC datasets under the few-shot settings demonstrate that prompt with HierVerb significantly boosts the HTC performance, meanwhile indicating an elegant way to bridge the gap between the large pre-trained model and downstream hierarchical classification tasks.",
  "keywords": [
    "we",
    "prompt-based learning",
    "graph",
    "shot",
    "training",
    "classification",
    "few-shot hierarchical text classification",
    "hierarchical contrastive learning",
    "graph encoders",
    "few-shot htc tasks",
    "pre-trained language models plms",
    "learning",
    "the hierarchical verbalizer hierverb",
    "manner",
    "hierarchical verbalizer"
  ],
  "url": "https://aclanthology.org/2023.acl-long.164/",
  "provenance": {
    "collected_at": "2025-06-05 09:37:37",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}