{
  "id": "2023.semeval-1.124",
  "title": "N}et{E}ase.{AI} at {S}em{E}val-2023 Task 2: Enhancing Complex Named Entities Recognition in Noisy Scenarios via Text Error Correction and External Knowledge",
  "authors": [
    "Lu, Ruixuan  and\nTang, Zihang  and\nHu, Guanglong  and\nLiu, Dong  and\nLi, Jiacheng"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "Complex named entities (NE), like the titles of creative works, are not simple nouns and pose challenges for NER systems. In the SemEval 2023, Task 2: MultiCoNER II was proposed, whose goal is to recognize complex entities against out of knowledge-base entities and noisy scenarios. To address the challenges posed by MultiCoNER II, our team NetEase.AI proposed an entity recognition system that integrates text error correction system and external knowledge, which can recognize entities in scenes that contain entities out of knowledge base and text with noise. Upon receiving an input sentence, our systems will correct the sentence, extract the entities in the sentence as candidate set using the entity recognition model that incorporates the gazetteer information, and then use the external knowledge to classify the candidate entities to obtain entity type features. Finally, our system fused the multi-dimensional features of the candidate entities into a stacking model, which was used to select the correct entities from the candidate set as the final output. Our system exhibited good noise resistance and excellent entity recognition performance, resulting in our team’s first place victory in the Chinese track of MultiCoNER II.",
  "keywords": [
    "em",
    "ne",
    "multiconer",
    "multiconer ii",
    "the entities",
    "2 multiconer ii",
    "information",
    "complex named entities recognition",
    "ner",
    "et",
    "the correct entities",
    "complex entities",
    "text",
    "dimensional",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.124/",
  "provenance": {
    "collected_at": "2025-06-05 10:28:19",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}