{
  "id": "2023.semeval-1.83",
  "title": "UMUT}eam at {S}em{E}val-2023 Task 3: Multilingual transformer-based model for detecting the Genre, the Framing, and the Persuasion Techniques in Online News",
  "authors": [
    "Pan, Ronghao  and\nGarc{\\'i}a-D{\\'i}az, Jos{\\'e} Antonio  and\n{\\'A}ngel Rodr{\\'i}guez-Garc{\\'i}a, Miguel  and\nValencia-Garc{\\'i}a, Rafael"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "In this manuscript, we describe the participation of the UMUTeam in SemEval-2023 Task 3, a shared task on detecting different aspects of news articles and other web documents, such as document category, framing dimensions, and persuasion technique in a multilingual setup. The task has been organized into three related subtasks, and we have been involved in the first two. Our approach is based on a fine-tuned multilingual transformer-based model that uses the dataset of all languages at once and a sentence transformer model to extract the most relevant chunk of a text for subtasks 1 and 2. The input data was truncated to 200 tokens with 50 overlaps using the sentence-transformer model to obtain the subset of text most related to the articles’ titles. Our system has performed good results in subtask 1 in most languages, and in some cases, such as French and German, we have archived first place in the official leader board. As for task 2, our system has also performed very well in all languages, ranking in all the top 10.",
  "keywords": [
    "we",
    "a sentence transformer model",
    "text",
    "3 multilingual transformer-based model",
    "transformer",
    "model",
    "the sentence-transformer model",
    "documents",
    "approach",
    "different aspects",
    "german",
    "our system",
    "the participation",
    "different",
    "the persuasion techniques"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.83/",
  "provenance": {
    "collected_at": "2025-06-05 10:27:46",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}