{
  "id": "2023.acl-long.685",
  "title": "PAL} to Lend a Helping Hand: Towards Building an Emotion Adaptive Polite and Empathetic Counseling Conversational Agent",
  "authors": [
    "Mishra, Kshitij  and\nPriya, Priyanshu  and\nEkbal, Asif"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "The World Health Organization (WHO) has significantly emphasized the need for mental health care. The social stigma associated with mental illness prevents individuals from addressing their issues and getting assistance. In such a scenario, the relevance of online counseling has increased dramatically. The feelings and attitudes that a client and a counselor express towards each other result in a higher or lower counseling experience. A counselor should be friendly and gain clients’ trust to make them share their problems comfortably. Thus, it is essential for the counselor to adequately comprehend the client’s emotions and ensure client’s welfare, i.e. s/he should adapt and deal with the clients politely and empathetically to provide a pleasant, cordial and personalized experience. Motivated by this, in this work, we attempt to build a novel Polite and empAthetic counseLing conversational agent PAL to lay down the counseling support to substance addict and crime victims. To have client’s emotion-based polite and empathetic responses, two counseling datasets laying down the counseling support to substance addicts and crime victims are annotated. These annotated datasets are used to build PAL in a reinforcement learning framework. A novel reward function is formulated to ensure correct politeness and empathy preferences as per client’s emotions with naturalness and non-repetitiveness in responses. Thorough automatic and human evaluation showcase the usefulness and strength of the designed novel reward function. Our proposed system is scalable and can be easily modified with different modules of preference models as per need.",
  "keywords": [
    "support",
    "a client",
    "clients",
    "we",
    "friendly",
    "it",
    "client s emotions",
    "learning",
    "the clients",
    "client s welfare",
    "i",
    "client",
    "experience",
    "he",
    "function"
  ],
  "url": "https://aclanthology.org/2023.acl-long.685/",
  "provenance": {
    "collected_at": "2025-06-05 09:44:54",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}