{
  "id": "2023.semeval-1.154",
  "title": "Brainstormers{\\_}msec at {S}em{E}val-2023 Task 10: Detection of sexism related comments in social media using deep learning",
  "authors": [
    "Mahibha, C. Jerin  and\nSwaathi, C. M  and\nJeevitha, R.  and\nMartina, R. Princy  and\nThenmozhi, Durairaj"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "Social media is the media through which people share their thoughts and opinions. This has both its pros and cons which depends on the type of information being conveyed. If any information conveyed over social media hurts or affects a person, such information can be removed as it may disturb their mental health and may decrease their self confidence. During the last decade, hateful and sexist content towards women in being increasingly spread on social networks. The exposure to sexist speech has serious consequences to women’s life and limits their freedom of speech. Sexism is expressed in very different forms: it includes subtle stereotypes and attitudes that, although frequently unnoticed, are extremely harmful for both women and society. Sexist comments have a major impact on women being subjected to it. We as a team participated in the shared task Explainable Detection of Online Sexism (EDOS) at SemEval 2023 and have proposed a model which identifies the sexist comments and its type from English social media posts using the data set shared for the task. Different transformer model like BERT , DistilBERT and RoBERT are used by the proposed model for implementing all the three tasks shared by EDOS. On using the BERT model, macro F1 score of 0.8073, 0.5876 and 0.3729 are achieved for Task A, Task B and Task C respectively.",
  "keywords": [
    "deep",
    "deep learning social media",
    "it",
    "self",
    "information",
    "society sexist comments",
    "robert",
    "bert",
    "bert distilbert",
    "society",
    "transformer",
    "model",
    "distilbert",
    "major",
    "sexism"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.154/",
  "provenance": {
    "collected_at": "2025-06-05 10:28:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}