{
  "id": "2023.findings-acl.440",
  "title": "Revisiting Sentence Union Generation as a Testbed for Text Consolidation",
  "authors": [
    "Hirsch, Eran  and\nPyatkin, Valentina  and\nWolhandler, Ruben  and\nCaciularu, Avi  and\nShefer, Asi  and\nDagan, Ido"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Tasks involving text generation based on multiple input texts, such as multi-document summarization, long-form question answering and contemporary dialogue applications, challenge models for their ability to properly consolidate partly-overlapping multi-text information. However, these tasks entangle the consolidation phase with the often subjective and ill-defined content selection requirement, impeding proper assessment of models’ consolidation capabilities. In this paper, we suggest revisiting the sentence union generation task as an effective well-defined testbed for assessing text consolidation capabilities, decoupling the consolidation challenge from subjective content selection. To support research on this task, we present refined annotation methodology and tools for crowdsourcing sentence union, create the largest union dataset to date and provide an analysis of its rich coverage of various consolidation aspects. We then propose a comprehensive evaluation protocol for union generation, including both human and automatic evaluation. Finally, as baselines, we evaluate state-of-the-art language models on the task, along with a detailed analysis of their capacity to address multi-text consolidation challenges and their limitations.",
  "keywords": [
    "question",
    "sentence union generation",
    "form",
    "summarization",
    "we",
    "dialogue",
    "text generation",
    "text consolidation capabilities",
    "information",
    "rich",
    "analysis",
    "text",
    "a comprehensive evaluation protocol",
    "generation",
    "language"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.440/",
  "provenance": {
    "collected_at": "2025-06-05 10:14:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}