{
  "id": "2023.acl-long.150",
  "title": "Symbolic Chain-of-Thought Distillation: Small Models Can Also ``Think'' Step-by-Step",
  "authors": [
    "Li, Liunian Harold  and\nHessel, Jack  and\nYu, Youngjae  and\nRen, Xiang  and\nChang, Kai-Wei  and\nChoi, Yejin"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Chain-of-thought prompting (e.g., “Let’s think step-by-ste”) primes large language models to verbalize rationalization for their predictions. While chain-of-thought can lead to dramatic performance gains, benefits appear to emerge only for sufficiently large models (beyond 50B parameters). We show that orders-of-magnitude smaller models (125M—1.3B parameters) can still benefit from chain-of-thought prompting. To achieve this, we introduce Symbolic Chain-of-Thought Distillation (SCoTD), a method to train a smaller student model on rationalizations sampled from a significantly larger teacher model. Experiments across several commonsense benchmarks show that: 1) SCoTD enhances the performance of the student model in both supervised and few-shot settings, and especially for challenge sets; 2) sampling many reasoning chains per instance from the teacher is paramount; and 3) after distillation, student chain-of-thoughts are judged by humans as comparable to the teacher, despite orders of magnitude fewer parameters. We test several hypotheses regarding what properties of chain-of-thought samples are important, e.g., diversity vs. teacher likelihood vs. open-endedness. We release our corpus of chain-of-thought samples and code.",
  "keywords": [
    "code",
    "chain",
    "scotd",
    "we",
    "shot",
    "sufficiently large models",
    "properties",
    "e",
    "1 scotd",
    "ste",
    "s",
    "g",
    "language",
    "thought",
    "model"
  ],
  "url": "https://aclanthology.org/2023.acl-long.150/",
  "provenance": {
    "collected_at": "2025-06-05 09:37:24",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}