{
  "id": "2023.findings-acl.26",
  "title": "A Match Made in Heaven: A Multi-task Framework for Hyperbole and Metaphor Detection",
  "authors": [
    "Badathala, Naveen  and\nRajakumar Kalarani, Abisek  and\nSiledar, Tejpalsingh  and\nBhattacharyya, Pushpak"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Hyperbole and metaphor are common in day-to-day communication (e.g., “I am in deep trouble”: how does trouble have depth?), which makes their detection important, especially in a conversational AI setting. Existing approaches to automatically detect metaphor and hyperbole have studied these language phenomena independently, but their relationship has hardly, if ever, been explored computationally. In this paper, we propose a multi-task deep learning framework to detect hyperbole and metaphor simultaneously. We hypothesize that metaphors help in hyperbole detection, and vice-versa. To test this hypothesis, we annotate two hyperbole datasets- HYPO and HYPO-L- with metaphor labels. Simultaneously, we annotate two metaphor datasets- TroFi and LCC- with hyperbole labels. Experiments using these datasets give an improvement of the state of the art of hyperbole detection by 12%. Additionally, our multi-task learning (MTL) approach shows an improvement of up to 17% over single-task learning (STL) for both hyperbole and metaphor detection, supporting our hypothesis. To the best of our knowledge, ours is the first demonstration of computational leveraging of linguistic intimacy between metaphor and hyperbole, leading to showing the superiority of MTL over STL for hyperbole and metaphor detection.",
  "keywords": [
    "deep",
    "we",
    "learning",
    "i",
    "versa",
    "e g",
    "knowledge",
    "language",
    "conversational",
    "demonstration",
    "multi",
    "approach",
    "state",
    "a match",
    "trofi"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.26/",
  "provenance": {
    "collected_at": "2025-06-05 09:53:34",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}