{
  "id": "2023.semeval-1.296",
  "title": "M}ason{NLP}+ at {S}em{E}val-2023 Task 8: Extracting Medical Questions, Experiences and Claims from Social Media using Knowledge-Augmented Pre-trained Language Models",
  "authors": [
    "Ramachandran, Giridhar Kaushik  and\nGangavarapu, Haritha  and\nLybarger, Kevin  and\nUzuner, Ozlem"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "In online forums like Reddit, users share their experiences with medical conditions and treatments, including making claims, asking questions, and discussing the effects of treatments on their health. Building systems to understand this information can effectively monitor the spread of misinformation and verify user claims. The Task-8 of the 2023 International Workshop on Semantic Evaluation focused on medical applications, specifically extracting patient experience- and medical condition-related entities from user posts on social media. The Reddit Health Online Talk (RedHot) corpus contains posts from medical condition-related subreddits with annotations characterizing the patient experience and medical conditions. In Subtask-1, patient experience is characterized by personal experience, questions, and claims. In Subtask-2, medical conditions are characterized by population, intervention, and outcome. For the automatic extraction of patient experiences and medical condition information, as a part of the challenge, we proposed language-model-based extraction systems that ranked $3ˆ{rd}$ on both subtasks’ leaderboards. In this work, we describe our approach and, in addition, explore the automatic extraction of this information using domain-specific language models and the inclusion of external knowledge.",
  "keywords": [
    "extraction",
    "patient experience",
    "semantic",
    "experience-",
    "patient experiences",
    "we",
    "information",
    "the patient experience",
    "ason nlp",
    "semantic evaluation",
    "experience",
    "domain-specific language models",
    "work",
    "their experiences",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.296/",
  "provenance": {
    "collected_at": "2025-06-05 10:30:41",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}