{
  "id": "2023.semeval-1.191",
  "title": "I}2{C} {H}uelva at {S}em{E}val-2023 Task 4: A Resampling and Transformers Approach to Identify Human Values behind Arguments",
  "authors": [
    "El Balima Cordero, Nordin  and\nMata V{\\'a}zquez, Jacinto  and\nPach{\\'o}n {\\'A}lvarez, Victoria  and\nPichardo Estevez, Abel"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "This paper presents the approaches proposedfor I2C Group to address the SemEval-2023Task 4: Identification of Human Values behindArguments (ValueEval)”, whose goal is to classify 20 different categories of human valuesgiven a textual argument. The dataset of thistask consists of one argument per line, including its unique argument ID, conclusion, stanceof the premise towards the conclusion and thepremise text. To indicate whether the argumentdraws or not on that category a binary indication (1 or 0) is included. Participants can submit approaches that detect one, multiple, or allof these values in arguments. The task providesan opportunity for researchers to explore theuse of automated techniques to identify humanvalues in text and has potential applications invarious domains such as social science, politics,and marketing. To deal with the imbalancedclass distribution given, our approach undersamples the data. Additionally, the three components of the argument (conclusion, stanceand premise) are used for training. The systemoutperformed the BERT baseline according toofficial evaluation metrics, achieving a f1 scoreof 0.46.",
  "keywords": [
    "transformers",
    "toofficial evaluation metrics",
    "social science politics",
    "20 different categories",
    "science",
    "i",
    "categories",
    "bert",
    "text",
    "metrics",
    "a f1",
    "human",
    "evaluation",
    "its unique argument",
    "politics"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.191/",
  "provenance": {
    "collected_at": "2025-06-05 10:29:14",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}