{
  "id": "2023.acl-long.637",
  "title": "Multi-granularity Temporal Question Answering over Knowledge Graphs",
  "authors": [
    "Chen, Ziyang  and\nLiao, Jinzhi  and\nZhao, Xiang"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Recently, question answering over temporal knowledge graphs (i.e., TKGQA) has been introduced and investigated, in quest of reasoning about dynamic factual knowledge. To foster research on TKGQA, a few datasets have been curated (e.g., CronQuestions and Complex-CronQuestions), and various models have been proposed based on these datasets. Nevertheless, existing efforts overlook the fact that real-life applications of TKGQA also tend to be complex in temporal granularity, i.e., the questions may concern mixed temporal granularities (e.g., both day and month). To overcome the limitation, in this paper, we motivate the notion of multi-granularity temporal question answering over knowledge graphs and present a large scale dataset for multi-granularity TKGQA, namely MultiTQ. To the best of our knowledge, MultiTQis among the first of its kind, and compared with existing datasets on TKGQA, MultiTQfeatures at least two desirable aspects—ample relevant facts and multiple temporal granularities. It is expected to better reflect real-world challenges, and serve as a test bed for TKGQA models. In addition, we propose a competing baseline MultiQA over MultiTQ, which is experimentally demonstrated to be effective in dealing with TKGQA. The data and code are released athttps://github.com/czy1999/MultiTQ.",
  "keywords": [
    "multiple temporal granularities",
    "code",
    "tkgqa models",
    "mixed temporal granularities",
    "granularities",
    "question",
    "we",
    "it",
    "tkgqa multitqfeatures",
    "a competing baseline multiqa",
    "tkgqa",
    "knowledge graphs",
    "bed",
    "i",
    "e tkgqa"
  ],
  "url": "https://aclanthology.org/2023.acl-long.637/",
  "provenance": {
    "collected_at": "2025-06-05 09:44:13",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}