{
  "id": "2023.acl-long.839",
  "title": "Don{'}t Forget Your {ABC}{'}s: Evaluating the State-of-the-Art in Chat-Oriented Dialogue Systems",
  "authors": [
    "Finch, Sarah E.  and\nFinch, James D.  and\nChoi, Jinho D."
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Despite tremendous advancements in dialogue systems, stable evaluation still requires human judgments producing notoriously high-variance metrics due to their inherent subjectivity. Moreover, methods and labels in dialogue evaluation are not fully standardized, especially for open-domain chats, with a lack of work to compare and assess the validity of those approaches. The use of inconsistent evaluation can misinform the performance of a dialogue system, which becomes a major hurdle to enhance it. Thus, a dimensional evaluation of chat-oriented open-domain dialogue systems that reliably measures several aspects of dialogue capabilities is desired. This paper presents a novel human evaluation method to estimate the rates of many{pasted macro ‘LN’} dialogue system behaviors. Our method is used to evaluate four state-of-the-art open-domain dialogue systems and compared with existing approaches. The analysis demonstrates that our behavior method is more suitable than alternative Likert-style or comparative approaches for dimensional evaluation of these systems.",
  "keywords": [
    "inconsistent evaluation",
    "dialogue",
    "a dialogue system",
    "variance",
    "dimensional evaluation",
    "it",
    "notoriously high-variance metrics",
    "analysis",
    "dialogue capabilities",
    "a dimensional evaluation",
    "metrics",
    "chat-oriented open-domain dialogue systems",
    "dialogue systems stable evaluation",
    "dimensional",
    "chat-oriented dialogue systems"
  ],
  "url": "https://aclanthology.org/2023.acl-long.839/",
  "provenance": {
    "collected_at": "2025-06-05 09:47:09",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}