{
  "id": "2023.sicon-1.5",
  "title": "BC}ause: Reducing group bias and promoting cohesive discussion in online deliberation processes through a simple and engaging online deliberation tool",
  "authors": [
    "Anastasiou, Lucas  and\nDe Liddo, Anna"
  ],
  "year": "2023",
  "venue": "Proceedings of the First Workshop on Social Influence in Conversations (SICon 2023)",
  "abstract": "Facilitating healthy online deliberation in terms of sensemaking and collaboration of discussion participants proves extremely challenging due to a number of known negative effects of online communication on social media platforms. We start from concerns and aspirations about the use of existing online discussion systems as distilled in previous literature, we then combine them with lessons learned on design and engineering practices from our research team, to inform the design of an easy-to-use tool (BCause.app) that enables higher quality discussions than traditional social media. We describe the design of this tool, highlighting the main interaction features that distinguish it from common social media, namely: i. the low-cost argumentation structuring of the conversations with direct replies; ii. and the distinctive use of reflective feedback rather than appreciative-only feedback. We then present the results of a controlled A/B experiment in which we show that the presence of argumentative and cognitive reflective discussion elements produces better social interaction with less polarization and promotes a more cohesive discussion than common social media-like interactions.",
  "keywords": [
    "bias",
    "feedback",
    "conversations",
    "group bias",
    "we",
    "direct replies ii",
    "it",
    "replies",
    "the conversations",
    "less polarization",
    "media",
    "engineering",
    "interaction",
    "low",
    "healthy online deliberation"
  ],
  "url": "https://aclanthology.org/2023.sicon-1.5/",
  "provenance": {
    "collected_at": "2025-06-05 10:31:05",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}