{
  "id": "2023.bea-1.51",
  "title": "Learning from Partially Annotated Data: Example-aware Creation of Gap-filling Exercises for Language Learning",
  "authors": [
    "Bitew, Semere Kiros  and\nDeleu, Johannes  and\nDo{\\u{g}}ru{\\\"o}z, A. Seza  and\nDevelder, Chris  and\nDemeester, Thomas"
  ],
  "year": "2023",
  "venue": "Proceedings of the 18th Workshop on Innovative Use of NLP for Building Educational Applications (BEA 2023)",
  "abstract": "Since performing exercises (including, e.g.,practice tests) forms a crucial component oflearning, and creating such exercises requiresnon-trivial effort from the teacher. There is agreat value in automatic exercise generationin digital tools in education. In this paper, weparticularly focus on automatic creation of gap-filling exercises for language learning, specifi-cally grammar exercises. Since providing anyannotation in this domain requires human ex-pert effort, we aim to avoid it entirely and ex-plore the task of converting existing texts intonew gap-filling exercises, purely based on anexample exercise, without explicit instructionor detailed annotation of the intended gram-mar topics. We contribute (i) a novel neuralnetwork architecture specifically designed foraforementioned gap-filling exercise generationtask, and (ii) a real-world benchmark datasetfor French grammar. We show that our modelfor this French grammar gap-filling exercisegeneration outperforms a competitive baselineclassifier by 8% in F1 percentage points, achiev-ing an average F1 score of 82%. Our model im-plementation and the dataset are made publiclyavailable to foster future research, thus offeringa standardized evaluation and baseline solutionof the proposed partially annotated data predic-tion task in grammar exercise creation.",
  "keywords": [
    "a competitive baselineclassifier",
    "f1",
    "generationtask",
    "we",
    "ing",
    "an average f1 score",
    "it",
    "learning",
    "exercisegeneration",
    "i",
    "achiev",
    "foraforementioned gap-filling exercise generationtask",
    "language",
    "model",
    "generationin"
  ],
  "url": "https://aclanthology.org/2023.bea-1.51/",
  "provenance": {
    "collected_at": "2025-06-05 10:21:56",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}