{
  "id": "2023.acl-long.362",
  "title": "P}ea{C}o{K}: Persona Commonsense Knowledge for Consistent and Engaging Narratives",
  "authors": [
    "Gao, Silin  and\nBorges, Beatriz  and\nOh, Soyoung  and\nBayazit, Deniz  and\nKanno, Saya  and\nWakaki, Hiromi  and\nMitsufuji, Yuki  and\nBosselut, Antoine"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Sustaining coherent and engaging narratives requires dialogue or storytelling agents to understandhow the personas of speakers or listeners ground the narrative. Specifically, these agents must infer personas of their listeners to produce statements that cater to their interests. They must also learn to maintain consistent speaker personas for themselves throughout the narrative, so that their counterparts feel involved in a realistic conversation or story. However, personas are diverse and complex: they entail large quantities of rich interconnected world knowledge that is challenging to robustly represent in general narrative systems (e.g., a singer is good at singing, and may have attended conservatoire). In this work, we construct a new large-scale persona commonsense knowledge graph, PeaCoK, containing ~100K human-validated persona facts. Our knowledge graph schematizes five dimensions of persona knowledge identified in previous studies of human interactive behaviours, and distils facts in this schema from both existing commonsense knowledge graphs and large-scale pretrained language models. Our analysis indicates that PeaCoK contains rich and precise world persona inferences that help downstream systems generate more consistent and engaging narratives.",
  "keywords": [
    "a realistic conversation",
    "we",
    "dialogue",
    "graph",
    "quantities",
    "general narrative systems e",
    "rich",
    "analysis",
    "previous studies",
    "large quantities",
    "large-scale pretrained language models",
    "work",
    "our knowledge graph",
    "general",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2023.acl-long.362/",
  "provenance": {
    "collected_at": "2025-06-05 09:40:20",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}