{
  "id": "2023.acl-short.71",
  "title": "Bhasa-{A}bhijnaanam: Native-script and romanized Language Identification for 22 {I}ndic languages",
  "authors": [
    "Madhani, Yash  and\nKhapra, Mitesh M.  and\nKunchukuttan, Anoop"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers)",
  "abstract": "We create publicly available language identification (LID) datasets and models in all 22 Indian languages listed in the Indian constitution in both native-script and romanized text. First, we create Bhasha-Abhijnaanam, a language identification test set for native-script as well as romanized text which spans all 22 Indic languages. We also train IndicLID, a language identifier for all the above-mentioned languages in both native and romanized script. For native-script text, it has better language coverage than existing LIDs and is competitive or better than other LIDs. IndicLID is the first LID for romanized text in Indian languages. Two major challenges for romanized text LID are the lack of training data and low-LID performance when languages are similar. We provide simple and effective solutions to these problems. In general, there has been limited work on romanized text in any language, and our findings are relevant to other languages that need romanized language identification. Our models are publicly available athttps://github.com/AI4Bharat/IndicLIDunder open-source licenses. Our training and test sets are also publicly available athttps://huggingface.co/datasets/ai4bharat/Bhasha-Abhijnaanamunder open-source licenses.",
  "keywords": [
    "we",
    "training",
    "it",
    "text",
    "identifier",
    "work",
    "general",
    "language",
    "lid",
    "major",
    "any language",
    "low",
    "native",
    "test",
    "all the above-mentioned languages"
  ],
  "url": "https://aclanthology.org/2023.acl-short.71/",
  "provenance": {
    "collected_at": "2025-06-05 09:49:15",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}