{
  "id": "2023.acl-long.250",
  "title": "Towards Faithful Dialogues via Focus Learning",
  "authors": [
    "Deng, Yifan  and\nZhang, Xingsheng  and\nHuang, Heyan  and\nHu, Yue"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Maintaining faithfulness between responses and knowledge is an important research topic for building reliable knowledge-grounded dialogue systems. Existing models heavily rely on elaborate data engineering or increasing the model’s parameters ignoring to track the tokens that significantly influence losses, which is decisive for the optimization direction of the model in each iteration. To address this issue, we propose Focus Learning (FocusL), a novel learning approach that adjusts the contribution of each token to the optimization direction by directly scaling the corresponding objective loss. Specifically, we first introduce a positioning method by utilizing similarity distributions between knowledge and each response token to locate knowledge-aware tokens. Then, we further design a similarity-to-weight transformation to provide dynamic token-level weights for the cross-entropy loss. Finally, we use the weighted loss to encourage the model to pay special attention to the knowledge utilization. Experimental results demonstrate that our method achieves the new state-of-the-art results and generates more reliable responses while maintaining training stability.",
  "keywords": [
    "we",
    "dialogue",
    "training",
    "cross",
    "token",
    "reliable knowledge-grounded dialogue systems",
    "loss",
    "learning",
    "the corresponding objective loss",
    "faithful dialogues",
    "special attention",
    "objective",
    "the optimization direction",
    "topic",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2023.acl-long.250/",
  "provenance": {
    "collected_at": "2025-06-05 09:38:48",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}