{
  "id": "2023.semeval-1.207",
  "title": "B}hattacharya{\\_}{L}ab at {S}em{E}val-2023 Task 12: A Transformer-based Language Model for Sentiment Classification for Low Resource {A}frican Languages: {N}igerian {P}idgin and {Y}oruba",
  "authors": [
    "Hughes, Nathaniel  and\nBaker, Kevan  and\nSingh, Aditya  and\nSingh, Aryavardhan  and\nDauda, Tharalillah  and\nBhattacharya, Sutanu"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "Sentiment Analysis is an aspect of natural languageprocessing (NLP) that has been a topicof research. While most studies focus on highresourcelanguages with an extensive amountof available data, the study on low-resource languageswith insufficient data needs attention. To address this issue, we propose a transformerbasedmethod for sentiment analysis for lowresourcesAfrican languages, Nigerian Pidginand Yoruba. To evaluate the effectiveness ofour multilingual language models for monolingualsentiment classification, we participated inthe AfriSenti SemEval shared task 2023 competition. On the official e valuation s et, ourgroup (named as Bhattacharya_Lab) ranked1 out of 33 participating groups in the MonolingualSentiment Classification task (i.e., TaskA) for Nigerian Pidgin (i.e., Track 4), and inthe Top 5 among 33 participating groups inthe Monolingual Sentiment Classification taskfor Yoruba (i.e., Track 2) respectively, demonstratingthe potential for our transformer-basedlanguage models to improve sentiment analysisin low-resource languages. Overall, ourstudy highlights the importance of exploringthe potential of NLP in low-resource languagesand the impact of transformer-based multilinguallanguage models in sentiment analysis forthe low-resource African languages, NigerianPidgin and Yoruba.",
  "keywords": [
    "a transformer-based language model",
    "we",
    "classification",
    "natural",
    "sentiment analysisin low-resource languages",
    "transformer-based multilinguallanguage models",
    "most studies",
    "analysis",
    "our transformer-basedlanguage models",
    "monolingualsentiment classification",
    "i",
    "natural languageprocessing nlp",
    "sentiment analysis",
    "valuation",
    "sentiment classification"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.207/",
  "provenance": {
    "collected_at": "2025-06-05 10:29:27",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}