{
  "id": "2023.findings-acl.230",
  "title": "M}ulti3{NLU}++: A Multilingual, Multi-Intent, Multi-Domain Dataset for Natural Language Understanding in Task-Oriented Dialogue",
  "authors": [
    "Moghe, Nikita  and\nRazumovskaia, Evgeniia  and\nGuillou, Liane  and\nVuli{\\'c}, Ivan  and\nKorhonen, Anna  and\nBirch, Alexandra"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Task-oriented dialogue (ToD) systems have been widely deployed in many industries as they deliver more efficient customer support. These systems are typically constructed for a single domain or language and do not generalise well beyond this. To support work on Natural Language Understanding (NLU) in ToD across multiple languages and domains simultaneously, we constructed Multi3NLU++, a multilingual, multi-intent, multi-domain dataset. Multi3NLU++ extends the English-only NLU++ dataset to include manual translations into a range of high, medium, and low resource languages (Spanish, Marathi, Turkish and Amharic), in two domains (banking and hotels). Because of its multi-intent property, Multi3NLU++ represents complex and natural user goals, and therefore allows us to measure the realistic performance of ToD systems in a varied set of the world’s languages. We use Multi3NLU++ to benchmark state-of-the-art multilingual models for the NLU tasks of intent detection and slot labeling for ToD systems in the multilingual setting. The results demonstrate the challenging nature of the dataset, particularly in the low-resource language setting, offering ample room for future experimentation in multi-domain multilingual ToD setups.",
  "keywords": [
    "varied",
    "support",
    "efficient",
    "we",
    "dialogue",
    "a varied set",
    "natural",
    "natural language",
    "more efficient customer support",
    "many industries",
    "industries",
    "work",
    "language",
    "us",
    "translations"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.230/",
  "provenance": {
    "collected_at": "2025-06-05 09:56:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}