{
  "id": "2023.bionlp-1.18",
  "title": "Privacy Aware Question-Answering System for Online Mental Health Risk Assessment",
  "authors": [
    "Chhikara, Prateek  and\nPasupulety, Ujjwal  and\nMarshall, John  and\nChaurasia, Dhiraj  and\nKumari, Shweta"
  ],
  "year": "2023",
  "venue": "The 22nd Workshop on Biomedical Natural Language Processing and BioNLP Shared Tasks",
  "abstract": "Social media platforms have enabled individuals suffering from mental illnesses to share their lived experiences and find the online support necessary to cope. However, many users fail to receive genuine clinical support, thus exacerbating their symptoms. Screening users based on what they post online can aid providers in administering targeted healthcare and minimize false positives. Pre-trained Language Models (LMs) can assess users’ social media data and classify them in terms of their mental health risk. We propose a Question-Answering (QA) approach to assess mental health risk using the Unified-QA model on two large mental health datasets. To protect user data, we extend Unified-QA by anonymizing the model training process using differential privacy. Our results demonstrate the effectiveness of modeling risk assessment as a QA task, specifically for mental health use cases. Furthermore, the model’s performance decreases by less than 1% with the inclusion of differential privacy. The proposed system’s performance is indicative of a promising research direction that will lead to the development of privacy-aware diagnostic systems.",
  "keywords": [
    "support",
    "question",
    "we",
    "unified-qa",
    "pre-trained language models lms",
    "training",
    "their lived experiences",
    "the unified-qa model",
    "a question-answering qa approach",
    "process",
    "language",
    "model",
    "experiences",
    "a qa task",
    "pre"
  ],
  "url": "https://aclanthology.org/2023.bionlp-1.18/",
  "provenance": {
    "collected_at": "2025-06-05 10:22:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}