{
  "id": "2023.findings-acl.6",
  "title": "T}imeline{QA}: A Benchmark for Question Answering over Timelines",
  "authors": [
    "Tan, Wang-Chiew  and\nDwivedi-Yu, Jane  and\nLi, Yuliang  and\nMathias, Lambert  and\nSaeidi, Marzieh  and\nYan, Jing Nathan  and\nHalevy, Alon"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Lifelogs are descriptions of experiences that a person had during their life. Lifelogs are created by fusing data from the multitude of digital services, such as online photos, maps, shopping and content streaming services. Question answering over lifelogs can offer personal assistants a critical resource when they try to provide advice in context. However, obtaining answers to questions over lifelogs is beyond the current state of the art of question answering techniques for a variety of reasons, the most pronounced of which is that lifelogs combine free text with some degree of structure such as temporal and geographical information. We create and publicly release TimelineQA, a benchmark for accelerating progress on querying lifelogs. TimelineQA generates lifelogs of imaginary people. The episodes in the lifelog range from major life episodes such as high school graduation to those that occur on a daily basis such as going for a run. We describe a set of experiments on TimelineQA with several state-of-the-art QA models. Our experiments reveal that for atomic queries, an extractive QA system significantly out-performs a state-of-the-art retrieval-augmented QA system. For multi-hop queries involving aggregates, we show that the best result is obtained with a state-of-the-art table QA technique, assuming the ground truth set of episodes for deriving the answer is available.",
  "keywords": [
    "variety",
    "question",
    "we",
    "current",
    "answer",
    "queries",
    "retrieval",
    "information",
    "a variety",
    "timelineqa",
    "text",
    "an extractive qa system",
    "experiences",
    "multi-hop queries",
    "atomic queries"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.6/",
  "provenance": {
    "collected_at": "2025-06-05 09:53:17",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}