{
  "id": "2023.semeval-1.131",
  "title": "SSNS}heerin{K}avitha at {S}em{E}val-2023 Task 7: Semantic Rule Based Label Prediction Using {TF}-{IDF} and {BM}25 Techniques",
  "authors": [
    "Noor Mohamed, Sheerin Sitara  and\nSrinivasan, Kavitha"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "The advancement in the healthcare sector assures improved diagnosis and supports appropriate decision making in medical domain. The medical domain data can be either radiology images or clinical data. The clinical data plays a major role in the healthcare sector by preventing and treating the health problem based on the evidence learned from the trials. This paper is related to multi-evidence natural language inference for clinical trial data analysis and its solution for the given subtasks (SemEval 2023 Task 7 - NLI4CT). In subtask 1 of NLI4CT, the inference relationship (entailment or contradiction) between the Clinical Trial Reports (CTRs) statement pairs with respect to the Clinical Trial Data (CTD) statement are determined. In subtask 2 of NLI4CT, predicted label (inference relationship) are defined and justified using set of supporting facts extracted from the premises. The objective of this work is to derive the conclusion from premises (CTRs statement pairs) and extracting the supporting premises using proposed Semantic Rule based Clinical Data Analysis (SRCDA) approach. From the results, the proposed model attained an highest F1-score of 0.667 and 0.716 for subtasks 1 and 2 respectively. The novelty of this proposed approach includes, creation of External Knowledge Base (EKB) along with its suitable semantic rules based on the input statements.",
  "keywords": [
    "proposed semantic rule",
    "semantic",
    "natural",
    "the objective",
    "analysis",
    "objective",
    "its suitable semantic rules",
    "work",
    "knowledge",
    "language",
    "model",
    "an highest f1-score",
    "major",
    "multi",
    "approach"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.131/",
  "provenance": {
    "collected_at": "2025-06-05 10:28:25",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}