{
  "id": "2023.findings-acl.165",
  "title": "Together We Make Sense{--}Learning Meta-Sense Embeddings",
  "authors": [
    "Luo, Haochen  and\nZhou, Yi  and\nBollegala, Danushka"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Sense embedding learning methods learn multiple vectors for a given ambiguous word, corresponding to its different word senses. For this purpose, different methods have been proposed in prior work on sense embedding learning that use different sense inventories, sense-tagged corpora and learning methods. However, not all existing sense embeddings cover all senses of ambiguous words equally well due to the discrepancies in their training resources. To address this problem, we propose the first-ever meta-sense embedding method – Neighbour Preserving Meta-Sense Embeddings, which learns meta-sense embeddings by combining multiple independently trained source sense embeddings such that the sense neighbourhoods computed from the source embeddings are preserved in the meta-embedding space. Our proposed method can combine source sense embeddings that cover different sets of word senses. Experimental results on Word Sense Disambiguation (WSD) and Word-in-Context (WiC) tasks show that the proposed meta-sense embedding method consistently outperforms several competitive baselines. An anonymised version of the source code implementation for our proposed method is submitted to reviewing system. Both source code and the learnt meta-sense embeddings will be publicly released upon paper acceptance.",
  "keywords": [
    "code",
    "meta-sense embeddings",
    "we",
    "the learnt meta-sense embeddings",
    "embedding learning methods",
    "training",
    "embedding learning",
    "inventories",
    "the discrepancies",
    "discrepancies",
    "word",
    "learning",
    "meta-sense embeddings sense",
    "the meta-embedding space",
    "the source embeddings"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.165/",
  "provenance": {
    "collected_at": "2025-06-05 09:55:32",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}