{
  "id": "2023.findings-acl.148",
  "title": "Hence, Socrates is mortal: A Benchmark for Natural Language Syllogistic Reasoning",
  "authors": [
    "Wu, Yongkang  and\nHan, Meng  and\nZhu, Yutao  and\nLi, Lei  and\nZhang, Xinyu  and\nLai, Ruofei  and\nLi, Xiaoguang  and\nRen, Yuanhang  and\nDou, Zhicheng  and\nCao, Zhao"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Syllogistic reasoning, a typical form of deductive reasoning, is a critical capability widely required in natural language understanding tasks, such as text entailment and question answering. To better facilitate research on syllogistic reasoning, we develop a benchmark called SylloBase that differs from existing syllogistic datasets in three aspects: (1) Covering a complete taxonomy of syllogism reasoning patterns; (2) Containing both automatically and manually constructed samples; and (3) Involving both the generation and understanding tasks. We automatically construct 50k template-based syllogism samples by mining syllogism patterns from Wikidata and ConceptNet. To improve our dataset’s naturalness and challenge, we apply GPT-3 to paraphrase the template-based data and further manually rewrite 1,000 samples as the test set. State-of-the-art pre-trained language models can achieve the best generation ROUGE-L of 38.72 by T5 and the best multi-choice accuracy of 72.77% by RoBERTa on SylloBase, which indicates the great challenge of learning diverse syllogistic reasoning types on SylloBase. Our datasets are released athttps://github.com/casually-PYlearner/SYLLOBASE.",
  "keywords": [
    "roberta",
    "question",
    "form",
    "we",
    "pylearner",
    "natural",
    "gpt-3",
    "the best multi-choice accuracy",
    "text",
    "rouge",
    "the best generation",
    "mining",
    "accuracy",
    "language",
    "generation"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.148/",
  "provenance": {
    "collected_at": "2025-06-05 09:55:17",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}