{
  "id": "2023.acl-long.44",
  "title": "Multi-{VALUE}: A Framework for Cross-Dialectal {E}nglish {NLP",
  "authors": [
    "Ziems, Caleb  and\nHeld, William  and\nYang, Jingfeng  and\nDhamala, Jwala  and\nGupta, Rahul  and\nYang, Diyi"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Dialect differences caused by regional, social, and economic factors cause performance discrepancies for many groups of language technology users. Inclusive and equitable language technology must critically be dialect invariant, meaning that performance remains constant over dialectal shifts. Current systems often fall short of this ideal since they are designed and tested on a single dialect: Standard American English (SAE). We introduce a suite of resources for evaluating and achieving English dialect invariance. The resource is called Multi-VALUE, a controllable rule-based translation system spanning 50 English dialects and 189 unique linguistic features. Multi-VALUE maps SAE to synthetic forms of each dialect. First, we use this system to stress tests question answering, machine translation, and semantic parsing. Stress tests reveal significant performance disparities for leading models on non-standard dialects. Second, we use this system as a data augmentation technique to improve the dialect robustness of existing systems. Finally, we partner with native speakers of Chicano and Indian English to release new gold-standard variants of the popular CoQA task. To execute the transformation code, run model checkpoints, and download both synthetic and gold-standard dialectal benchmark datasets, seehttp://value-nlp.org.",
  "keywords": [
    "code",
    "the popular coqa task",
    "disparities",
    "semantic",
    "we",
    "current",
    "translation",
    "cross",
    "semantic parsing stress tests",
    "significant performance disparities",
    "discrepancies",
    "english dialect invariance",
    "-",
    "invariance",
    "value-nlp org"
  ],
  "url": "https://aclanthology.org/2023.acl-long.44/",
  "provenance": {
    "collected_at": "2025-06-05 09:35:56",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}