{
  "id": "2023.semeval-1.70",
  "title": "TAM} of {SCNU} at {S}em{E}val-2023 Task 1: {FCLL}: A Fine-grained Contrastive Language-Image Learning Model for Cross-language Visual Word Sense Disambiguation",
  "authors": [
    "Yang, Qihao  and\nLi, Yong  and\nWang, Xuelin  and\nLi, Shunhao  and\nHao, Tianyong"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "Visual Word Sense Disambiguation (WSD), as a fine-grained image-text retrieval task, aims to identify the images that are relevant to ambiguous target words or phrases. However, the difficulties of limited contextual information and cross-linguistic background knowledge in text processing make this task challenging. To alleviate this issue, we propose a Fine-grained Contrastive Language-Image Learning (FCLL) model, which learns fine-grained image-text knowledge by employing a new fine-grained contrastive learning mechanism and enriches contextual information by establishing relationship between concepts and sentences. In addition, a new multimodal-multilingual knowledge base involving ambiguous target words is constructed for visual WSD. Experiment results on the benchmark datasets from SemEval-2023 Task 1 show that our FCLL ranks at the first in overall evaluation with an average H@1 of 72.56\\% and an average MRR of 82.22\\%. The results demonstrate that FCLL is effective in inference on fine-grained language-vision knowledge. Source codes and the knowledge base are publicly available athttps://github.com/CharlesYang030/FCLL.",
  "keywords": [
    "em",
    "cross-linguistic background knowledge",
    "we",
    "the difficulties",
    "cross",
    "retrieval",
    "information",
    "word",
    "learning",
    "visual",
    "difficulties",
    "processing",
    "overall evaluation",
    "background",
    "text"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.70/",
  "provenance": {
    "collected_at": "2025-06-05 10:27:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}