{
  "id": "2023.acl-long.541",
  "title": "Concise Answers to Complex Questions: Summarization of Long-form Answers",
  "authors": [
    "Potluri, Abhilash  and\nXu, Fangyuan  and\nChoi, Eunsol"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Long-form question answering systems provide rich information by presenting paragraph-level answers, often containing optional background or auxiliary information. While such comprehensive answers are helpful, not all information is required to answer the question (e.g. users with domain knowledge do not need an explanation of background). Can we provide a concise version of the answer by summarizing it, while still addressing the question? We conduct a user study on summarized answers generated from state-of-the-art models and our newly proposed extract-and-decontextualize approach. We find a large proportion of long-form answers (over 90%) in the ELI5 domain can be adequately summarized by at least one system, while complex and implicit answers are challenging to compress. We observe that decontextualization improves the quality of the extractive summary, exemplifying its potential in the summarization task. To promote future work, we provide an extractive summarization dataset covering 1K long-form answers and our user study annotations. Together, we present the first study on summarizing long-form answers, taking a step forward for QA agents that can provide answers at multiple granularities.",
  "keywords": [
    "granularities",
    "question",
    "form",
    "summarization",
    "we",
    "qa agents",
    "multiple granularities",
    "answer",
    "it",
    "information",
    "rich",
    "an extractive summarization dataset",
    "the summarization task",
    "background",
    "optional background"
  ],
  "url": "https://aclanthology.org/2023.acl-long.541/",
  "provenance": {
    "collected_at": "2025-06-05 09:42:48",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}