{
  "id": "2023.findings-acl.784",
  "title": "DSPM}-{NLG}: A Dual Supervised Pre-trained Model for Few-shot Natural Language Generation in Task-oriented Dialogue System",
  "authors": [
    "Wang, Yufan  and\nZou, Bowei  and\nFan, Rui  and\nAw, Ai Ti  and\nHe, Tingting"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "In few-shot settings, fully conveying the semantic information of the dialogue act is a crucial challenge for Natural Language Generation (NLG) in the task-oriented dialogue system. An interesting fact is that NLG and Spoken Language Understanding (SLU) are a natural dual problem pair. Suppose the response generated by the NLG module can be restored to the corresponding dialogue act by the SLU module, which reflects that the generated response fully conveys the semantic information of the dialogue act. Based on this idea, a novel Dual Supervised Pre-trained Model for a few-shot Natural Language Generation (DSPM-NLG) is proposed to regularize the pre-training process. We adopt a joint model with a dual supervised framework to learn the dual correlation between NLG and SLU from the perspective of probability. In addition, a slot-masked strategy is designed to enable the model to focus better on the key slot-value pairs. DSPM-NLG is continuously trained on existing public large-scale annotated data, which thoroughly learns the duality between two tasks to enhance the semantically controlling and generalization abilities of the pre-trained model. Experiments demonstrate that our proposed model performs outstandingly on the few-shot benchmark dataset and outperforms the previous SOTA results.",
  "keywords": [
    "the task-oriented dialogue system",
    "few-shot natural language generation",
    "task-oriented dialogue system",
    "semantic",
    "we",
    "dialogue",
    "shot",
    "training",
    "the semantic information",
    "natural",
    "the dialogue act",
    "information",
    "natural language generation",
    "the few-shot benchmark dataset",
    "abilities"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.784/",
  "provenance": {
    "collected_at": "2025-06-05 10:19:17",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}