{
  "id": "2023.acl-long.838",
  "title": "FERMAT}: An Alternative to Accuracy for Numerical Reasoning",
  "authors": [
    "Sivakumar, Jasivan  and\nMoosavi, Nafise Sadat"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "While pre-trained language models achieve impressive performance on various NLP benchmarks, they still struggle with tasks that require numerical reasoning. Recent advances in improving numerical reasoning are mostly achieved using very large language models that contain billions of parameters and are not accessible to everyone. In addition, numerical reasoning is measured using a single score on existing datasets. As a result, we do not have a clear understanding of the strengths and shortcomings of existing models on different numerical reasoning aspects and therefore, potential ways to improve them apart from scaling them up. Inspired by CheckList (Ribeiro et al., 2020), we introduce a multi-view evaluation set for numerical reasoning in English, called FERMAT. Instead of reporting a single score on a whole dataset, FERMAT evaluates models on various key numerical reasoning aspects such as number understanding, mathematical operations, and training dependency. Apart from providing a comprehensive evaluation of models on different numerical reasoning aspects, FERMAT enables a systematic and automated generation of an arbitrarily large training or evaluation set for each aspect. The datasets and codes are publicly available to generate further multi-view data for ulterior tasks and languages.",
  "keywords": [
    "we",
    "various nlp benchmarks",
    "training",
    "pre-trained language models",
    "a comprehensive evaluation",
    "very large language models",
    "further multi-view data",
    "accuracy",
    "language",
    "generation",
    "nlp",
    "view",
    "training dependency",
    "a multi-view evaluation",
    "dependency"
  ],
  "url": "https://aclanthology.org/2023.acl-long.838/",
  "provenance": {
    "collected_at": "2025-06-05 09:47:08",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}