{
  "id": "2023.acl-long.126",
  "title": "From Ultra-Fine to Fine: Fine-tuning Ultra-Fine Entity Typing Models to Fine-grained",
  "authors": [
    "Dai, Hongliang  and\nZeng, Ziqian"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "For the task of fine-grained entity typing (FET), due to the use of a large number of entity types, it is usually considered too costly to manually annotating a training dataset that contains an ample number of examples for each type. A common way to address this problem is to use distantly annotated training data that contains incorrect labels. However, the performance of models trained solely with such data can be limited by the errors in the automatic annotation. Recently, there are a few approaches that no longer follow this conventional way. But without using sufficient direct entity typing supervision may also cause them to yield inferior performance. In this paper, we propose a new approach that can avoid the need of creating distantly labeled data whenever there is a new type schema. We first train an entity typing model that have an extremely board type coverage by using the ultra-fine entity typing data. Then, when there is a need to produce a model for a newly designed fine-grained entity type schema. We can simply fine-tune the previously trained model with a small number of examples annotated under this schema. Experimental results show that our approach achieves outstanding performance for FET under the few-shot setting. It can also outperform state-of-the-art weak supervision based methods after fine-tuning the model with only a small size manually annotated training set.",
  "keywords": [
    "we",
    "shot",
    "training",
    "it",
    "sufficient",
    "sufficient direct entity",
    "fine fine-tuning ultra-fine entity",
    "fine",
    "the few-shot setting",
    "model",
    "entity",
    "a large number",
    "supervision",
    "an entity typing model",
    "approach"
  ],
  "url": "https://aclanthology.org/2023.acl-long.126/",
  "provenance": {
    "collected_at": "2025-06-05 09:37:04",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}