{
  "id": "2023.findings-acl.42",
  "title": "Robustness-Aware Word Embedding Improves Certified Robustness to Adversarial Word Substitutions",
  "authors": [
    "Wang, Yibin  and\nYang, Yichen  and\nHe, Di  and\nHe, Kun"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Natural Language Processing (NLP) models have gained great success on clean texts, but they are known to be vulnerable to adversarial examples typically crafted by synonym substitutions. In this paper, we target to solve this problem and find that word embedding is important to the certified robustness of NLP models. Given the findings, we propose the Embedding Interval Bound Constraint (EIBC) triplet loss to train robustness-aware word embeddings for better certified robustness. We optimize the EIBC triplet loss to reduce distances between synonyms in the embedding space, which is theoretically proven to make the verification boundary tighter. Meanwhile, we enlarge distances among non-synonyms, maintaining the semantic representation of word embeddings. Our method is conceptually simple and componentized. It can be easily combined with IBP training and improves the certified robust accuracy from 76.73% to 84.78% on the IMDB dataset. Experiments demonstrate that our method outperforms various state-of-the-art certified defense baselines and generalizes well to unseen substitutions. The code is available athttps://github.com/JHL-HUST/EIBC-IBP/.",
  "keywords": [
    "the certified robust accuracy",
    "code",
    "semantic",
    "we",
    "robustness-aware word embeddings",
    "training",
    "better certified robustness",
    "the semantic representation",
    "natural",
    "it",
    "loss",
    "word",
    "nlp models",
    "vulnerable",
    "processing"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.42/",
  "provenance": {
    "collected_at": "2025-06-05 09:53:48",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}