{
  "id": "2023.acl-industry.44",
  "title": "Annotating Research Infrastructure in Scientific Papers: An {NLP}-driven Approach",
  "authors": [
    "Tabatabaei, Seyed Amin  and\nCheirmpos, Georgios  and\nDoornenbal, Marius  and\nZigoni, Alberto  and\nMoore, Veronique  and\nTsatsaronis, Georgios"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 5: Industry Track)",
  "abstract": "In this work, we present a natural language processing (NLP) pipeline for the identification, extraction and linking of Research Infrastructure (RI) used in scientific publications. Links between scientific equipment and publications where the equipment was used can support multiple use cases, such as evaluating the impact of RI investment, and supporting Open Science and research reproducibility. These links can also be used to establish a profile of the RI portfolio of each institution and associate each equipment with scientific output. The system we are describing here is already in production, and has been used to address real business use cases, some of which we discuss in this paper. The computational pipeline at the heart of the system comprises both supervised and unsupervised modules to detect the usage of research equipment by processing the full text of the articles. Additionally, we have created a knowledge graph of RI, which is utilized to annotate the articles with metadata. Finally, examples of the business value of the insights made possible by this NLP pipeline are illustrated.",
  "keywords": [
    "an nlp -driven approach",
    "extraction",
    "ri",
    "this nlp pipeline",
    "we",
    "graph",
    "natural",
    "science",
    "scientific",
    "scientific output",
    "processing",
    "scientific publications links",
    "text",
    "work",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2023.acl-industry.44/",
  "provenance": {
    "collected_at": "2025-06-05 09:52:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}