{
  "id": "2023.clinicalnlp-1.40",
  "title": "Interactive Span Recommendation for Biomedical Text",
  "authors": [
    "Blankemeier, Louis  and\nZhao, Theodore  and\nTinn, Robert  and\nKiblawi, Sid  and\nGu, Yu  and\nChaudhari, Akshay  and\nPoon, Hoifung  and\nZhang, Sheng  and\nWei, Mu  and\nPreston, J."
  ],
  "year": "2023",
  "venue": "Proceedings of the 5th Clinical Natural Language Processing Workshop",
  "abstract": "Motivated by the scarcity of high-quality labeled biomedical text, as well as the success of data programming, we introduce KRISS-Search. By leveraging the Unified Medical Language Systems (UMLS) ontology, KRISS-Search addresses an interactive few-shot span recommendation task that we propose. We first introduce unsupervised KRISS-Search and show that our method outperforms existing methods in identifying spans that are semantically similar to a given span of interest, with >50% AUPRC improvement relative to PubMedBERT. We then introduce supervised KRISS-Search, which leverages human interaction to improve the notion of similarity used by unsupervised KRISS-Search. Through simulated human feedback, we demonstrate an enhanced F1 score of 0.68 in classifying spans as semantically similar or different in the low-label setting, outperforming PubMedBERT by 2 F1 points. Finally, supervised KRISS-Search demonstrates competitive or superior performance compared to PubMedBERT in few-shot biomedical named entity recognition (NER) across five benchmark datasets, with an average improvement of 5.6 F1 points. We envision KRISS-Search increasing the efficiency of programmatic data labeling and also providing broader utility as an interactive biomedical search engine.",
  "keywords": [
    "feedback",
    "efficiency",
    "we",
    "simulated human feedback",
    "few-shot biomedical",
    "shot",
    "the efficiency",
    "unified",
    "ontology kriss-search addresses",
    "an enhanced f1 score",
    "ner",
    "text",
    "2 f1 points",
    "language",
    "human"
  ],
  "url": "https://aclanthology.org/2023.clinicalnlp-1.40/",
  "provenance": {
    "collected_at": "2025-06-05 10:23:49",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}