{
  "id": "2023.clinicalnlp-1.37",
  "title": "Automatic Coding at Scale: Design and Deployment of a Nationwide System for Normalizing Referrals in the {C}hilean Public Healthcare System",
  "authors": [
    "Villena, Fabi{\\'a}n  and\nRojas, Mat{\\'i}as  and\nArias, Felipe  and\nPacheco, Jorge  and\nVera, Paulina  and\nDunstan, Jocelyn"
  ],
  "year": "2023",
  "venue": "Proceedings of the 5th Clinical Natural Language Processing Workshop",
  "abstract": "The disease coding task involves assigning a unique identifier from a controlled vocabulary to each disease mentioned in a clinical document. This task is relevant since it allows information extraction from unstructured data to perform, for example, epidemiological studies about the incidence and prevalence of diseases in a determined context. However, the manual coding process is subject to errors as it requires medical personnel to be competent in coding rules and terminology. In addition, this process consumes a lot of time and energy, which could be allocated to more clinically relevant tasks. These difficulties can be addressed by developing computational systems that automatically assign codes to diseases. In this way, we propose a two-step system for automatically coding diseases in referrals from the Chilean public healthcare system. Specifically, our model uses a state-of-the-art NER model for recognizing disease mentions and a search engine system based on Elasticsearch for assigning the most relevant codes associated with these disease mentions. The system’s performance was evaluated on referrals manually coded by clinical experts. Our system obtained a MAP score of 0.63 for the subcategory level and 0.83 for the category level, close to the best-performing models in the literature. This system could be a support tool for health professionals, optimizing the coding and management process. Finally, to guarantee reproducibility, we publicly release the code of our models and experiments.",
  "keywords": [
    "code",
    "support",
    "extraction",
    "a unique identifier",
    "we",
    "it",
    "map",
    "information",
    "epidemiological studies",
    "difficulties",
    "energy",
    "ner",
    "identifier",
    "process",
    "model"
  ],
  "url": "https://aclanthology.org/2023.clinicalnlp-1.37/",
  "provenance": {
    "collected_at": "2025-06-05 10:23:47",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}