{
  "id": "2023.acl-long.231",
  "title": "Counterfactual Multihop {QA}: A Cause-Effect Approach for Reducing Disconnected Reasoning",
  "authors": [
    "Guo, Wangzhen  and\nGong, Qinkang  and\nRao, Yanghui  and\nLai, Hanjiang"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Multi-hop QA requires reasoning over multiple supporting facts to answer the question. However, the existing QA models always rely on shortcuts, e.g., providing the true answer by only one fact, rather than multi-hop reasoning, which is referred as disconnected reasoning problem. To alleviate this issue, we propose a novel counterfactual multihop QA, a causal-effect approach that enables to reduce the disconnected reasoning. It builds upon explicitly modeling of causality: 1) the direct causal effects of disconnected reasoning and 2) the causal effect of true multi-hop reasoning from the total causal effect. With the causal graph, a counterfactual inference is proposed to disentangle the disconnected reasoning from the total causal effect, which provides us a new perspective and technology to learn a QA model that exploits the true multi-hop reasoning instead of shortcuts. Extensive experiments have been conducted on the benchmark HotpotQA dataset, which demonstrate that the proposed method can achieve notable improvement on reducing disconnected reasoning. For example, our method achieves 5.8% higher points of its Supps score on HotpotQA through true multihop reasoning. The code is available athttps://github.com/guowzh/CFMQA.",
  "keywords": [
    "the benchmark hotpotqa",
    "code",
    "disconnected reasoning multi-hop qa",
    "question",
    "we",
    "graph",
    "the existing qa models",
    "answer",
    "it",
    "hotpotqa",
    "a qa model",
    "model",
    "cfmqa",
    "modeling",
    "us"
  ],
  "url": "https://aclanthology.org/2023.acl-long.231/",
  "provenance": {
    "collected_at": "2025-06-05 09:38:33",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}