{
  "id": "2023.acl-long.278",
  "title": "IM}-{TQA}: A {C}hinese Table Question Answering Dataset with Implicit and Multi-type Table Structures",
  "authors": [
    "Zheng, Mingyu  and\nHao, Yang  and\nJiang, Wenbin  and\nLin, Zheng  and\nLyu, Yajuan  and\nShe, QiaoQiao  and\nWang, Weiping"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Various datasets have been proposed to promote the development of Table Question Answering (TQA) technique. However, the problem setting of existing TQA benchmarks suffers from two limitations. First, they directly provide models with explicit table structures where row headers and column headers of the table are explicitly annotated and treated as model input during inference. Second, they only consider tables of limited types and ignore other tables especially complex tables with flexible header locations. Such simplified problem setting cannot cover practical scenarios where models need to process tables without header annotations in the inference phase or tables of different types. To address above issues, we construct a new TQA dataset with implicit and multi-type table structures, named IM-TQA, which not only requires the model to understand tables without directly available header annotations but also to handle multi-type tables including previously neglected complex tables. We investigate the performance of recent methods on our dataset and find that existing methods struggle in processing implicit and multi-type table structures. Correspondingly, we propose an RGCN-RCI framework outperforming recent baselines. We will release our dataset to facilitate future research.",
  "keywords": [
    "a new tqa",
    "question",
    "im-tqa",
    "we",
    "tqa",
    "existing tqa benchmarks",
    "processing",
    "i",
    "tqa technique",
    "model",
    "multi",
    "future research",
    "recent",
    "framework",
    "models"
  ],
  "url": "https://aclanthology.org/2023.acl-long.278/",
  "provenance": {
    "collected_at": "2025-06-05 09:39:11",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}