{
  "id": "2023.findings-acl.692",
  "title": "Structured Pruning for Efficient Generative Pre-trained Language Models",
  "authors": [
    "Tao, Chaofan  and\nHou, Lu  and\nBai, Haoli  and\nWei, Jiansheng  and\nJiang, Xin  and\nLiu, Qun  and\nLuo, Ping  and\nWong, Ngai"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "The increasing sizes of large generative Pre-trained Language Models (PLMs) hinder their deploymentin real-world applications. To obtain efficient PLMs, previous studies mostly focus on pruning the attention heads and feed-forward networks (FFNs) of the Transformer. Nevertheless, we find that in generative PLMs, the hidden dimension shared by many other modules (e.g., embedding layer and layer normalization) contains persistent outliers regardless of the network input. This study comprehensively investigates the structured pruning of generative PLMs with all the above compressible components. To identify redundant network structures, we assign learnable masks over compressible components followed by sparse training. Various sizes of PLMs can be flexibly extracted via different thresholds, and are then task-specifically fine-tuned for further improvement. Extensive experiments on language modeling, summarization and machine translation validate the effectiveness of the proposed method. For example, the pruned BART brings 1.51x/6.96x inference speedup on GPU/CPU with 67% size reduction, and can be further combined with quantization for more than 25×compression.",
  "keywords": [
    "generative plms",
    "language modeling summarization",
    "efficient",
    "machine translation",
    "layer",
    "summarization",
    "we",
    "persistent outliers",
    "the attention heads",
    "translation",
    "layer normalization",
    "feed",
    "reduction",
    "generative",
    "efficient plms"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.692/",
  "provenance": {
    "collected_at": "2025-06-05 10:18:01",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}