{
  "id": "2023.cawl-1.3",
  "title": "Preserving the Authenticity of Handwritten Learner Language: Annotation Guidelines for Creating Transcripts Retaining Orthographic Features",
  "authors": [
    "Gold, Christian  and\nLaarmann-quante, Ronja  and\nZesch, Torsten"
  ],
  "year": "2023",
  "venue": "Proceedings of the Workshop on Computation and Written Language (CAWL 2023)",
  "abstract": "Handwritten texts produced by young learners often contain orthographic features like spelling errors, capitalization errors, punctuation errors, and impurities such as strikethroughs, inserts, and smudges. All of those are typically normalized or ignored in existing transcriptions. For applications like handwriting recognition with the goal of automatically analyzing a learner’s language performance, however, retaining such features would be necessary. To address this, we present transcription guidelines that retain the features addressed above. Our guidelines were developed iteratively and include numerous example images to illustrate the various issues. On a subset of about 90 double-transcribed texts, we compute inter-annotator agreement and show that our guidelines can be applied with high levels of percentage agreement of about .98. Overall, we transcribed 1,350 learner texts, which is about the same size as the widely adopted handwriting recognition datasets IAM (1,500 pages) and CVL (1,600 pages). Our final corpus can be used to train a handwriting recognition system that transcribes closely to the real productions by young learners. Such a system is a prerequisite for applying automatic orthography feedback systems to handwritten texts in the future.",
  "keywords": [
    "feedback",
    "1 350 learner texts",
    "all",
    "we",
    "learner",
    "language",
    "learners",
    "impurities",
    "young learners",
    "transcribed",
    "the various issues",
    "handwriting recognition",
    "percentage",
    "the features",
    "inter-annotator agreement"
  ],
  "url": "https://aclanthology.org/2023.cawl-1.3/",
  "provenance": {
    "collected_at": "2025-06-05 10:23:08",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}