{
  "id": "2023.findings-acl.220",
  "title": "Multilingual Summarization with Factual Consistency Evaluation",
  "authors": [
    "Aharoni, Roee  and\nNarayan, Shashi  and\nMaynez, Joshua  and\nHerzig, Jonathan  and\nClark, Elizabeth  and\nLapata, Mirella"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Abstractive summarization has enjoyed renewed interest in recent years, thanks to pre-trained language models and the availability of large-scale datasets. Despite promising results, current models still suffer from generating factually inconsistent summaries, reducing their utility for real-world application. Several recent efforts attempt to address this by devising models that automatically detect factual inconsistencies in machine generated summaries. However, they focus exclusively on English, a language with abundant resources. In this work, we leverage factual consistency evaluation models to improvemultilingualsummarization. We explore two intuitive approaches to mitigate hallucinations based on the signal provided by a multilingual NLI model, namely data filtering and controlled generation. Experimental results in the 45 languages from the XLSum dataset show gains over strong baselines in both automatic and human evaluation. We release models and human judgements of summaries to foster progress towards more factually consistent multilingual summarization.",
  "keywords": [
    "summarization",
    "we",
    "current",
    "factual inconsistencies",
    "pre-trained language models",
    "factually inconsistent summaries",
    "improvemultilingualsummarization",
    "factual consistency evaluation models",
    "controlled generation experimental results",
    "multilingual summarization",
    "work",
    "inconsistencies",
    "summaries",
    "language",
    "generation"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.220/",
  "provenance": {
    "collected_at": "2025-06-05 09:56:18",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}