{
  "id": "2023.acl-short.22",
  "title": "A Natural Bias for Language Generation Models",
  "authors": [
    "Meister, Clara  and\nStokowiec, Wojciech  and\nPimentel, Tiago  and\nYu, Lei  and\nRimell, Laura  and\nKuncoro, Adhiguna"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers)",
  "abstract": "After just a few hundred training updates, a standard probabilistic model for language generation has likely not yet learnt many semantic or syntactic rules of natural language, making it difficult to estimate the probability distribution over next tokens. Yet around this point, these models have identified a simple, loss-minimising behaviour: to output the unigram distribution of the target training corpus. The use of such a heuristic raises the question: Can we initialise our models with this behaviour and save precious compute resources and model capacity? Here we show that we can effectively endow standard neural language generation models with a separate module that reflects unigram frequency statistics as prior knowledge, simply by initialising the bias term in a model’s final linear layer with the log-unigram distribution. We use neural machine translation as a test bed for this simple technique and observe that it: (i) improves learning efficiency; (ii) achieves better overall performance; and perhaps most importantly (iii) appears to disentangle strong frequency effects by encouraging the model to specialise in non-frequency-related aspects of language.",
  "keywords": [
    "bias",
    "neural machine translation",
    "question",
    "layer",
    "efficiency",
    "semantic",
    "the bias term",
    "we",
    "efficiency ii",
    "training",
    "translation",
    "language generation",
    "neural",
    "natural",
    "it"
  ],
  "url": "https://aclanthology.org/2023.acl-short.22/",
  "provenance": {
    "collected_at": "2025-06-05 09:48:32",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}