{
  "id": "2023.findings-acl.729",
  "title": "Dipping {PLM}s Sauce: Bridging Structure and Text for Effective Knowledge Graph Completion via Conditional Soft Prompting",
  "authors": [
    "Chen, Chen  and\nWang, Yufei  and\nSun, Aixin  and\nLi, Bing  and\nLam, Kwok-Yan"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Knowledge Graph Completion (KGC) often requires both KG structural and textual information to be effective. Pre-trained Language Models (PLMs) have been used to learn the textual information, usually under the fine-tune paradigm for the KGC task. However, the fine-tuned PLMs often overwhelmingly focus on the textual information and overlook structural knowledge. To tackle this issue, this paper proposes CSProm-KG (Conditional Soft Prompts for KGC) which maintains a balance between structural information and textual knowledge. CSProm-KG only tunes the parameters of Conditional Soft Prompts that are generated by the entities and relations representations. We verify the effectiveness of CSProm-KG on three popular static KGC benchmarks WN18RR, FB15K-237 and Wikidata5M, and two temporal KGC benchmarks ICEWS14 and ICEWS05-15. CSProm-KG outperforms competitive baseline models and sets new state-of-the-art on these benchmarks. We conduct further analysis to show (i) the effectiveness of our proposed components, (ii) the efficiency of CSProm-KG, and (iii) the flexibility of CSProm-KG.",
  "keywords": [
    "sauce",
    "kgc",
    "efficiency",
    "we",
    "csprom-kg conditional soft prompts",
    "three popular static kgc",
    "graph",
    "csprom-kg",
    "effective knowledge graph completion",
    "the efficiency",
    "information",
    "pre-trained language models plms",
    "textual knowledge csprom-kg",
    "conditional soft prompts",
    "analysis"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.729/",
  "provenance": {
    "collected_at": "2025-06-05 10:18:31",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}