{
  "id": "2023.semeval-1.277",
  "title": "DAMO}-{NLP} at {S}em{E}val-2023 Task 2: A Unified Retrieval-augmented System for Multilingual Named Entity Recognition",
  "authors": [
    "Tan, Zeqi  and\nHuang, Shen  and\nJia, Zixia  and\nCai, Jiong  and\nLi, Yinghui  and\nLu, Weiming  and\nZhuang, Yueting  and\nTu, Kewei  and\nXie, Pengjun  and\nHuang, Fei  and\nJiang, Yong"
  ],
  "year": "2023",
  "venue": "Proceedings of the 17th International Workshop on Semantic Evaluation (SemEval-2023)",
  "abstract": "The MultiCoNER II shared task aims to tackle multilingual named entity recognition (NER) in fine-grained and noisy scenarios, and it inherits the semantic ambiguity and low-context setting of the MultiCoNER I task. To cope with these problems, the previous top systems in the MultiCoNER I either incorporate the knowledge bases or gazetteers. However, they still suffer from insufficient knowledge, limited context length, single retrieval strategy. In this paper, our team DAMO-NLP proposes a unified retrieval-augmented system (U-RaNER) for fine-grained multilingual NER. We perform error analysis on the previous top systems and reveal that their performance bottleneck lies in insufficient knowledge. Also, we discover that the limited context length causes the retrieval knowledge to be invisible to the model. To enhance the retrieval context, we incorporate the entity-centric Wikidata knowledge base, while utilizing the infusion approach to broaden the contextual scope of the model. Also, we explore various search strategies and refine the quality of retrieval knowledge. Our system wins 9 out of 13 tracks in the MultiCoNER II shared task. Additionally, we compared our system with ChatGPT, one of the large language models which have unlocked strong capabilities on many tasks. The results show that there is still much room for improvement for ChatGPT on the extraction task.",
  "keywords": [
    "multilingual named entity recognition",
    "extraction",
    "multiconer",
    "semantic",
    "insufficient knowledge",
    "we",
    "it",
    "unified",
    "retrieval",
    "u",
    "chatgpt",
    "raner",
    "the multiconer",
    "analysis",
    "ner"
  ],
  "url": "https://aclanthology.org/2023.semeval-1.277/",
  "provenance": {
    "collected_at": "2025-06-05 10:30:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}