{
  "id": "2023.findings-acl.411",
  "title": "Werewolf Among Us: Multimodal Resources for Modeling Persuasion Behaviors in Social Deduction Games",
  "authors": [
    "Lai, Bolin  and\nZhang, Hongxin  and\nLiu, Miao  and\nPariani, Aryan  and\nRyan, Fiona  and\nJia, Wenqi  and\nHayati, Shirley Anugrah  and\nRehg, James  and\nYang, Diyi"
  ],
  "year": "2023",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2023",
  "abstract": "Persuasion modeling is a key building block for conversational agents. Existing works in this direction are limited to analyzing textual dialogue corpus. We argue that visual signals also play an important role in understanding human persuasive behaviors. In this paper, we introduce the first multimodal dataset for modeling persuasion behaviors. Our dataset includes 199 dialogue transcriptions and videos captured in a multi-player social deduction game setting, 26,647 utterance level annotations of persuasion strategy, and game level annotations of deduction game outcomes. We provide extensive experiments to show how dialogue context and visual signals benefit persuasion strategy prediction. We also explore the generalization ability of language models for persuasion modeling and the role of persuasion strategies in predicting social deduction game outcomes. Our dataset can be found at https://persuasion-deductiongame. socialai-data.org. The codes and models are available athttps://github.com/SALT-NLP/PersuationGames.",
  "keywords": [
    "the generalization ability",
    "we",
    "dialogue",
    "textual dialogue corpus",
    "199 dialogue transcriptions",
    "visual",
    "dialogue context",
    "strategies",
    "language models",
    "generalization",
    "persuasion strategies",
    "language",
    "nlp",
    "human",
    "conversational agents"
  ],
  "url": "https://aclanthology.org/2023.findings-acl.411/",
  "provenance": {
    "collected_at": "2025-06-05 10:14:12",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}