{
  "id": "2023.acl-short.97",
  "title": "R}e{A}ug{KD}: Retrieval-Augmented Knowledge Distillation For Pre-trained Language Models",
  "authors": [
    "Zhang, Jianyi  and\nMuhamed, Aashiq  and\nAnantharaman, Aditya  and\nWang, Guoyin  and\nChen, Changyou  and\nZhong, Kai  and\nCui, Qingjun  and\nXu, Yi  and\nZeng, Belinda  and\nChilimbi, Trishul  and\nChen, Yiran"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers)",
  "abstract": "Knowledge Distillation (KD) is one of the most effective approaches to deploying large-scale pre-trained language models in low-latency environments by transferring the knowledge contained in the large-scale models to smaller student models. Prior KD approaches use the soft labels and intermediate activations generated by the teacher to transfer knowledge to the student model parameters alone. In this paper, we show that having access to non-parametric memory in the form of a knowledge base with the teacher’s soft labels and predictions can further improve student generalization. To enable the student to retrieve from the knowledge base effectively, we propose a new framework and loss function that preserves the semantic similarities of teacher and student training examples. We show through extensive experiments that our retrieval mechanism can achieve state-of-the-art performance for task-specific knowledge distillation on the GLUE benchmark.",
  "keywords": [
    "large-scale pre-trained language models",
    "form",
    "semantic",
    "we",
    "activations",
    "intermediate activations",
    "our retrieval mechanism",
    "student generalization",
    "training",
    "retrieval",
    "loss",
    "the semantic similarities",
    "generalization",
    "soft",
    "function"
  ],
  "url": "https://aclanthology.org/2023.acl-short.97/",
  "provenance": {
    "collected_at": "2025-06-05 09:49:36",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}