{
  "id": "2023.acl-long.38",
  "title": "L}ex{S}ym: Compositionality as Lexical Symmetry",
  "authors": [
    "Akyurek, Ekin  and\nAndreas, Jacob"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "In tasks like semantic parsing, instruction following, and question answering, standard deep networks fail to generalize compositionally from small datasets. Many existing approaches overcome this limitation with model architectures that enforce a compositional process of sentence interpretation. In this paper, we present a domain-general and model-agnostic formulation of compositionality as a constraint on symmetries of data distributions rather than models. Informally, we prove that whenever a task can be solved by a compositional model, there is a corresponding data augmentation scheme — a procedure for transforming examples into other well-formed examples — that imparts compositional inductive bias on any model trained to solve the same task. We describe a procedure called LexSym that discovers these transformations automatically, then applies them to training data for ordinary neural sequence models. Unlike existing compositional data augmentation procedures, LexSym can be deployed agnostically across text, structured data, and even images. It matches or surpasses state-of-the-art, task-specific models on COGS semantic parsing, SCAN and Alchemy instruction following, and CLEVR-CoGenT visual question answering datasets.",
  "keywords": [
    "deep",
    "bias",
    "parsing",
    "question",
    "semantic",
    "we",
    "symmetries",
    "instruction",
    "neural",
    "it",
    "compositional inductive bias",
    "sequence",
    "visual",
    "semantic parsing instruction",
    "text"
  ],
  "url": "https://aclanthology.org/2023.acl-long.38/",
  "provenance": {
    "collected_at": "2025-06-05 09:35:51",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}