{
  "id": "2023.acl-long.394",
  "title": "Automatic Creation of Named Entity Recognition Datasets by Querying Phrase Representations",
  "authors": [
    "Kim, Hyunjae  and\nYoo, Jaehyo  and\nYoon, Seunghyun  and\nKang, Jaewoo"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Most weakly supervised named entity recognition (NER) models rely on domain-specific dictionaries provided by experts. This approach is infeasible in many domains where dictionaries do not exist. While a phrase retrieval model was used to construct pseudo-dictionaries with entities retrieved from Wikipedia automatically in a recent study, these dictionaries often have limited coverage because the retriever is likely to retrieve popular entities rather than rare ones. In this study, we present a novel framework, HighGEN, that generates NER datasets with high-coverage pseudo-dictionaries. Specifically, we create entity-rich dictionaries with a novel search method, called phrase embedding search, which encourages the retriever to search a space densely populated with various entities. In addition, we use a new verification process based on the embedding distance between candidate entity mentions and entity types to reduce the false-positive noise in weak labels generated by high-coverage dictionaries. We demonstrate that HighGEN outperforms the previous best model by an average F1 score of 4.7 across five NER benchmark datasets.",
  "keywords": [
    "high-coverage dictionaries",
    "embedding search",
    "we",
    "an average f1 score",
    "various entities",
    "retrieval",
    "rich",
    "a phrase retrieval model",
    "popular entities",
    "ner",
    "the embedding distance",
    "the retriever",
    "these dictionaries",
    "-",
    "entity-rich dictionaries"
  ],
  "url": "https://aclanthology.org/2023.acl-long.394/",
  "provenance": {
    "collected_at": "2025-06-05 09:40:46",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}