{
  "id": "2023.starsem-1.29",
  "title": "Guiding Zero-Shot Paraphrase Generation with Fine-Grained Control Tokens",
  "authors": [
    "Vahtola, Teemu  and\nCreutz, Mathias  and\nTiedemann, Jrg"
  ],
  "year": "2023",
  "venue": "Proceedings of the 12th Joint Conference on Lexical and Computational Semantics (*SEM 2023)",
  "abstract": "Sequence-to-sequence paraphrase generation models often struggle with the generation of diverse paraphrases. This deficiency constrains the viability of leveraging paraphrase generation in different Natural Language Processing tasks. We propose a translation-based guided paraphrase generation model that learns useful features for promoting surface form variation in generated paraphrases from cross-lingual parallel data. Our proposed method leverages multilingual neural machine translation pretraining to learn zero-shot paraphrasing. Furthermore, we incorporate dedicated prefix tokens into the training of the machine translation models to promote variation. The prefix tokens are designed to affect various linguistic features related to surface form realizations, and can be applied during inference to guide the decoding process towards a desired solution. We assess the proposed guided model on paraphrase generation in three languages, English, Finnish, and Swedish, and provide analysis on the feasibility of the prefix tokens to guided paraphrasing. Our analysis suggests that the attributes represented by the prefix tokens are useful in promoting variation, by pushing the paraphrases generated by the guided model to diverge from the input sentence while preserving semantics conveyed by the sentence well.",
  "keywords": [
    "paraphrase generation",
    "the generation",
    "form",
    "we",
    "shot",
    "training",
    "translation",
    "cross",
    "preserving semantics",
    "neural",
    "natural",
    "generated paraphrases",
    "semantics",
    "deficiency",
    "sequence"
  ],
  "url": "https://aclanthology.org/2023.starsem-1.29/",
  "provenance": {
    "collected_at": "2025-06-05 10:31:56",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}