{
  "id": "2023.acl-long.373",
  "title": "Learning Symbolic Rules over {A}bstract {M}eaning {R}epresentations for Textual Reinforcement Learning",
  "authors": [
    "Chaudhury, Subhajit  and\nSwaminathan, Sarathkrishna  and\nKimura, Daiki  and\nSen, Prithviraj  and\nMurugesan, Keerthiram  and\nUceda-Sosa, Rosario  and\nTatsubori, Michiaki  and\nFokoue, Achille  and\nKapanipathi, Pavan  and\nMunawar, Asim  and\nGray, Alexander"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Text-based reinforcement learning agents have predominantly been neural network-based models with embeddings-based representation, learning uninterpretable policies that often do not generalize well to unseen games. On the other hand, neuro-symbolic methods, specifically those that leverage an intermediate formal representation, are gaining significant attention in language understanding tasks. This is because of their advantages ranging from inherent interpretability, the lesser requirement of training data, and being generalizable in scenarios with unseen data. Therefore, in this paper, we propose a modular, NEuro-Symbolic Textual Agent (NESTA) that combines a generic semantic parser with a rule induction system to learn abstract interpretable rules as policies. Our experiments on established text-based game benchmarks show that the proposed NESTA method outperforms deep reinforcement learning-based techniques by achieving better generalization to unseen test games and learning from fewer training interactions.",
  "keywords": [
    "deep",
    "embeddings-based representation",
    "generalizable",
    "semantic",
    "we",
    "training",
    "neural",
    "policies",
    "uninterpretable policies",
    "learning",
    "a generic semantic parser",
    "deep reinforcement learning-based techniques",
    "text",
    "generic",
    "generalization"
  ],
  "url": "https://aclanthology.org/2023.acl-long.373/",
  "provenance": {
    "collected_at": "2025-06-05 09:40:29",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}