{
  "id": "2023.acl-long.359",
  "title": "Are Fairy Tales Fair? Analyzing Gender Bias in Temporal Narrative Event Chains of Children{'}s Fairy Tales",
  "authors": [
    "Toro Isaza, Paulina  and\nXu, Guangxuan  and\nOloko, Toye  and\nHou, Yufang  and\nPeng, Nanyun  and\nWang, Dakuo"
  ],
  "year": "2023",
  "venue": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Social biases and stereotypes are embedded in our culture in part through their presence in our stories, as evidenced by the rich history of humanities and social science literature analyzing such biases in children stories. Because these analyses are often conducted manually and at a small scale, such investigations can benefit from the use of more recent natural language processing (NLP) methods that examine social bias in models and data corpora. Our work joins this interdisciplinary effort and makes a unique contribution by taking into account the event narrative structures when analyzing the social bias of stories. We propose a computational pipeline that automatically extracts a story’s temporal narrative verb-based event chain for each of its characters as well as character attributes such as gender. We also present a verb-based event annotation scheme that can facilitate bias analysis by including categories such as those that align with traditional stereotypes. Through a case study analyzing gender bias in fairy tales, we demonstrate that our framework can reveal bias in not only the unigram verb-based events in which female and male characters participate but also in the temporal narrative order of such event participation.",
  "keywords": [
    "social science literature",
    "bias",
    "chain",
    "humanities",
    "we",
    "social bias",
    "natural",
    "science",
    "rich",
    "analysis",
    "children stories",
    "processing",
    "categories",
    "bias analysis",
    "such biases"
  ],
  "url": "https://aclanthology.org/2023.acl-long.359/",
  "provenance": {
    "collected_at": "2025-06-05 09:40:17",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}