{
  "id": "2024.acl-long.734",
  "title": "Spatially-Aware Speaker for Vision-and-Language Navigation Instruction Generation",
  "authors": [
    "Gopinathan, Muraleekrishna  and\nMasek, Martin  and\nAbu-Khalaf, Jumana  and\nSuter, David"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Embodied AI aims to develop robots that canunderstandand execute human language instructions, as well as communicate in natural languages. On this front, we study the task of generating highly detailed navigational instructions for the embodied robots to follow. Although recent studies have demonstrated significant leaps in the generation of step-by-step instructions from sequences of images, the generated instructions lack variety in terms of their referral to objects and landmarks. Existing speaker models learn strategies to evade the evaluation metrics and obtain higher scores even for low-quality sentences. In this work, we propose SAS (Spatially-Aware Speaker), an instruction generator orSpeakermodel that utilises both structural and semantic knowledge of the environment to produce richer instructions. For training, we employ a reward learning method in an adversarial setting to avoid systematic bias introduced by language evaluation metrics. Empirically, our method outperforms existing instruction generation models, evaluated using standard metrics. Our code is available at https://github.com/gmuraleekrishna/SAS.",
  "keywords": [
    "variety",
    "code",
    "bias",
    "the generation",
    "semantic",
    "we",
    "existing instruction generation models",
    "training",
    "instruction",
    "natural",
    "language evaluation metrics",
    "vision-and-language navigation instruction generation",
    "systematic bias",
    "the evaluation metrics",
    "metrics"
  ],
  "url": "https://aclanthology.org/2024.acl-long.734/",
  "provenance": {
    "collected_at": "2025-06-05 10:44:24",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}