{
  "id": "2024.acl-long.404",
  "title": "Advancement in Graph Understanding: A Multimodal Benchmark and Fine-Tuning of Vision-Language Models",
  "authors": [
    "Ai, Qihang  and\nLi, Jiafan  and\nDai, Jincheng  and\nZhou, Jianwu  and\nLiu, Lemao  and\nJiang, Haiyun  and\nShi, Shuming"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Graph data organizes complex relationships and interactions between objects, facilitating advanced analysis and decision-making across different fields. In this paper, we propose a new paradigm for interactive and instructional graph data understanding and reasoning.Instead of adopting complex graph neural models or heuristic graph-to-text instruction design, we leverage Vision-Language Models (VLMs) to encode the graph images with varying structures across different domains. This paper first evaluates the capabilities of public VLMs in graph learning from multiple aspects. Then it introduces a novel instruction-following dataset for multimodal graph understanding and reasoning in English and Chinese. Besides, by fine-tuning MiniGPT-4 and LLaVA on our dataset, we achieved an accuracy increase of 5%-15% compared to baseline models, with the best-performing model attaining scores comparable to Gemini in GPT-asissted Evaluation. This research not only showcases the potential of integrating VLMs with graph data but also opens new avenues for advancements in graph data understanding.",
  "keywords": [
    "we",
    "fields",
    "graph",
    "fine-tuning",
    "instruction",
    "neural",
    "it",
    "different fields",
    "the capabilities",
    "analysis",
    "an accuracy increase",
    "tuning",
    "gpt-asissted evaluation",
    "text",
    "fine"
  ],
  "url": "https://aclanthology.org/2024.acl-long.404/",
  "provenance": {
    "collected_at": "2025-06-05 10:39:51",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}