{
  "id": "2024.bionlp-1.28",
  "title": "Leveraging {LLM}s and Web-based Visualizations for Profiling Bacterial Host Organisms and Genetic Toolboxes",
  "authors": [
    "Park, Gilchan  and\nMutalik, Vivek  and\nNeely, Christopher  and\nSoto, Carlos  and\nYoo, Shinjae  and\nDehal, Paramvir"
  ],
  "year": "2024",
  "venue": "Proceedings of the 23rd Workshop on Biomedical Natural Language Processing",
  "abstract": "Building genetic tools to engineer microorganisms is at the core of understanding and redesigning natural biological systems for useful purposes. Every project to build such a genetic toolbox for an organism starts with a survey of available tools. Despite a decade-long investment and advancement in the field, it is still challenging to mine information about a genetic tool published in the literature and connect that information to microbial genomics and other microbial databases. This information gap not only limits our ability to identify and adopt available tools to a new chassis but also conceals available opportunities to engineer a new microbial host. Recent advances in natural language processing (NLP), particularly large language models (LLMs), offer solutions by enabling efficient extraction of genetic terms and biological entities from a vast array of publications. This work present a method to automate this process, using text-mining to refine models with data from bioRxiv and other databases. We evaluated various LLMs to investigate their ability to recognize bacterial host organisms and genetic toolboxes for engineering. We demonstrate our methodology with a web application that integrates a conversational LLM and visualization tool, connecting user inquiries to genetic resources and literature findings, thereby saving researchers time, money and effort in their laboratory work.",
  "keywords": [
    "extraction",
    "opportunities",
    "efficient",
    "field",
    "we",
    "llm",
    "natural",
    "the field",
    "it",
    "inquiries",
    "information",
    "natural language processing",
    "efficient extraction",
    "core",
    "llms"
  ],
  "url": "https://aclanthology.org/2024.bionlp-1.28/",
  "provenance": {
    "collected_at": "2025-06-05 11:04:18",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}