{
  "id": "2024.acl-long.388",
  "title": "Leveraging Large Language Models for Learning Complex Legal Concepts through Storytelling",
  "authors": [
    "Jiang, Hang  and\nZhang, Xiajie  and\nMahari, Robert  and\nKessler, Daniel  and\nMa, Eric  and\nAugust, Tal  and\nLi, Irene  and\nPentland, Alex  and\nKim, Yoon  and\nRoy, Deb  and\nKabbara, Jad"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Making legal knowledge accessible to non-experts is crucial for enhancing general legal literacy and encouraging civic participation in democracy. However, legal documents are often challenging to understand for people without legal backgrounds. In this paper, we present a novel application of large language models (LLMs) in legal education to help non-experts learn intricate legal concepts through storytelling, an effective pedagogical tool in conveying complex and abstract concepts. We also introduce a new dataset LegalStories, which consists of 294 complex legal doctrines, each accompanied by a story and a set of multiple-choice questions generated by LLMs. To construct the dataset, we experiment with various LLMs to generate legal stories explaining these concepts. Furthermore, we use an expert-in-the-loop approach to iteratively design multiple-choice questions. Then, we evaluate the effectiveness of storytelling with LLMs through randomized controlled trials (RCTs) with legal novices on 10 samples from the dataset. We find that LLM-generated stories enhance comprehension of legal concepts and interest in law among non-native speakers compared to only definitions. Moreover, stories consistently help participants relate legal concepts to their lives. Finally, we find that learning with stories shows a higher retention rate for non-native speakers in the follow-up assessment. Our work has strong implications for using LLMs in promoting teaching and learning in the legal field and beyond.",
  "keywords": [
    "general legal literacy",
    "legal stories",
    "rate",
    "field",
    "we",
    "a new dataset legalstories",
    "the legal field",
    "backgrounds",
    "legalstories",
    "llms",
    "llm-generated stories",
    "-",
    "stories",
    "various llms",
    "work"
  ],
  "url": "https://aclanthology.org/2024.acl-long.388/",
  "provenance": {
    "collected_at": "2025-06-05 10:39:38",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}