{
  "id": "2024.acl-long.681",
  "title": "L}ayer{S}kip: Enabling Early Exit Inference and Self-Speculative Decoding",
  "authors": [
    "Elhoushi, Mostafa  and\nShrivastava, Akshat  and\nLiskovich, Diana  and\nHosmer, Basil  and\nWasti, Bram  and\nLai, Liangzhen  and\nMahmoud, Anas  and\nAcun, Bilge  and\nAgarwal, Saurabh  and\nRoman, Ahmed  and\nAly, Ahmed  and\nChen, Beidi  and\nWu, Carole-Jean"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "We present LayerSkip, an end-to-end solution to speed-up inference of large language models (LLMs). First, during training we apply layer dropout, with low dropout rates for earlier layers and higher dropout rates for later layers, and an early exit loss where all transformer layers share the same exit. Second, during inference, we show that this training recipe increases the accuracy of early exit at earlier layers, without adding any auxiliary layers or modules to the model. Third, we present a novel self-speculative decoding solution where we exit at early layers and verify and correct with remaining layers of the model. Our proposed self-speculative decoding approach has less memory footprint than other speculative decoding approaches and benefits from shared compute and activations of the draft and verification stages. We run experiments on different Llama model sizes on different types of training: pretraining from scratch, continual pretraining, finetuning on specific data domain, and finetuning on specific task. We implement our inference solution and show speedups of up to 2.16x on summarization for CNN/DM documents, 1.82x on coding, and 2.0x on TOPv2 semantic parsing task. We open source our code at https://github.com/facebookresearch/LayerSkip.",
  "keywords": [
    "code",
    "the accuracy",
    "parsing",
    "end",
    "topv2 semantic parsing task",
    "layer",
    "semantic",
    "summarization",
    "we",
    "activations",
    "higher dropout rates",
    "training",
    "low dropout rates",
    "cnn",
    "self"
  ],
  "url": "https://aclanthology.org/2024.acl-long.681/",
  "provenance": {
    "collected_at": "2025-06-05 10:43:41",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}