{
  "id": "2024.hucllm-1.4",
  "title": "To What Extent Are Large Language Models Capable of Generating Substantial Reflections for Motivational Interviewing Counseling Chatbots? A Human Evaluation",
  "authors": [
    "Basar, Erkan  and\nHendrickx, Iris  and\nKrahmer, Emiel  and\nBruijn, Gert-Jan  and\nBosse, Tibor"
  ],
  "year": "2024",
  "venue": "Proceedings of the 1st Human-Centered Large Language Modeling Workshop",
  "abstract": "Motivational Interviewing is a counselling style that requires skillful usage of reflective listening and engaging in conversations about sensitive and personal subjects. In this paper, we investigate to what extent we can use generative large language models in motivational interviewing chatbots to generate precise and variable reflections on user responses. We conduct a two-step human evaluation where we first independently assess the generated reflections based on four criteria essential to health counseling; appropriateness, specificity, naturalness, and engagement. In the second step, we compare the overall quality of generated and human-authored reflections via a ranking evaluation. We use GPT-4, BLOOM, and FLAN-T5 models to generate motivational interviewing reflections, based on real conversational data collected via chatbots designed to provide support for smoking cessation and sexual health. We discover that GPT-4 can produce reflections of a quality comparable to human-authored reflections. Finally, we conclude that large language models have the potential to enhance and expand reflections in predetermined health counseling chatbots, but a comprehensive manual review is advised.",
  "keywords": [
    "support",
    "real conversational data",
    "generative large language models",
    "conversations",
    "we",
    "a ranking evaluation",
    "motivational interviewing reflections",
    "motivational interviewing counseling chatbots",
    "interviewing",
    "a comprehensive manual review",
    "generative",
    "chatbots",
    "a two-step human evaluation",
    "gpt-4",
    "predetermined health counseling chatbots"
  ],
  "url": "https://aclanthology.org/2024.hucllm-1.4/",
  "provenance": {
    "collected_at": "2025-06-05 11:06:25",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}