{
  "id": "2024.acl-long.251",
  "title": "S}tep{C}oder: Improving Code Generation with Reinforcement Learning from Compiler Feedback",
  "authors": [
    "Dou, Shihan  and\nLiu, Yan  and\nJia, Haoxiang  and\nZhou, Enyu  and\nXiong, Limao  and\nShan, Junjie  and\nHuang, Caishuang  and\nWang, Xiao  and\nFan, Xiaoran  and\nXi, Zhiheng  and\nZhou, Yuhao  and\nJi, Tao  and\nZheng, Rui  and\nZhang, Qi  and\nGui, Tao  and\nHuang, Xuanjing"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "The advancement of large language models (LLMs) has significantly propelled the field of code generation. Previous work integrated reinforcement learning (RL) with compiler feedback for exploring the output space of LLMs to enhance code generation quality. However, the lengthy code generated by LLMs in response to complex human requirements makes RL exploration a challenge. Also, since the unit tests may not cover the complicated code, optimizing LLMs by using these unexecuted code snippets is ineffective. To tackle these challenges, we introduceStepCoder, a novel RL framework for code generation, consisting of two main components: CCCS addresses the exploration challenge by breaking the long sequences code generation task into a Curriculum of Code Completion Subtasks, while FGO only optimizes the model by masking the unexecuted code segments to provide Fine-Grained Optimization. In addition, we furthermore construct the APPS+ dataset for RL training, which is manually verified to ensure the correctness of unit tests. Experimental results show that our method improves the ability to explore the output space and outperforms state-of-the-art approaches in corresponding benchmarks. The code and dataset will be made available upon publication.",
  "keywords": [
    "code",
    "feedback",
    "field",
    "we",
    "fine-grained optimization",
    "training",
    "the field",
    "learning",
    "llms",
    "code generation quality",
    "large language models llms",
    "work",
    "reinforcement",
    "oder",
    "generation"
  ],
  "url": "https://aclanthology.org/2024.acl-long.251/",
  "provenance": {
    "collected_at": "2025-06-05 10:37:44",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}