{
  "id": "2024.loresmt-1.4",
  "title": "Challenges in {U}rdu Machine Translation",
  "authors": [
    "Basit, Abdul  and\nAzeemi, Abdul Hameed  and\nRaza, Agha Ali"
  ],
  "year": "2024",
  "venue": "Proceedings of the Seventh Workshop on Technologies for Machine Translation of Low-Resource Languages (LoResMT 2024)",
  "abstract": "Recent advancements in Neural Machine Translation (NMT) systems have significantly improved model performance on various translation benchmarks. However, these systems still face numerous challenges when translating low-resource languages such as Urdu. In this work, we highlight the specific issues faced by machine translation systems when translating Urdu language. We first conduct a comprehensive evaluation of English to Urdu Machine Translation with four diverse models: GPT-3.5 (a large language model), opus-mt-en-ur (a bilingual translation model), NLLB (a model trained for translating 200 languages), and IndicTrans2 (a specialized model for translating low-resource Indic languages). The results demonstrate that IndicTrans2 significantly outperforms other models in Urdu Machine Translation. To understand the differences in the performance of these models, we analyze the Urdu word distribution in different training datasets and compare the training methodologies. Finally, we uncover the specific translation issues and provide suggestions for improvements in Urdu machine translation systems.",
  "keywords": [
    "work",
    "language",
    "translation",
    "neural",
    "methodologies",
    "machine",
    "various translation benchmarks",
    "a bilingual translation model",
    "model",
    "machine translation",
    "urdu machine translation",
    "u rdu machine translation",
    "the specific translation issues",
    "machine translation systems",
    "a comprehensive evaluation"
  ],
  "url": "https://aclanthology.org/2024.loresmt-1.4/",
  "provenance": {
    "collected_at": "2025-06-05 11:08:08",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}