{
  "id": "2024.argmining-1.6",
  "title": "Computational Modelling of Undercuts in Real-world Arguments",
  "authors": [
    "Ye, Yuxiao  and\nTeufel, Simone"
  ],
  "year": "2024",
  "venue": "Proceedings of the 11th Workshop on Argument Mining (ArgMining 2024)",
  "abstract": "Argument Mining (AM) is the task of automatically analysing arguments, such that the unstructured information contained in them is converted into structured representations. Undercut is a unique structure in arguments, as it challenges the relationship between a premise and a claim, unlike direct attacks which challenge the claim or the premise itself. Undercut is also an important counterargument device as it often reflects the value of arguers. However, undercuts have not received the attention in the filed of AM they should have — there is neither much corpus data about undercuts, nor an existing AM model that can automatically recognise them. In this paper, we present a real-world dataset of arguments with explicitly annotated undercuts, and the first computational model that is able to recognise them. The dataset consists of 400 arguments, containing 326 undercuts. On this dataset, our approach beats a strong baseline in undercut recognition, withF1= 38.8%, which is comparable to the performance on recognising direct attacks. We also conduct experiments on a benchmark dataset containing no undercuts, and prove that our approach is as good as the state of the art in terms of recognising the overall structure of arguments. Our work pioneers the systematic analysis and computational modelling of undercuts in real-world arguments, setting a foundation for future research in the role of undercuts in the dynamics of argumentation.",
  "keywords": [
    "we",
    "it",
    "withf1",
    "information",
    "analysis",
    "mining",
    "work",
    "model",
    "undercut recognition withf1",
    "attention",
    "the attention",
    "approach",
    "state",
    "future research",
    "a strong baseline"
  ],
  "url": "https://aclanthology.org/2024.argmining-1.6/",
  "provenance": {
    "collected_at": "2025-06-05 11:03:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}