{
  "id": "2024.wassa-1.24",
  "title": "Estimation of Happiness Changes through Longitudinal Analysis of Employees' Texts",
  "authors": [
    "Hayashi, Junko  and\nIto, Kazuhiro  and\nManabe, Masae  and\nWatanabe, Yasushi  and\nNakayama, Masataka  and\nUchida, Yukiko  and\nWakamiya, Shoko  and\nAramaki, Eiji"
  ],
  "year": "2024",
  "venue": "Proceedings of the 14th Workshop on Computational Approaches to Subjectivity, Sentiment, {\\&} Social Media Analysis",
  "abstract": "Measuring happiness as a determinant of well-being is increasingly recognized as crucial. While previous studies have utilized free-text descriptions to estimate happiness on a broad scale, limited research has focused on tracking individual fluctuations in happiness over time owing to the challenges associated with longitudinal data collection. This study addresses this issue by obtaining longitudinal data from two workplaces over two and six months respectively.Subsequently, the data is used to construct a happiness estimation model and assess individual happiness levels.Evaluation of the model performance using correlation coefficients shows variability in the correlation values among individuals.Notably, the model performs satisfactorily in estimating 9 of the 11 users’ happiness scores, with a correlation coefficient of 0.4 or higher. To investigate the factors affecting the model performance, we examine the relationship between the model performance and variables such as sentence length, lexical diversity, and personality traits. Correlations are observed between these features and model performance.",
  "keywords": [
    "we",
    "correlation coefficients",
    "a correlation coefficient",
    "analysis",
    "previous studies",
    "text",
    "individual happiness levels evaluation",
    "coefficient",
    "model",
    "studies",
    "evaluation",
    "time",
    "coefficients",
    "correlations",
    "diversity"
  ],
  "url": "https://aclanthology.org/2024.wassa-1.24/",
  "provenance": {
    "collected_at": "2025-06-05 11:11:54",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}