{
  "id": "2024.arabicnlp-1.29",
  "title": "Functional Text Dimensions for {A}rabic Text Classification",
  "authors": [
    "Ferhat, Zeyd  and\nBetka, Abir  and\nBarka, Riyadh  and\nKahhoul, Zineddine  and\nBoutiba, Selma  and\nTiar, Mohamed  and\nDahmani, Habiba  and\nAbdelali, Ahmed"
  ],
  "year": "2024",
  "venue": "Proceedings of the Second Arabic Natural Language Processing Conference",
  "abstract": "Text classification is of paramount importance in a wide range of applications, including information retrieval, extraction and sentiment analysis. The challenge of classifying and labelling text genres, especially in web-based corpora, has received considerable attention. The frequent absence of unambiguous genre information complicates the identification of text types. To address these issues, the Functional Text Dimensions (FTD) method has been introduced to provide a universal set of categories for text classification. This study presents the Arabic Functional Text Dimensions Corpus (AFTD Corpus), a carefully curated collection of documents for evaluating text classification in Arabic. The AFTD Corpus which we are making available to the community, consists of 3400 documents spanning 17 different class categories. Through a comprehensive evaluation using traditional machine learning and neural models, we assess the effectiveness of the FTD approach in the Arabic context. CAMeLBERT, a state-of-the-art model, achieved an impressive F1 score of 0.81 on our corpus. This research highlights the potential of the FTD method for improving text classification, especially for Arabic content, and underlines the importance of robust classification models in web applications.",
  "keywords": [
    "extraction",
    "we",
    "classification",
    "an impressive f1 score",
    "neural",
    "the arabic context camelbert",
    "considerable attention",
    "retrieval",
    "information",
    "a comprehensive evaluation",
    "learning",
    "traditional machine learning",
    "text classification",
    "analysis",
    "camelbert"
  ],
  "url": "https://aclanthology.org/2024.arabicnlp-1.29/",
  "provenance": {
    "collected_at": "2025-06-05 11:02:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}