{
  "id": "2024.findings-acl.909",
  "title": "Challenges to Evaluating the Generalization of Coreference Resolution Models: A Measurement Modeling Perspective",
  "authors": [
    "Porada, Ian  and\nOlteanu, Alexandra  and\nSuleman, Kaheer  and\nTrischler, Adam  and\nCheung, Jackie"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "It is increasingly common to evaluate the same coreference resolution (CR) model on multiple datasets. Do these multi-dataset evaluations allow us to draw meaningful conclusions about model generalization? Or, do they rather reflect the idiosyncrasies of a particular experimental setup (e.g., the specific datasets used)? To study this, we view evaluation through the lens of measurement modeling, a framework commonly used in the social sciences for analyzing the validity of measurements. By taking this perspective, we show how multi-dataset evaluations risk conflating different factors concerning what, precisely, is being measured. This in turn makes it difficult to draw more generalizable conclusions from these evaluations. For instance, we show that across seven datasets, measurements intended to reflect CR model generalization are often correlated with differences in both how coreference is defined and how it is operationalized; this limits our ability to draw conclusions regarding the ability of CR models to generalize across any singular dimension. We believe the measurement modeling framework provides the needed vocabulary for discussing challenges surrounding what is actually being measured by CR evaluations.",
  "keywords": [
    "multi-dataset evaluations",
    "model",
    "it",
    "cr evaluations",
    "evaluations",
    "cr model generalization",
    "the generalization",
    "more generalizable conclusions",
    "idiosyncrasies",
    "modeling",
    "sciences",
    "generalizable",
    "us",
    "generalization",
    "coreference resolution models"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.909/",
  "provenance": {
    "collected_at": "2025-06-05 11:00:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}