{
  "id": "2024.iwslt-1.30",
  "title": "Word Order in {E}nglish-{J}apanese Simultaneous Interpretation: Analyses and Evaluation using Chunk-wise Monotonic Translation",
  "authors": [
    "Doi, Kosuke  and\nKo, Yuka  and\nMakinae, Mana  and\nSudoh, Katsuhito  and\nNakamura, Satoshi"
  ],
  "year": "2024",
  "venue": "Proceedings of the 21st International Conference on Spoken Language Translation (IWSLT 2024)",
  "abstract": "This paper analyzes the features of monotonic translations, which follow the word order of the source language, in simultaneous interpreting (SI). Word order differences are one of the biggest challenges in SI, especially for language pairs with significant structural differences like English and Japanese. We analyzed the characteristics of chunk-wise monotonic translation (CMT) sentences using the NAIST English-to-Japanese Chunk-wise Monotonic Translation Evaluation Dataset and identified some grammatical structures that make monotonic translation difficult in English-Japanese SI. We further investigated the features of CMT sentences by evaluating the output from the existing speech translation (ST) and simultaneous speech translation (simulST) models on the NAIST English-to-Japanese Chunk-wise Monotonic Translation Evaluation Dataset as well as on existing test sets. The results indicate the possibility that the existing SI-based test set underestimates the model performance. The results also suggest that using CMT sentences as references gives higher scores to simulST models than ST models, and that using an offline-based test set to evaluate the simulST models underestimates the model performance.",
  "keywords": [
    "si",
    "we",
    "translation",
    "chunk-wise monotonic translation",
    "word",
    "monotonic translations",
    "monotonic translation",
    "language",
    "model",
    "evaluation",
    "translations",
    "the features",
    "characteristics",
    "interpreting",
    "biggest"
  ],
  "url": "https://aclanthology.org/2024.iwslt-1.30/",
  "provenance": {
    "collected_at": "2025-06-05 11:06:54",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}