{
  "id": "2024.textgraphs-1.6",
  "title": "Towards Understanding Attention-based Reasoning through Graph Structures in Medical Codes Classification",
  "authors": [
    "Goldstein, Noon  and\nAmin, Saadullah  and\nNeumann, G{\\\"u}nter"
  ],
  "year": "2024",
  "venue": "Proceedings of TextGraphs-17: Graph-based Methods for Natural Language Processing",
  "abstract": "A common approach to automatically assigning diagnostic and procedural clinical codes to health records is to solve the task as a multi-label classification problem. Difficulties associated with this task stem from domain knowledge requirements, long document texts, large and imbalanced label space, reflecting the breadth and dependencies between medical diagnoses and procedures. Decisions in the healthcare domain also need to demonstrate sound reasoning, both when they are correct and when they are erroneous. Existing works address some of these challenges by incorporating external knowledge, which can be encoded into a graph-structured format. Incorporating graph structures on the output label space or between the input document and output label spaces have shown promising results in medical codes classification. Limited focus has been put on utilizing graph-based representation on the input document space. To partially bridge this gap, we represent clinical texts as graph-structured data through the UMLS Metathesaurus; we explore implicit graph representation through pre-trained knowledge graph embeddings and explicit domain-knowledge guided encoding of document concepts and relational information through graph neural networks. Our findings highlight the benefits of pre-trained knowledge graph embeddings in understanding model’s attention-based reasoning. In contrast, transparent domain knowledge guidance in graph encoder approaches is overshadowed by performance loss. Our qualitative analysis identifies limitations that contribute to prediction errors.",
  "keywords": [
    "classification limited focus",
    "we",
    "graph",
    "classification",
    "neural",
    "dependencies",
    "loss",
    "identifies",
    "information",
    "format",
    "difficulties",
    "attention-based reasoning",
    "analysis",
    "embeddings",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2024.textgraphs-1.6/",
  "provenance": {
    "collected_at": "2025-06-05 11:11:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}