{
  "id": "2024.acl-long.341",
  "title": "Discursive Socratic Questioning: Evaluating the Faithfulness of Language Models' Understanding of Discourse Relations",
  "authors": [
    "Miao, Yisong  and\nLiu, Hongfu  and\nLei, Wenqiang  and\nChen, Nancy  and\nKan, Min-Yen"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "While large language models have significantly enhanced the effectiveness of discourse relation classifications, it remains unclear whether their comprehension is faithful and reliable. We provide DiSQ, a new method for evaluating the faithfulness of understanding discourse based on question answering. We first employ in-context learning to annotate the reasoning for discourse comprehension, based on the connections among key events within the discourse. Following this, DiSQ interrogates the model with a sequence of questions to assess its grasp of core event relations, its resilience to counterfactual queries, as well as its consistency to its previous responses. then evaluate language models with different architectural designs using DiSQ, finding: (1) DiSQ presents a significant challenge for all models, with the top-performing GPT model attaining only 41% of the ideal performance in PDTB; (2) DiSQ is robust to domain shifts and paraphrase variations; (3) Open-source models generally lag behind their closed-source GPT counterparts, with notable exceptions being those enhanced with chat and code/math features; (4) Our analysis validates the effectiveness of explicitly signalled discourse connectives, the role of contextual information, and the benefits of using historical QA data.",
  "keywords": [
    "code",
    "its resilience",
    "question",
    "we",
    "the top-performing gpt model",
    "it",
    "queries",
    "information",
    "learning",
    "sequence",
    "core",
    "analysis",
    "language models",
    "resilience",
    "chat"
  ],
  "url": "https://aclanthology.org/2024.acl-long.341/",
  "provenance": {
    "collected_at": "2025-06-05 10:38:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}