{
  "id": "2024.wassa-1.25",
  "title": "Subjectivity Theory vs. Speaker Intuitions: Explaining the Results of a Subjectivity Regressor Trained on Native Speaker Judgements",
  "authors": [
    "Savinova, Elena  and\nHoek, Jet"
  ],
  "year": "2024",
  "venue": "Proceedings of the 14th Workshop on Computational Approaches to Subjectivity, Sentiment, {\\&} Social Media Analysis",
  "abstract": "In this paper, we address the issue of explainability in a transformer-based subjectivity regressor trained on native English speakers’ judgements. The main goal of this work is to test how the regressor’s predictions, and therefore native speakers’ intuitions, relate to theoretical accounts of subjectivity. We approach this goal using two methods: a top-down manual selection of theoretically defined subjectivity features and a bottom-up extraction of top subjective and objective features using the LIME explanation method. The explainability of the subjectivity regressor is evaluated on a British news dataset containing sentences taken from social media news posts and from articles on the websites of the same news outlets. Both methods provide converging evidence that theoretically defined subjectivity features, such as emoji, evaluative adjectives, exclamations, questions, intensifiers, and first person pronouns, are prominent predictors of subjectivity scores. Thus, our findings show that the predictions of the regressor, and therefore native speakers’ perceptions of subjectivity, align with subjectivity theory. However, an additional comparison of the effects of different subjectivity features in author text and the text of cited sources reveals that the distinction between author and source subjectivity might not be as salient for naïve speakers as it is in the theory.",
  "keywords": [
    "extraction",
    "we",
    "it",
    "intensifiers",
    "align",
    "a transformer-based subjectivity regressor",
    "text",
    "objective",
    "work",
    "transformer",
    "salient",
    "theory",
    "thus our findings",
    "different subjectivity features",
    "this goal"
  ],
  "url": "https://aclanthology.org/2024.wassa-1.25/",
  "provenance": {
    "collected_at": "2025-06-05 11:11:55",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}