{
  "id": "2024.findings-acl.760",
  "title": "T}ext{EE}: Benchmark, Reevaluation, Reflections, and Future Challenges in Event Extraction",
  "authors": [
    "Huang, Kuan-Hao  and\nHsu, I-Hung  and\nParekh, Tanmay  and\nXie, Zhiyu  and\nZhang, Zixuan  and\nNatarajan, Prem  and\nChang, Kai-Wei  and\nPeng, Nanyun  and\nJi, Heng"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Event extraction has gained considerable interest due to its wide-ranging applications. However, recent studies draw attention to evaluation issues, suggesting that reported scores may not accurately reflect the true performance. In this work, we identify and address evaluation challenges, including inconsistency due to varying data assumptions or preprocessing steps, the insufficiency of current evaluation frameworks that may introduce dataset or data split bias, and the low reproducibility of some previous approaches. To address these challenges, we present TextEE, a standardized, fair, and reproducible benchmark for event extraction. TextEE comprises standardized data preprocessing scripts and splits for 16 datasets spanning eight diverse domains and includes 14 recent methodologies, conducting a comprehensive benchmark reevaluation. We also evaluate five varied large language models on our TextEE benchmark and demonstrate how they struggle to achieve satisfactory performance. Inspired by our reevaluation results and findings, we discuss the role of event extraction in the current NLP era, as well as future challenges and insights derived from TextEE. We believe TextEE, the first standardized comprehensive benchmarking tool, will significantly facilitate future event extraction research.",
  "keywords": [
    "bias",
    "varied",
    "insufficiency",
    "extraction",
    "ext",
    "era",
    "we",
    "current",
    "reevaluation",
    "14 recent methodologies",
    "current evaluation frameworks",
    "evaluation challenges",
    "a comprehensive benchmark reevaluation",
    "the insufficiency",
    "recent studies"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.760/",
  "provenance": {
    "collected_at": "2025-06-05 10:58:58",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}