{
  "id": "2024.climatenlp-1.2",
  "title": "Informing climate risk analysis using textual information - A research agenda",
  "authors": [
    "Dimmelmeier, Andreas  and\nDoll, Hendrik  and\nSchierholz, Malte  and\nKormanyos, Emily  and\nFehr, Maurice  and\nMa, Bolei  and\nBeck, Jacob  and\nFraser, Alexander  and\nKreuter, Frauke"
  ],
  "year": "2024",
  "venue": "Proceedings of the 1st Workshop on Natural Language Processing Meets Climate Change (ClimateNLP 2024)",
  "abstract": "We present a research agenda focused on efficiently extracting, assuring quality, and consolidating textual company sustainability information to address urgent climate change decision-making needs. Starting from the goal to create integrated FAIR (Findable, Accessible, Interoperable, Reusable) climate-related data, we identify research needs pertaining to the technical aspects of information extraction as well as to the design of the integrated sustainability datasets that we seek to compile. Regarding extraction, we leverage technological advancements, particularly in large language models (LLMs) and Retrieval-Augmented Generation (RAG) pipelines, to unlock the underutilized potential of unstructured textual information contained in corporate sustainability reports. In applying these techniques, we review key challenges, which include the retrieval and extraction of CO2emission values from PDF documents, especially from unstructured tables and graphs therein, and the validation of automatically extracted data through comparisons with human-annotated values. We also review how existing use cases and practices in climate risk analytics relate to choices of what textual information should be extracted and how it could be linked to existing structured data.",
  "keywords": [
    "validation",
    "extraction",
    "we",
    "it",
    "retrieval",
    "information",
    "analysis",
    "llms",
    "the retrieval",
    "retrieval-augmented generation rag pipelines",
    "large language models llms",
    "language",
    "generation",
    "human",
    "information extraction"
  ],
  "url": "https://aclanthology.org/2024.climatenlp-1.2/",
  "provenance": {
    "collected_at": "2025-06-05 11:05:10",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}