{
  "id": "2024.acl-long.578",
  "title": "CLAMBER}: A Benchmark of Identifying and Clarifying Ambiguous Information Needs in Large Language Models",
  "authors": [
    "Zhang, Tong  and\nQin, Peixin  and\nDeng, Yang  and\nHuang, Chen  and\nLei, Wenqiang  and\nLiu, Junhong  and\nJin, Dingnan  and\nLiang, Hongru  and\nChua, Tat-Seng"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Large language models (LLMs) are increasingly used to meet user information needs, but their effectiveness in dealing with user queries that contain various types of ambiguity remains unknown, ultimately risking user trust and satisfaction. To this end, we introduce CLAMBER, a benchmark for evaluating LLMs using a well-organized taxonomy. Building upon the taxonomy, we construct 12K high-quality data to assess the strengths, weaknesses, and potential risks of various off-the-shelf LLMs.Our findings indicate the limited practical utility of current LLMs in identifying and clarifying ambiguous user queries, even enhanced by chain-of-thought (CoT) and few-shot prompting. These techniques may result in overconfidence in LLMs and yield only marginal enhancements in identifying ambiguity. Furthermore, current LLMs fall short in generating high-quality clarifying questions due to a lack of conflict resolution and inaccurate utilization of inherent knowledge.In this paper, CLAMBER presents a guidance and promotes further research on proactive and trustworthy LLMs.",
  "keywords": [
    "end",
    "chain",
    "we",
    "current",
    "shot",
    "current llms",
    "few-shot",
    "proactive and trustworthy llms",
    "cot",
    "queries",
    "information",
    "llms",
    "furthermore current llms",
    "large language models llms",
    "user queries"
  ],
  "url": "https://aclanthology.org/2024.acl-long.578/",
  "provenance": {
    "collected_at": "2025-06-05 10:42:16",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}