{
  "id": "2024.findings-acl.776",
  "title": "The Art of Defending: A Systematic Evaluation and Analysis of {LLM} Defense Strategies on Safety and Over-Defensiveness",
  "authors": [
    "Varshney, Neeraj  and\nDolin, Pavel  and\nSeth, Agastya  and\nBaral, Chitta"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "As Large Language Models (LLMs) play an increasingly pivotal role in natural language processing applications, their safety concerns become critical areas of NLP research. This has resulted in the development of various LLM defense strategies. Unfortunately, despite the shared goal of improving the safety of LLMs, the evaluation suites across various research works are disjoint and lack diverse inputs to ensure accurate and precise evaluation estimates. Furthermore, the important factor of ‘over-defensiveness’ on the safe inputs has largely remained overlooked. Addressing these limitations, this paper presents a systematic evaluation, comparison, and analysis of various LLM defense strategies over both ‘safety’ and ‘over-defensiveness’. To this end, we compile a large and diverse collection of safe and unsafe prompts, design precise evaluation methodology, and study the efficacy of various LLM defense strategies on multiple state-of-the-art LLMs. Our work reveals a number of crucial findings that we believe will pave the way and also facilitate further research in the critical area of improving the safety of LLMs.",
  "keywords": [
    "end",
    "the evaluation suites",
    "we",
    "a systematic evaluation",
    "llm",
    "natural language processing applications",
    "natural",
    "various llm defense strategies",
    "analysis",
    "llms",
    "processing",
    "strategies",
    "a systematic evaluation comparison",
    "nlp research",
    "work"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.776/",
  "provenance": {
    "collected_at": "2025-06-05 10:59:11",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}