{
  "id": "2024.findings-acl.480",
  "title": "EC}o{K}: Emotional Commonsense Knowledge Graph for Mining Emotional Gold",
  "authors": [
    "Wang, Zhunheng  and\nLiu, Xiaoyi  and\nHu, Mengting  and\nYing, Rui  and\nJiang, Ming  and\nWu, Jianfeng  and\nXie, Yalan  and\nGao, Hang  and\nCheng, Renhong"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "The demand for understanding and expressing emotions in the field of natural language processing is growing rapidly. Knowledge graphs, as an important form of knowledge representation, have been widely utilized in various emotion-related tasks. However, existing knowledge graphs mainly focus on the representation and reasoning of general factual knowledge, while there are still significant deficiencies in the understanding and reasoning of emotional knowledge. In this work, we construct a comprehensive and accurate emotional commonsense knowledge graph, ECoK. We integrate cutting-edge theories from multiple disciplines such as psychology, cognitive science, and linguistics, and combine techniques such as large language models and natural language processing. By mining a large amount of text, dialogue, and sentiment analysis data, we construct rich emotional knowledge and establish the knowledge generation model COMET-ECoK. Experimental results show that ECoK contains high-quality emotional reasoning knowledge, and the performance of our knowledge generation model surpasses GPT-4-Turbo, which can help downstream tasks better understand and reason about emotions. Our data and code is available from https://github.com/ZornWang/ECoK.",
  "keywords": [
    "code",
    "theories",
    "field",
    "our knowledge generation model",
    "text dialogue",
    "form",
    "we",
    "dialogue",
    "gpt-4-turbo",
    "graph",
    "edge",
    "significant deficiencies",
    "natural",
    "the field",
    "science"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.480/",
  "provenance": {
    "collected_at": "2025-06-05 10:55:09",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}