{
  "id": "2024.findings-acl.891",
  "title": "S3-{DST}: Structured Open-Domain Dialogue Segmentation and State Tracking in the Era of {LLM}s",
  "authors": [
    "Das, Sarkar Snigdha Sarathi  and\nShah, Chirag  and\nWan, Mengting  and\nNeville, Jennifer  and\nYang, Longqi  and\nAndersen, Reid  and\nBuscher, Georg  and\nSafavi, Tara"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Traditional Dialogue State Tracking (DST) has focused on tracking preferences and intents in conversations centered around specific tasks (e.g. booking services). These conventional systems assume a relatively restricted conversation flow in which each turn gradually offers new information. However, advancements in Large Language Models (LLMs) have ushered in more versatile open-domain chat systems in which extended dialogue sessions encompassing numerous tasks and topics are common—in turn requiring new conversational tracking tools in order to successfully orchestrate such systems. Addressing these challenges, we introduce a novel approach combining dialogue segmentation and state tracking within open-domain dialogues, tailored for zero-shot applications appropriate to a true open-domain dialogue system. Our proposed method S3-DST employs a unique structured prompting technique and *Pre-Analytical Recollection*, a novel grounding mechanism we designed for improving long context tracking. Tested on proprietary anonymized open-domain dialogue datasets as well as publicly available DST and segmentation datasets, S3-DST consistently outperforms the state-of-the-art, showcasing its effectiveness and adaptability state tracking in the next wave of LLM-based chat systems. We also release S3-DST annotations with GPT-4 on a curated subset of LMSYS-Chat-1M to be used as a testbed to fuel research in this direction.",
  "keywords": [
    "conversations",
    "llm-based chat systems",
    "structured open-domain dialogue segmentation",
    "era",
    "we",
    "dialogue",
    "llm",
    "shot",
    "information",
    "open-domain dialogues",
    "m",
    "llms",
    "dialogue sessions",
    "dialogue segmentation",
    "large language models llms"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.891/",
  "provenance": {
    "collected_at": "2025-06-05 11:00:45",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}