{
  "id": "2024.acl-short.49",
  "title": "The Probabilities Also Matter: A More Faithful Metric for Faithfulness of Free-Text Explanations in Large Language Models",
  "authors": [
    "Siegel, Noah  and\nCamburu, Oana-Maria  and\nHeess, Nicolas  and\nPerez-Ortiz, Maria"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers)",
  "abstract": "In order to oversee advanced AI systems, it is important to understand their reasons for generating a given output. When prompted, large language models (LLMs) can provide natural language explanations or reasoning traces that sound plausible and receive high ratings from human annotators. However, it is unclear to what extent these explanations are truly capturing the factors responsible for the model’s predictions: the most “human-like” explanation may be different from the one that is most faithful to the model’s true decision making process. In this work, we introduce the correlational counterfactual test (CCT), a faithfulness metric based on counterfactual input edits that takes into account not just the binary label change, but the total shift in the model’s predicted label distribution. We evaluate the faithfulness of free-text explanations generated by few-shot-prompted LLMs from the Llama-2 family on three NLP tasks. We find that these explanations are indeed more likely to mention factors when they are impactful to the model’s prediction, with the degree of association increasing with model size but varying significantly by task.",
  "keywords": [
    "we",
    "shot",
    "natural",
    "it",
    "the probabilities",
    "llms",
    "metric",
    "text",
    "large language models llms",
    "work",
    "process",
    "language",
    "nlp",
    "model",
    "human"
  ],
  "url": "https://aclanthology.org/2024.acl-short.49/",
  "provenance": {
    "collected_at": "2025-06-05 10:46:52",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}