{
  "id": "2024.acl-long.138",
  "title": "H}y{C}o{R}ec: Hypergraph-Enhanced Multi-Preference Learning for Alleviating Matthew Effect in Conversational Recommendation",
  "authors": [
    "Zheng, Yongsen  and\nXu, Ruilin  and\nChen, Ziliang  and\nWang, Guohua  and\nQian, Mingjie  and\nQin, Jinghui  and\nLin, Liang"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "The Matthew effect is a notorious issue in Recommender Systems (RSs), i.e., the rich get richer and the poor get poorer, wherein popular items are overexposed while less popular ones are regularly ignored. Most methods examine Matthew effect in static or nearly-static recommendation scenarios. However, the Matthew effect will be increasingly amplified when the user interacts with the system over time. To address these issues, we propose a novel paradigm, Hypergraph-Enhanced Multi-Preference Learning for Alleviating Matthew Effect in Conversational Recommendation (HyCoRec), which aims to alleviate the Matthew effect in conversational recommendation. Concretely, HyCoRec devotes to alleviate the Matthew effect by learning multi-aspect preferences, i.e., item-, entity-, word-, review-, and knowledge-aspect preferences, to effectively generate responses in the conversational task and accurately predict items in the recommendation task when the user chats with the system over time. Extensive experiments conducted on two benchmarks validate that HyCoRec achieves new state-of-the-art performance and the superior of alleviating Matthew effect.",
  "keywords": [
    "knowledge",
    "i",
    "conversational recommendation",
    "conversational recommendation hycorec",
    "conversational",
    "e",
    "rich",
    "we",
    "learning",
    "the conversational task",
    "time",
    "that",
    "poorer",
    "recommender",
    "the matthew effect"
  ],
  "url": "https://aclanthology.org/2024.acl-long.138/",
  "provenance": {
    "collected_at": "2025-06-05 10:36:11",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}