{
  "id": "2024.acl-long.387",
  "title": "An Investigation of Neuron Activation as a Unified Lens to Explain Chain-of-Thought Eliciting Arithmetic Reasoning of {LLM}s",
  "authors": [
    "Rai, Daking  and\nYao, Ziyu"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Large language models (LLMs) have shown strong arithmetic reasoning capabilities when prompted with Chain-of-Thought (CoT) prompts. However, we have only a limited understanding of how they are processed by LLMs. To demystify it, prior work has primarily focused on ablating different components in the CoT prompt and empirically observing their resulting LLM performance change. Yet, the reason why these components are important to LLM reasoning is not explored. To fill this gap, in this work, we investigate “neuron activation” as a lens to provide a unified explanation to observations made by prior work. Specifically, we look into neurons within the feed-forward layers of LLMs that may have activated their arithmetic reasoning capabilities, using Llama2 as an example. To facilitate this investigation, we also propose an approach based on GPT-4 to automatically identify neurons that imply arithmetic reasoning. Our analyses revealed that the activation of reasoning neurons in the feed-forward layers of an LLM can explain the importance of various components in a CoT prompt, and future research can extend it for a more complete understanding.",
  "keywords": [
    "a cot prompt",
    "chain",
    "an llm",
    "we",
    "llm",
    "cot",
    "it",
    "unified",
    "a unified lens",
    "llm reasoning",
    "the activation",
    "strong arithmetic reasoning capabilities",
    "feed",
    "llms",
    "a unified explanation"
  ],
  "url": "https://aclanthology.org/2024.acl-long.387/",
  "provenance": {
    "collected_at": "2025-06-05 10:39:37",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}