{
  "id": "2024.findings-acl.182",
  "title": "Transition-based Opinion Generation for Aspect-based Sentiment Analysis",
  "authors": [
    "Ma, Tianlai  and\nWang, Zhongqing  and\nZhou, Guodong"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Recently, the use of pre-trained generation models for extracting sentiment elements has resulted in significant advancements in aspect-based sentiment analysis benchmarks. However, these approaches often overlook the importance of explicitly modeling structure among sentiment elements. To address this limitation, we present a study that aims to integrate general pre-trained sequence-to-sequence language models with a structure-aware transition-based approach. Therefore, we propose a transition system for opinion tree generation, designed to better exploit pre-trained language models for structured fine-tuning. Our proposed transition system ensures the structural integrity of the generated opinion tree. By leveraging pre-trained generation models and simplifying the transition set, we are able to maximize the accuracy of opinion tree generation. Extensive experiments show that our model significantly advances the state-of-the-art performance on several benchmark datasets. In addition, the empirical studies also indicate that the proposed opinion tree generation with transition system is more effective in capturing the sentiment structure than other generation models.",
  "keywords": [
    "the accuracy",
    "accuracy",
    "other generation models",
    "general",
    "generation",
    "language",
    "pre-trained language models",
    "pre-trained generation models",
    "model",
    "studies",
    "transition-based opinion generation",
    "the empirical studies",
    "fine",
    "we",
    "sequence"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.182/",
  "provenance": {
    "collected_at": "2025-06-05 10:51:05",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}