{
  "id": "2024.acl-long.51",
  "title": "F}ine{S}ur{E}: Fine-grained Summarization Evaluation using {LLM}s",
  "authors": [
    "Song, Hwanjun  and\nSu, Hang  and\nShalyminov, Igor  and\nCai, Jason  and\nMansour, Saab"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Automated evaluation is crucial for streamlining text summarization benchmarking and model development, given the costly and time-consuming nature of human evaluation. Traditional methods like ROUGE do not correlate well with human judgment, while recently proposed LLM-based metrics provide only summary-level assessment using Likert-scale scores. This limits deeper model analysis, e.g., we can only assign one hallucination score at the summary level, while at the sentence level, we can count sentences containing hallucinations. To remedy those limitations, we propose FineSurE, a fine-grained evaluator specifically tailored for the summarization task using large language models (LLMs). It also employs completeness and conciseness criteria, in addition to faithfulness, enabling multi-dimensional assessment. We compare various open-source and proprietary LLMs as backbones for FineSurE. In addition, we conduct extensive benchmarking of FineSurE against SOTA methods including NLI-, QA-, and LLM-based methods, showing improved performance especially on the completeness and conciseness dimensions. The code is available at https://github.com/DISL-Lab/FineSurE.",
  "keywords": [
    "code",
    "f",
    "summarization",
    "we",
    "llm",
    "it",
    "llm s automated evaluation",
    "analysis",
    "llms",
    "the summarization task",
    "s",
    "text",
    "ine",
    "metrics",
    "human evaluation traditional methods"
  ],
  "url": "https://aclanthology.org/2024.acl-long.51/",
  "provenance": {
    "collected_at": "2025-06-05 10:34:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}