{
  "id": "2024.findings-acl.228",
  "title": "Injecting Salesperson{'}s Dialogue Strategies in Large Language Models with Chain-of-Thought Reasoning",
  "authors": [
    "Chang, Wen  and\nChen, Yun-Nung"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Recent research in dialogue systems focuses on two main categories: task-oriented (TOD) and open-domain (chit-chat) dialogues. TOD systems help users complete specific tasks, while open-domain systems aim to create engaging conversations. However, user intents often emerge during interactions. A recent study introduced SalesBot, simulating dialogues that transition from chit-chat to task-oriented scenarios to train sales agents. Unfortunately, the initial data lacked smooth transitions and coherent long dialogues, resulting in unnatural interactions. This paper presents SalesBot 2.0, an improved dataset leveraging commonsense knowledge from large language models (LLMs) through strategic prompting. Additionally, we introduce SalesAgent, a novel model trained on salesperson interactions using chain-of-thought (CoT) reasoning. This model excels in transitioning topics, understanding user intents, and selecting appropriate strategies.Experiments with diverse user simulations validate our method’s effectiveness in controlling dialogue strategies in LLMs. SalesBot 2.0 enhances coherence and reduces aggression, improving model learning for sales-customer interactions.",
  "keywords": [
    "strategic prompting",
    "appropriate strategies experiments",
    "chain",
    "conversations",
    "we",
    "dialogue",
    "cot",
    "dialogue systems",
    "salesperson s dialogue strategies",
    "learning",
    "llms",
    "categories",
    "task-oriented scenarios",
    "dialogue strategies",
    "strategies"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.228/",
  "provenance": {
    "collected_at": "2025-06-05 10:51:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}