{
  "id": "2024.sighan-1.18",
  "title": "P}er{LTQA}: A Personal Long-Term Memory Dataset for Memory Classification, Retrieval, and Fusion in Question Answering",
  "authors": [
    "Du, Yiming  and\nWang, Hongru  and\nZhao, Zhengyi  and\nLiang, Bin  and\nWang, Baojun  and\nZhong, Wanjun  and\nWang, Zezhong  and\nWong, Kam-Fai"
  ],
  "year": "2024",
  "venue": "Proceedings of the 10th SIGHAN Workshop on Chinese Language Processing (SIGHAN-10)",
  "abstract": "In conversational AI, effectively employing long-term memory improves personalized and consistent response generation. Existing work only concentrated on a single type of long-term memory, such as preferences, dialogue history, or social relationships, overlooking their interaction in real-world contexts. To this end, inspired by the concept of semantic memory and episodic memory from cognitive psychology, we create a new and more comprehensive Chinese dataset, coined as PerLTQA, in which world knowledge, profiles, social relationships, events, and dialogues are considered to leverage the interaction between different types of long-term memory for question answering (QA) in conversation. Further, based on PerLTQA, we propose a novel framework for memory integration in QA, consisting of three subtasks:Memory Classification,Memory Retrieval, andMemory Fusion, which provides a comprehensive paradigm for memory modeling, enabling consistent and personalized memory utilization. This essentially allows the exploitation of more accurate memory information for better responses in QA. We evaluate this framework using five LLMs and three retrievers. Experimental results demonstrate the importance of personal long-term memory in the QA task",
  "keywords": [
    "end",
    "ltqa",
    "question",
    "semantic",
    "semantic memory",
    "we",
    "dialogue",
    "fusion",
    "classification",
    "memory classification retrieval",
    "retrieval",
    "information",
    "preferences dialogue history",
    "five llms",
    "llms"
  ],
  "url": "https://aclanthology.org/2024.sighan-1.18/",
  "provenance": {
    "collected_at": "2025-06-05 11:10:15",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}