{
  "id": "2024.acl-long.852",
  "title": "D}oc{M}ath-Eval: Evaluating Math Reasoning Capabilities of {LLM}s in Understanding Long and Specialized Documents",
  "authors": [
    "Zhao, Yilun  and\nLong, Yitao  and\nLiu, Hongjun  and\nKamoi, Ryo  and\nNan, Linyong  and\nChen, Lyuhao  and\nLiu, Yixin  and\nTang, Xiangru  and\nZhang, Rui  and\nCohan, Arman"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Recent LLMs have demonstrated remarkable performance in solving exam-like math word problems. However, the degree to which these numerical reasoning skills are effective in real-world scenarios, particularly in expert domains, is still largely unexplored. This paper introduces DocMath-Eval, a comprehensive benchmark specifically designed to evaluate the numerical reasoning capabilities of LLMs in the context of understanding and analyzing specialized documents containing both text and tables. We conduct an extensive evaluation of 48 LLMs with Chain-of-Thought and Program-of-Thought prompting methods, aiming to comprehensively assess the capabilities and limitations of existing LLMs in DocMath-Eval. We found that even the current best-performing system (i.e., GPT-4o) still significantly lags behind human experts in solving complex numerical reasoning problems grounded in long contexts. We believe that DocMath-Eval can serve as a valuable benchmark for evaluating LLMs' capabilities in solving challenging numerical reasoning problems within expert domains.",
  "keywords": [
    "chain",
    "llm s",
    "we",
    "current",
    "llm",
    "the numerical reasoning capabilities",
    "48 llms",
    "word",
    "the capabilities",
    "m",
    "llms",
    "i",
    "gpt-4o",
    "text",
    "an extensive evaluation"
  ],
  "url": "https://aclanthology.org/2024.acl-long.852/",
  "provenance": {
    "collected_at": "2025-06-05 10:46:01",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}