{
  "id": "2024.arabicnlp-1.36",
  "title": "F}ired{\\_}from{\\_}{NLP} at {A}ra{F}in{NLP} 2024: Dual-Phase-{BERT} - A Fine-Tuned Transformer-Based Model for Multi-Dialect Intent Detection in The Financial Domain for The {A}rabic Language",
  "authors": [
    "Chowdhury, Md. Sajid Alam  and\nChowdhury, Mostak Mahmud  and\nShanto, Anik Mahmud  and\nMurad, Hasan  and\nDas, Udoy"
  ],
  "year": "2024",
  "venue": "Proceedings of the Second Arabic Natural Language Processing Conference",
  "abstract": "In the financial industry, identifying user intent from text inputs is crucial for various tasks such as automated trading, sentiment analysis, and customer support. One important component of natural language processing (NLP) is intent detection, which is significant to the finance sector. Limited studies have been conducted in the field of finance using languages with limited resources like Arabic, despite notable works being done in high-resource languages like English. To advance Arabic NLP in the financial domain, the organizer of AraFinNLP 2024 has arranged a shared task for detecting banking intents from the queries in various Arabic dialects, introducing a novel dataset named ArBanking77 which includes a collection of banking queries categorized into 77 distinct intents classes. To accomplish this task, we have presented a hierarchical approach called Dual-Phase-BERT in which the detection of dialects is carried out first, followed by the detection of banking intents. Using the provided ArBanking77 dataset, we have trained and evaluated several conventional machine learning, and deep learning models along with some cutting-edge transformer-based models. Among these models, our proposed Dual-Phase-BERT model has ranked7thout of all competitors, scoring 0.801 on the scale of F1-score on the test set.",
  "keywords": [
    "automated trading sentiment analysis",
    "deep",
    "f",
    "our proposed dual-phase-bert model",
    "field",
    "dual-phase-bert",
    "arabic nlp",
    "we",
    "natural language processing nlp",
    "arafinnlp",
    "edge",
    "natural",
    "the field",
    "queries",
    "f1-score"
  ],
  "url": "https://aclanthology.org/2024.arabicnlp-1.36/",
  "provenance": {
    "collected_at": "2025-06-05 11:02:41",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}