{
  "id": "2024.findings-acl.155",
  "title": "DELL}: Generating Reactions and Explanations for {LLM}-Based Misinformation Detection",
  "authors": [
    "Wan, Herun  and\nFeng, Shangbin  and\nTan, Zhaoxuan  and\nWang, Heng  and\nTsvetkov, Yulia  and\nLuo, Minnan"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Large language models are limited by challenges in factuality and hallucinations to be directly employed off-the-shelf for judging the veracity of news articles, where factual accuracy is paramount. In this work, we propose DELL that identifies three key stages in misinformation detection where LLMs could be incorporated as part of the pipeline: 1) LLMs could generate news reactions to represent diverse perspectives and simulate user-news interaction networks; 2) LLMs could generate explanations for proxy tasks (e.g., sentiment, stance) to enrich the contexts of news articles and produce experts specializing in various aspects of news understanding; 3) LLMs could merge task-specific experts and provide an overall prediction by incorporating the predictions and confidence scores of varying experts. Extensive experiments on seven datasets with three LLMs demonstrate that DELL outperforms state-of-the-art baselines by up to 16.8% in macro f1-score. Further analysis reveals that the generated reactions and explanations are greatly helpful in misinformation detection, while our proposed LLM-guided expert merging helps produce better-calibrated predictions.",
  "keywords": [
    "3 llms",
    "three llms",
    "we",
    "macro f1-score further analysis",
    "the pipeline 1 llms",
    "llm",
    "analysis",
    "llms",
    "factual accuracy",
    "the generated reactions",
    "accuracy",
    "sentiment",
    "work",
    "dell generating reactions",
    "generating"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.155/",
  "provenance": {
    "collected_at": "2025-06-05 10:50:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}