{
  "id": "2024.wassa-1.10",
  "title": "Polarization of Autonomous Generative {AI} Agents Under Echo Chambers",
  "authors": [
    "Ohagi, Masaya"
  ],
  "year": "2024",
  "venue": "Proceedings of the 14th Workshop on Computational Approaches to Subjectivity, Sentiment, {\\&} Social Media Analysis",
  "abstract": "Online social networks often create echo chambers where people only hear opinions reinforcing their beliefs.An echo chamber often generates polarization, leading to conflicts between people with radical opinions.The echo chamber has been viewed as a human-specific problem, but this implicit assumption is becoming less reasonable as large language models, such as ChatGPT, acquire social abilities. In response to this situation, we investigated the potential for polarization to occur among a group of autonomous AI agents based on generative language models in an echo chamber environment. We had AI agents discuss specific topics and analyzed how the group’s opinions changed as the discussion progressed. As a result, we found that the group of agents based on ChatGPT tended to become polarized in echo chamber environments. The analysis of opinion transitions shows that this result is caused by ChatGPT’s high prompt understanding ability to update its opinion by considering its own and surrounding agents’ opinions. We conducted additional experiments to investigate under what specific conditions AI agents tended to polarize. As a result, we identified factors that influence polarization, such as the agent’s persona.",
  "keywords": [
    "generative",
    "abilities",
    "their beliefs",
    "language",
    "prompt",
    "human",
    "large language models",
    "generative language models",
    "social abilities",
    "chatgpt",
    "beliefs",
    "we",
    "analysis",
    "chamber",
    "situation"
  ],
  "url": "https://aclanthology.org/2024.wassa-1.10/",
  "provenance": {
    "collected_at": "2025-06-05 11:11:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}