{
  "id": "2024.nlrse-1.1",
  "title": "G}raph{R}eason: Enhancing Reasoning Capabilities of Large Language Models through A Graph-Based Verification Approach",
  "authors": [
    "Cao, Lang"
  ],
  "year": "2024",
  "venue": "Proceedings of the 2nd Workshop on Natural Language Reasoning and Structured Explanations (@ACL 2024)",
  "abstract": "Large Language Models (LLMs) have showcased impressive reasoning capabilities, particularly when guided by specifically designed prompts in complex reasoning tasks such as math word problems. These models typically solve tasks using a chain-of-thought approach, which not only bolsters their reasoning abilities but also provides valuable insights into their problem-solving process. However, there is still significant room for enhancing the reasoning abilities of LLMs. Some studies suggest that the integration of an LLM output verifier can boost reasoning accuracy without necessitating additional model training. In this paper, we follow these studies and introduce a novel graph-based method to further augment the reasoning capabilities of LLMs. We posit that multiple solutions to a reasoning task, generated by an LLM, can be represented as a reasoning graph due to the logical connections between intermediate steps from different reasoning paths. Therefore, we propose the Reasoning Graph Verifier (GraphReason) to analyze and verify the solutions generated by LLMs. By evaluating these graphs, models can yield more accurate and reliable results.Our experimental results show that our graph-based verification method not only significantly enhances the reasoning abilities of LLMs but also outperforms existing verifier methods in terms of improving these models’ reasoning performance.",
  "keywords": [
    "reasoning accuracy",
    "chain",
    "these studies",
    "verifier",
    "an llm",
    "we",
    "specifically designed prompts",
    "graph",
    "llm",
    "training",
    "some studies",
    "existing verifier methods",
    "impressive reasoning capabilities",
    "word",
    "an llm output verifier"
  ],
  "url": "https://aclanthology.org/2024.nlrse-1.1/",
  "provenance": {
    "collected_at": "2025-06-05 11:08:53",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}