{
  "id": "2024.acl-long.514",
  "title": "Fine-Grained Image-Text Alignment in Medical Imaging Enables Explainable Cyclic Image-Report Generation",
  "authors": [
    "Chen, Wenting  and\nShen, Linlin  and\nLin, Jingyang  and\nLuo, Jiebo  and\nLi, Xiang  and\nYuan, Yixuan"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Fine-grained vision-language models (VLM) have been widely used for inter-modality local alignment between the predefined fixed patches and textual words. However, in medical analysis, lesions exhibit varying sizes and positions, and using fixed patches may cause incomplete representations of lesions. Moreover, these methods provide explainability by using heatmaps to show the general image areas potentially associated with texts rather than specific regions, making their explanations not explicit and specific enough. To address these issues, we propose a novel Adaptive patch-word Matching (AdaMatch) model to correlate chest X-ray (CXR) image regions with words in medical reports and apply it to CXR-report generation to provide explainability for the generation process. AdaMatch exploits the fine-grained relation between adaptive patches and words to provide explanations of specific image regions with corresponding words. To capture the abnormal regions of varying sizes and positions, we introduce an Adaptive Patch extraction (AdaPatch) module to acquire adaptive patches for these regions adaptively. Aiming to provide explicit explainability for the CXR-report generation task, we propose an AdaMatch-based bidirectional LLM for Cyclic CXR-report generation (AdaMatch-Cyclic). It employs AdaMatch to obtain the keywords for CXR images and ‘keypatches’ for medical reports as hints to guide CXR-report generation. Extensive experiments on two publicly available CXR datasets validate the effectiveness of our method and its superior performance over existing methods. Source code will be released.",
  "keywords": [
    "code",
    "cxr-report generation",
    "extraction",
    "adamatch",
    "inter-modality local alignment",
    "we",
    "cyclic cxr-report generation adamatch-cyclic",
    "heatmaps",
    "llm",
    "it",
    "word",
    "fine-grained image-text alignment",
    "the cxr-report generation task",
    "analysis",
    "an adamatch-based bidirectional llm"
  ],
  "url": "https://aclanthology.org/2024.acl-long.514/",
  "provenance": {
    "collected_at": "2025-06-05 10:41:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}