{
  "id": "2024.acl-long.840",
  "title": "Dolma: an Open Corpus of Three Trillion Tokens for Language Model Pretraining Research",
  "authors": [
    "Soldaini, Luca  and\nKinney, Rodney  and\nBhagia, Akshita  and\nSchwenk, Dustin  and\nAtkinson, David  and\nAuthur, Russell  and\nBogin, Ben  and\nChandu, Khyathi  and\nDumas, Jennifer  and\nElazar, Yanai  and\nHofmann, Valentin  and\nJha, Ananya  and\nKumar, Sachin  and\nLucy, Li  and\nLyu, Xinxi  and\nLambert, Nathan  and\nMagnusson, Ian  and\nMorrison, Jacob  and\nMuennighoff, Niklas  and\nNaik, Aakanksha  and\nNam, Crystal  and\nPeters, Matthew  and\nRavichander, Abhilasha  and\nRichardson, Kyle  and\nShen, Zejiang  and\nStrubell, Emma  and\nSubramani, Nishant  and\nTafjord, Oyvind  and\nWalsh, Evan  and\nZettlemoyer, Luke  and\nSmith, Noah  and\nHajishirzi, Hannaneh  and\nBeltagy, Iz  and\nGroeneveld, Dirk  and\nDodge, Jesse  and\nLo, Kyle"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Information about pretraining corpora used to train the current best-performing language models is seldom discussed: commercial models rarely detail their data, and even open models are often released without accompanying training data or recipes to reproduce them. As a result, it is challenging to conduct and advance scientific research on language modeling, such as understanding how training data impacts model capabilities and limitations. To facilitate scientific research on language model pretraining, we curate and release Dolma, a three-trillion-token English corpus, built from a diverse mixture of web content, scientific papers, code, public-domain books, social media, and encyclopedic materials. We extensively document Dolma, including its design principles, details about its construction, and a summary of its contents. We present analyses and experimental results on intermediate states of Dolma to share what we have learned about important data curation practices. Finally, we open-source our data curation toolkit to enable reproduction of our work as well as support further research in large-scale data curation.",
  "keywords": [
    "support",
    "we",
    "current",
    "language modeling",
    "training",
    "it",
    "token",
    "scientific research",
    "information",
    "scientific",
    "model capabilities",
    "language model",
    "work",
    "language",
    "model"
  ],
  "url": "https://aclanthology.org/2024.acl-long.840/",
  "provenance": {
    "collected_at": "2025-06-05 10:45:52",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}