{
  "id": "2024.findings-acl.221",
  "title": "Adversarial Preference Optimization: Enhancing Your Alignment via {RM}-{LLM} Game",
  "authors": [
    "Cheng, Pengyu  and\nYang, Yifan  and\nLi, Jian  and\nDai, Yong  and\nHu, Tianhao  and\nCao, Peixin  and\nDu, Nan  and\nLi, Xiaolong"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Human preference alignment is essential to improve the interaction quality of large language models (LLMs). Existing alignment methods depend on manually annotated preference data to guide the LLM optimization directions. However, continuously updating LLMs for alignment raises a distribution gap between model-generated samples and human-annotated responses, hindering training effectiveness. To mitigate this issue, previous methods require additional preference annotation on newly generated samples to adapt to the shifted distribution, which consumes a large amount of annotation resources. Targeting more efficient human preference optimization, we propose an Adversarial Preference Optimization (APO) framework, in which the LLM and the reward model update alternatively via a min-max game. Through adversarial training, the reward model can adapt to the shifted generation distribution of the LLM without any additional annotation. With comprehensive experiments, we find the proposed adversarial training framework further enhances existing alignment baselines in terms of LLM helpfulness and harmlessness. The code is at https://github.com/Linear95/APO.",
  "keywords": [
    "code",
    "adversarial preference optimization",
    "existing alignment baselines",
    "efficient",
    "we",
    "newly generated samples",
    "the shifted generation distribution",
    "existing alignment methods",
    "llm",
    "training",
    "model-generated samples",
    "min",
    "max",
    "llms",
    "your alignment"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.221/",
  "provenance": {
    "collected_at": "2025-06-05 10:51:37",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}