{
  "id": "2024.findings-acl.406",
  "title": "Reasoning Like a Doctor: Improving Medical Dialogue Systems via Diagnostic Reasoning Process Alignment",
  "authors": [
    "Xu, Kaishuai  and\nCheng, Yi  and\nHou, Wenjun  and\nTan, Qiaoyu  and\nLi, Wenjie"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Medical dialogue systems have attracted significant attention for their potential to act as medical assistants. Enabling these medical systems to emulate clinicians’ diagnostic reasoning process has been the long-standing research focus. Previous studies rudimentarily realized the simulation of clinicians’ diagnostic process by fine-tuning language models on high-quality dialogue datasets. Nonetheless, they overly focus on the outcomes of the clinician’s reasoning process while ignoring their internal thought processes and alignment with clinician preferences. Our work aims to build a medical dialogue system that aligns with clinicians’ diagnostic reasoning processes. We propose a novel framework, Emulation, designed to generate an appropriate response that relies on abductive and deductive diagnostic reasoning analyses and aligns with clinician preferences through thought process modeling. Experimental results on two datasets confirm the efficacy of Emulation. Crucially, our framework furnishes clear explanations for the generated responses, enhancing its transparency in medical consultations.",
  "keywords": [
    "fine-tuning language models",
    "we",
    "dialogue",
    "the generated responses",
    "previous studies",
    "high-quality dialogue datasets",
    "work",
    "alignment",
    "a medical dialogue system",
    "process",
    "language",
    "thought",
    "studies",
    "significant attention",
    "medical dialogue systems"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.406/",
  "provenance": {
    "collected_at": "2025-06-05 10:54:09",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}