{
  "id": "2024.findings-acl.54",
  "title": "D}iffus{P}oll: Conditional Text Diffusion Model for Poll Generation",
  "authors": [
    "Cheng, Le  and\nLi, Shuangyin"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Online social media platforms often gather user feedback through polls to enhance user engagement. Automatically generating polls from social media and its context can decrease the labor expenses of media workers and enhance workplace productivity. However, on social media platforms, there are internet water armies that manipulate public opinion through sheer numbers and causing the comments to be biased, drowning out minority views. In such circumstances, polls created based on biased comments often have limited types of options and poor coverage. Therefore, it is crucial to diversify the poll options and try to listen to the voices of the minority. To achieve this, we introduce DiffusPoll, a novel paradigm for poll generation based on a non-autoregressive diffusion model that can generate diversified and high-quality samples. Under the new paradigm, we design a task-specific mask strategy tailored to the inherent logic of polls to optimize controlled generation. Furthermore, we also leverage additional attribute tags from comments to enhance the generation quality. Experimental results indicate that DiffusPoll has achieved state-of-the-art performance in both the quality and diversity of poll generation tasks, and is more likely to hit the voices of minority.",
  "keywords": [
    "armies",
    "diversified and high-quality samples",
    "feedback",
    "the generation",
    "we",
    "biased comments",
    "it",
    "automatically generating polls",
    "views",
    "poll generation",
    "poll generation tasks",
    "text",
    "internet water armies",
    "diversified",
    "generation"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.54/",
  "provenance": {
    "collected_at": "2025-06-05 10:49:20",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}