{
  "id": "2024.findings-acl.438",
  "title": "The Impact of Demonstrations on Multilingual In-Context Learning: A Multidimensional Analysis",
  "authors": [
    "Zhang, Miaoran  and\nGautam, Vagrant  and\nWang, Mingyang  and\nAlabi, Jesujoba  and\nShen, Xiaoyu  and\nKlakow, Dietrich  and\nMosbach, Marius"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "In-context learning is a popular inference strategy where large language models solve a task using only a few labeled demonstrations without needing any parameter updates. Although there have been extensive studies on English in-context learning, multilingual in-context learning remains under-explored, and we lack an in-depth understanding of the role of demonstrations in this context. To address this gap, we conduct a multidimensional analysis of multilingual in-context learning, experimenting with 5 models from different model families, 9 datasets covering classification and generation tasks, and 56 typologically diverse languages. Our results reveal that the effectiveness of demonstrations varies significantly across models, tasks, and languages. We also find that strong instruction-following models including Llama 2-Chat, GPT-3.5, and GPT-4 are largely insensitive to the quality of demonstrations. Instead, a carefully crafted template often eliminates the benefits of demonstrations for some tasks and languages altogether. These findings show that the importance of demonstrations might be overestimated. Our work highlights the need for granular evaluation across multiple axes towards a better understanding of in-context learning.",
  "keywords": [
    "families",
    "classification and generation tasks",
    "we",
    "parameter",
    "classification",
    "instruction",
    "gpt-3",
    "learning",
    "analysis",
    "granular evaluation",
    "gpt-4",
    "chat",
    "work",
    "2-chat gpt-3",
    "language"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.438/",
  "provenance": {
    "collected_at": "2025-06-05 10:54:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}