{
  "id": "2024.acl-long.539",
  "title": "MAPO}: Advancing Multilingual Reasoning through Multilingual-Alignment-as-Preference Optimization",
  "authors": [
    "She, Shuaijie  and\nZou, Wei  and\nHuang, Shujian  and\nZhu, Wenhao  and\nLiu, Xiang  and\nGeng, Xiang  and\nChen, Jiajun"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Intuitively, reasoning abilities are considered language-agnostic. However, existing LLMs exhibit inconsistent reasoning abilities across different languages, e.g., reasoning in the dominant language like English is superior to other languages due to the imbalance of multilingual training data. To enhance reasoning abilities in non-dominant languages, we propose a Multilingual-Alignment-as-Preference Optimization framework (MAPO) to align the reasoning processes in other languages with the dominant language. Specifically, we harness an off-the-shelf translation model for the consistency between answers in non-dominant and dominant languages, which we adopt as the preference for optimization, e.g., Direct Preference Optimization(DPO) or Proximal Policy Optimization (PPO). Experiments show that MAPO stably achieves significant improvements in the multilingual reasoning of various models on all three benchmarks (MSVAMP +16.2%, MGSM +6.1%, and MNumGLUESub +13.3%), with improved reasoning consistency across languages. The project is available at https://github.com/NJUNLP/MAPO.",
  "keywords": [
    "alignment",
    "abilities",
    "ppo",
    "reasoning abilities",
    "inconsistent reasoning abilities",
    "proximal policy optimization",
    "language",
    "model",
    "njunlp",
    "llms",
    "optimization",
    "we",
    "training",
    "language-agnostic however existing llms",
    "translation"
  ],
  "url": "https://aclanthology.org/2024.acl-long.539/",
  "provenance": {
    "collected_at": "2025-06-05 10:41:44",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}