{
  "id": "2024.sdp-1.3",
  "title": "Overview of the Context24 Shared Task on Contextualizing Scientific Claims",
  "authors": [
    "Chan, Chu Sern Joel  and\nNaik, Aakanksha  and\nAkamatsu, Matthew  and\nBekele, Hanna  and\nBransom, Erin  and\nCampbell, Ian  and\nSparks, Jenna"
  ],
  "year": "2024",
  "venue": "Proceedings of the Fourth Workshop on Scholarly Document Processing (SDP 2024)",
  "abstract": "To appropriately interpret and use scientific claims for sensemaking and decision-making, it is critical to contextualize them, not just with textual evidence that the claim was in fact asserted, but also with key supporting empirical evidence, such as a figure that describes a key result, and methodological details, such as the methods of data collection. Retrieving this contextual information when encountering claims in isolation, away from their source papers, is difficult and time-consuming for humans. Scholarly document processing models could help to contextualize scientific claims, but there is a lack of datasets designed for this task. Thus, we contribute a dataset of 585 scientific claims with gold annotations for supporting figures and tables, and gold text snippets of methodological details, that ground the key results behind each claim and run the Context24 shared task to encourage model development for this task. This report describes details of our dataset construction process, summarizes results from the shared task conducted at the 4th Workshop on Scholarly Document Processing (SDP), and discusses future research directions in this space. To support further research, we also publicly release the dataset on HuggingFace.",
  "keywords": [
    "overview",
    "we",
    "scientific claims",
    "it",
    "information",
    "scientific",
    "processing",
    "text",
    "process",
    "contextualizing scientific claims",
    "model",
    "585 scientific claims",
    "time",
    "our dataset construction process",
    "report"
  ],
  "url": "https://aclanthology.org/2024.sdp-1.3/",
  "provenance": {
    "collected_at": "2025-06-05 11:09:37",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}