{
  "id": "2024.teachingnlp-1.6",
  "title": "Collaborative Development of Modular Open Source Educational Resources for Natural Language Processing",
  "authors": [
    "A{\\ss}enmacher, Matthias  and\nStephan, Andreas  and\nWeissweiler, Leonie  and\n{\\c{C}}ano, Erion  and\nZiegler, Ingo  and\nH{\\\"a}rttrich, Marwin  and\nBischl, Bernd  and\nRoth, Benjamin  and\nHeumann, Christian  and\nSch{\\\"u}tze, Hinrich"
  ],
  "year": "2024",
  "venue": "Proceedings of the Sixth Workshop on Teaching NLP",
  "abstract": "In this work, we present a collaboratively and continuously developed open-source educational resource (OSER) for teaching natural language processing at two different universities. We shed light on the principles we followed for the initial design of the course and the rationale for ongoing developments, followed by a reflection on the inter-university collaboration for designing and maintaining teaching material. When reflecting on the latter, we explicitly emphasize the considerations that need to be made when facing heterogeneous groups and when having to accommodate multiple examination regulations within one single course framework. Relying on the fundamental principles of OSER developments as defined by Bothmann et al. (2023) proved to be an important guideline during this process. The final part pertains to open-sourcing our teaching material, coping with the increasing speed of developments in the field, and integrating the course digitally, also addressing conflicting priorities and challenges we are currently facing.",
  "keywords": [
    "work",
    "priorities",
    "process",
    "processing",
    "language",
    "al",
    "the field",
    "natural",
    "field",
    "two different universities",
    "we",
    "universities",
    "natural language processing",
    "conflicting priorities",
    "that"
  ],
  "url": "https://aclanthology.org/2024.teachingnlp-1.6/",
  "provenance": {
    "collected_at": "2025-06-05 11:11:09",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}