{
  "id": "2024.findings-acl.59",
  "title": "Better Late Than Never: Model-Agnostic Hallucination Post-Processing Framework Towards Clinical Text Summarization",
  "authors": [
    "Li, Songda  and\nZhang, Yunqi  and\nDeng, Chunyuan  and\nNiu, Yake  and\nZhao, Hui"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Clinical text summarization has proven successful in generating concise and coherent summaries. However, these summaries may include unintended text with hallucinations, which can mislead clinicians and patients. Existing methods for mitigating hallucinations can be categorized into task-specific and task-agnostic approaches. Task-specific methods lack versatility for real-world applicability. Meanwhile, task-agnostic methods are not model-agnostic, so they require retraining for different models, resulting in considerable computational costs. To address these challenges, we propose MEDAL, a model-agnostic framework designed to post-process medical hallucinations. MEDAL can seamlessly integrate with any medical summarization model, requiring no additional computational overhead. MEDAL comprises a medical infilling model and a hallucination correction model. The infilling model generates non-factual summaries with common errors to train the correction model. The correction model is incorporated with a self-examination mechanism to activate its cognitive capability. We conduct comprehensive experiments using 11 widely accepted metrics on 7 baseline models across 3 medical text summarization tasks. MEDAL demonstrates superior performance in correcting hallucinations when applied to summaries generated by pre-trained language models and large language models.",
  "keywords": [
    "any medical summarization model",
    "summarization",
    "we",
    "pre-trained language models",
    "patients",
    "self",
    "concise and coherent summaries",
    "these summaries",
    "processing",
    "non-factual summaries",
    "text",
    "metrics",
    "11 widely accepted metrics",
    "process",
    "summaries"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.59/",
  "provenance": {
    "collected_at": "2025-06-05 10:49:24",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}