{
  "id": "2024.acl-long.565",
  "title": "Characterizing Similarities and Divergences in Conversational Tones in Humans and {LLM}s by Sampling with People",
  "authors": [
    "Huang, Dun-Ming  and\nVan Rijn, Pol  and\nSucholutsky, Ilia  and\nMarjieh, Raja  and\nJacoby, Nori"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Conversational tones — the manners and attitudes in which speakers communicate — are essential to effective communication. As Large Language Models (LLMs) become increasingly popular, it is necessary to characterize the divergences in their conversational tones relative to humans. Prior research relied on pre-existing taxonomies or text corpora, which suffer from experimenter bias and may not be representative of real-world distributions. Inspired by methods from cognitive science, we propose an iterative method for simultaneously eliciting conversational tones and sentences, where participants alternate between two tasks: (1) one participant identifies the tone of a given sentence and (2) a different participant generates a sentence based on that tone. We run 50 iterations of this process with both human participants and GPT-4 and obtain a dataset of sentences and frequent conversational tones. In an additional experiment, humans and GPT-4 annotated all sentences with all tones. With data from 1,339 participants, 33,370 human judgments, and 29,900 GPT-4 queries, we show how our approach can be used to create an interpretable geometric representation of relations between tones in humans and GPT-4. This work showcases how combining ideas from machine learning and cognitive science can address challenges in human-computer interactions.",
  "keywords": [
    "bias",
    "their conversational tones",
    "we",
    "llm",
    "pre-existing taxonomies",
    "it",
    "science",
    "machine learning",
    "learning",
    "conversational tones",
    "llms",
    "text",
    "taxonomies",
    "gpt-4",
    "people conversational tones"
  ],
  "url": "https://aclanthology.org/2024.acl-long.565/",
  "provenance": {
    "collected_at": "2025-06-05 10:42:06",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}