{
  "id": "2024.findings-acl.570",
  "title": "R}e{PALM}: Popular Quote Tweet Generation via Auto-Response Augmentation",
  "authors": [
    "Yu, Erxin  and\nLi, Jing  and\nXu, Chunpu"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "A quote tweet enables users to share others’ content while adding their own commentary. In order to enhance public engagement through quote tweets, we investigate the task of generating popular quote tweets. This task aims to produce quote tweets that garner higher popularity, as indicated by increased likes, replies, and retweets. Despite the impressive language generation capabilities of large language models (LLMs), there has been limited research on how LLMs can effectively learn the popularity of text to better engage the public. Therefore, we introduce a novel approach called Response-augmented Popularity-Aligned Language Model (RePALM), which aligns language generation with popularity by leveraging insights from augmented auto-responses provided by readers. We utilize the Proximal Policy Optimization framework with a dual-reward mechanism to jointly optimize for the popularity of the quote tweet and its consistency with the auto-responses. In our experiments, we collected two datasets consisting of quote tweets containing external links and those referencing others’ tweets. Extensive results demonstrate the superiority of RePALM over advanced language models that do not incorporate response augmentation.",
  "keywords": [
    "we",
    "language generation",
    "replies",
    "increased likes replies",
    "llms",
    "text",
    "large language models llms",
    "generation",
    "language",
    "model",
    "advanced language models",
    "capabilities",
    "optimization",
    "limited research",
    "approach"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.570/",
  "provenance": {
    "collected_at": "2025-06-05 10:56:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}