{
  "id": "2024.findings-acl.664",
  "title": "S}table{T}ool{B}ench: Towards Stable Large-Scale Benchmarking on Tool Learning of Large Language Models",
  "authors": [
    "Guo, Zhicheng  and\nCheng, Sijie  and\nWang, Hao  and\nLiang, Shihao  and\nQin, Yujia  and\nLi, Peng  and\nLiu, Zhiyuan  and\nSun, Maosong  and\nLiu, Yang"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Large Language Models (LLMs) have witnessed remarkable advancements in recent years, prompting the exploration of tool learning, which integrates LLMs with external tools to address diverse real-world challenges. Assessing the capability of LLMs to utilise tools necessitates large-scale and stable benchmarks. However, previous works relied on either hand-crafted online tools with limited scale, or large-scale real online APIs suffering from instability of API status. To address this problem, we introduce StableToolBench, a benchmark evolving from ToolBench, proposing a virtual API server and stable evaluation system. The virtual API server contains a caching system and API simulators which are complementary to alleviate the change in API status. Meanwhile, the stable evaluation system designs solvable pass and win rates using GPT-4 as the automatic evaluator to eliminate the randomness during evaluation. Experimental results demonstrate the stability of StableToolBench, and further discuss the effectiveness of API simulators, the caching system, and the evaluator system.",
  "keywords": [
    "evaluation experimental results",
    "we",
    "learning",
    "stable evaluation system",
    "llms",
    "large language models llms",
    "gpt-4",
    "the stable evaluation system",
    "language",
    "large language models",
    "evaluation",
    "s table t",
    "the change",
    "randomness",
    "stable large-scale benchmarking"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.664/",
  "provenance": {
    "collected_at": "2025-06-05 10:57:40",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}