{
  "id": "2024.findings-acl.948",
  "title": "Defending {LLM}s against Jailbreaking Attacks via Backtranslation",
  "authors": [
    "Wang, Yihan  and\nShi, Zhouxing  and\nBai, Andrew  and\nHsieh, Cho-Jui"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Although many large language models (LLMs) have been trained to refuse harmful requests, they are still vulnerable to jailbreaking attacks which rewrite the original prompt to conceal its harmful intent. In this paper, we propose a new method for defending LLMs against jailbreaking attacks by “backtranslation”. Specifically, given an initial response generated by the target LLM from an input prompt, our backtranslation prompts a language model to infer an input prompt that can lead to the response. The inferred prompt is called the backtranslated prompt which tends to reveal the actual intent of the original prompt, since it is generated based on the LLM’s response and not directly manipulated by the attacker. We then run the target LLM again on the backtranslated prompt, and we refuse the original prompt if the model refuses the backtranslated prompt. We explain that the proposed defense provides several benefits on its effectiveness and efficiency. We empirically demonstrate that our defense significantly outperforms the baselines, in the cases that are hard for the baselines, and our defense also has little impact on the generation quality for benign input prompts. Our implementation is based on our library for LLM jailbreaking defense algorithms athttps://github.com/YihanWang617/llm-jailbreaking-defense, and the code for reproducing our experiments is available athttps://github.com/YihanWang617/LLM-Jailbreaking-Defense-Backtranslation.",
  "keywords": [
    "code",
    "our backtranslation",
    "efficiency",
    "we",
    "llm",
    "the llm s response",
    "the inferred prompt",
    "llm-jailbreaking-defense-backtranslation",
    "backtranslation",
    "it",
    "an input prompt",
    "yihanwang617 llm-jailbreaking-defense",
    "the original prompt",
    "vulnerable",
    "a language model"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.948/",
  "provenance": {
    "collected_at": "2025-06-05 11:01:32",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}