{
  "id": "2024.c3nlp-1.4",
  "title": "CRAFT}: Extracting and Tuning Cultural Instructions from the Wild",
  "authors": [
    "Wang, Bin  and\nLin, Geyu  and\nLiu, Zhengyuan  and\nWei, Chengwei  and\nChen, Nancy"
  ],
  "year": "2024",
  "venue": "Proceedings of the 2nd Workshop on Cross-Cultural Considerations in NLP",
  "abstract": "Large language models (LLMs) have rapidly evolved as the foundation of various natural language processing (NLP) applications. Despite their wide use cases, their understanding of culturally-related concepts and reasoning remains limited. Meantime, there is a significant need to enhance these models’ cultural reasoning capabilities, especially concerning underrepresented regions. This paper introduces a novel pipeline for extracting high-quality, culturally-related instruction tuning datasets from vast unstructured corpora. We utilize a self-instruction generation pipeline to identify cultural concepts and trigger instruction. By integrating with a general-purpose instruction tuning dataset, our model demonstrates enhanced capabilities in recognizing and understanding regional cultural nuances, thereby enhancing its reasoning capabilities. We conduct experiments across three regions: Singapore, the Philippines, and the United States, achieving performance improvement of up to 6%. Our research opens new avenues for extracting cultural instruction tuning sets directly from unstructured data, setting a precedent for future innovations in the field.",
  "keywords": [
    "field",
    "we",
    "cultural reasoning capabilities",
    "instruction",
    "natural",
    "the field",
    "self",
    "llms",
    "tuning",
    "processing",
    "a self-instruction generation pipeline",
    "its reasoning capabilities",
    "cultural instruction tuning sets",
    "general",
    "language"
  ],
  "url": "https://aclanthology.org/2024.c3nlp-1.4/",
  "provenance": {
    "collected_at": "2025-06-05 11:05:03",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}