{
  "id": "2024.acl-short.46",
  "title": "I}ndic{IRS}uite: Multilingual Dataset and Neural Information Models for {I}ndian Languages",
  "authors": [
    "Haq, Saiful  and\nSharma, Ashutosh  and\nKhattab, Omar  and\nChhaya, Niyati  and\nBhattacharyya, Pushpak"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers)",
  "abstract": "In this paper, we introduce Neural Information Retrieval resources for 11 widely spoken Indian Languages (Assamese, Bengali, Gujarati, Hindi, Kannada, Malayalam, Marathi, Oriya, Punjabi, Tamil, and Telugu) from two major Indian language families (Indo-Aryan and Dravidian). These resources include (a) INDIC-MARCO, a multilingual version of the MS MARCO dataset in 11 Indian Languages created using Machine Translation, and (b) Indic-ColBERT, a collection of 11 distinct Monolingual Neural Information Retrieval models, each trained on one of the 11 languages in the INDIC-MARCO dataset. To the best of our knowledge, IndicIRSuite is the first attempt at building large-scale Neural Information Retrieval resources for a large number of Indian languages, and we hope that it will help accelerate research in Neural IR for Indian Languages. Experiments demonstrate that Indic-ColBERT achieves 47.47% improvement in the MRR@10 score averaged over the INDIC-MARCO baselines for all 11 Indian languages except Oriya, 12.26% improvement in the NDCG@10 score averaged over the MIRACL Bengali and Hindi Language baselines, and 20% improvement in the MRR@100 Score over the Mr. Tydi Bengali Language baseline.",
  "keywords": [
    "neural information retrieval resources",
    "families",
    "machine translation",
    "we",
    "colbert",
    "translation",
    "neural",
    "it",
    "retrieval",
    "information",
    "i",
    "knowledge",
    "language",
    "machine",
    "indic-colbert"
  ],
  "url": "https://aclanthology.org/2024.acl-short.46/",
  "provenance": {
    "collected_at": "2025-06-05 10:46:50",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}