{
  "id": "2024.acl-long.88",
  "title": "IBSEN}: Director-Actor Agent Collaboration for Controllable and Interactive Drama Script Generation",
  "authors": [
    "Han, Senyu  and\nChen, Lu  and\nLin, Li-Min  and\nXu, Zhengshan  and\nYu, Kai"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Large language models have demonstrated their capabilities in storyline creation and human-like character role-playing. Current language model agents mainly focus on reasonable behaviors from the level of individuals, and their behaviors might be hard to constraint on the level of the whole storyline. In this paper we introduce IBSEN, a director-actor coordinate agent framework that generates drama scripts and makes the plot played by agents more controllable. The director agent writes plot outlines that the user desires to see, instructs the actor agents to role-play their characters, and reschedules the plot when human players participate in the scenario to ensure the plot is progressing towards the objective. To evaluate the framework, we create a novel drama plot that involves several actor agents and check the interactions between them under the instruction of the director agent. Evaluation results show that our framework could generate complete, diverse drama scripts from only a rough outline of plot objectives, meanwhile maintaining the characteristics of characters in the drama. Our codes and prompts are available at https://github.com/OpenDFM/ibsen.",
  "keywords": [
    "objectives",
    "plot objectives",
    "we",
    "current",
    "instruction",
    "the objective",
    "objective",
    "their capabilities",
    "prompts",
    "generation",
    "language",
    "model",
    "human",
    "capabilities",
    "evaluation"
  ],
  "url": "https://aclanthology.org/2024.acl-long.88/",
  "provenance": {
    "collected_at": "2025-06-05 10:35:29",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}