{
  "id": "2024.loresmt-1.16",
  "title": "Adopting Ensemble Learning for Cross-lingual Classification of Crisis-related Text On Social Media",
  "authors": [
    "Al Amer, Shareefa  and\nLee, Mark  and\nSmith, Phillip"
  ],
  "year": "2024",
  "venue": "Proceedings of the Seventh Workshop on Technologies for Machine Translation of Low-Resource Languages (LoResMT 2024)",
  "abstract": "Cross-lingual classification poses a significant challenge in Natural Language Processing (NLP), especially when dealing with languages with scarce training data. This paper delves into the adaptation of ensemble learning to address this challenge, specifically for disaster-related social media texts. Initially, we employ Machine Translation to generate a parallel corpus in the target language to mitigate the issue of data scarcity and foster a robust training environment. Following this, we implement the bagging ensemble technique, integrating multiple classifiers into a cohesive model that demonstrates enhanced performance over individual classifiers. Our experimental results reveal significant improvements in adapting models for Arabic, utilising only English training data and markedly outperforming models intended for linguistically similar languages to English, with our ensemble model achieving an accuracy and F1 score of 0.78 when tested on original Arabic data. This research makes a substantial contribution to the field of cross-lingual classification, establishing a new benchmark for enhancing the effectiveness of language transfer in linguistically challenging scenarios.",
  "keywords": [
    "classifiers",
    "field",
    "machine translation",
    "we",
    "ensemble learning",
    "training",
    "translation",
    "classification",
    "natural language processing nlp",
    "ensemble",
    "cross",
    "social media cross-lingual classification",
    "natural",
    "the field",
    "bagging"
  ],
  "url": "https://aclanthology.org/2024.loresmt-1.16/",
  "provenance": {
    "collected_at": "2025-06-05 11:08:17",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}