{
  "id": "2024.acl-long.225",
  "title": "NPH}ard{E}val: Dynamic Benchmark on Reasoning Ability of Large Language Models via Complexity Classes",
  "authors": [
    "Fan, Lizhou  and\nHua, Wenyue  and\nLi, Lingyao  and\nLing, Haoyang  and\nZhang, Yongfeng"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Complex reasoning ability is one of the most important features of Large Language Models (LLMs). Numerous benchmarks have been established to assess the reasoning abilities of LLMs. However, they are inadequate in offering a rigorous evaluation and prone to the risk of overfitting, as these publicly accessible and static benchmarks allow models to potentially tailor their responses to specific benchmark metrics, thereby inflating their performance. Addressing these limitations, we introduce a new benchmark NPHardEval. It contains a broad spectrum of 900 algorithmic questions belonging up to the NP-Hard complexity class, offering a rigorous measure of the reasoning ability of LLMs utilizing computational complexity. Moreover, this benchmark is designed with a dynamic update mechanism, where the datapoints are refreshed on a monthly basis. Such regular updates play a crucial role in mitigating the risk of LLMs overfitting to the benchmark, promoting a more accurate and reliable assessment of their reasoning capabilities. The benchmark dataset and code of NPHardEval are available at https://github.com/casmlab/NPHardEval.",
  "keywords": [
    "a rigorous evaluation",
    "code",
    "we",
    "val",
    "their reasoning capabilities",
    "it",
    "specific benchmark metrics",
    "llms",
    "abilities",
    "metrics",
    "language",
    "class",
    "large language models",
    "regular",
    "the reasoning abilities"
  ],
  "url": "https://aclanthology.org/2024.acl-long.225/",
  "provenance": {
    "collected_at": "2025-06-05 10:37:22",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}