{
  "id": "2024.wassa-1.37",
  "title": "Daisy at {WASSA} 2024 Empathy and Personality Shared Task: A Quick Exploration on Emotional Pattern of Empathy and Distress",
  "authors": [
    "Chevi, Rendi  and\nAji, Alham"
  ],
  "year": "2024",
  "venue": "Proceedings of the 14th Workshop on Computational Approaches to Subjectivity, Sentiment, {\\&} Social Media Analysis",
  "abstract": "When we encountered upsetting or tragic situations involving other people, we might feel certain emotions that are congruent, though not necessarily identical, to what that person might went through. These kind of vicarious emotions are what defined empathy and distress, they can be seen as a form of emotional response to other people in need. In this paper, we describe our participation in WASSA 2024 Shared Task 3 in predicting writer’s level of empathy and distress from their personal essays. We approach this task by assuming one’s level of empathy and distress can be revealed from the emotional patterns within their essay. By extracting the emotional patterns from essays via an emotion classifier, we regress the empathy and distress levels from these patterns. Through correlation and model explainability analysis, we found that there are similar set of emotions, such as sadness or disappointment, and distinct set of emotions, such as anger or approval, that might describe the writer’s level of empathy and distress. We hope that our approach and findings could serve as a basis for future work that try to model and explain empathy and distress from emotional patterns.",
  "keywords": [
    "classifier",
    "form",
    "we",
    "analysis",
    "congruent",
    "an emotion classifier",
    "work",
    "approach",
    "pattern",
    "distress",
    "distinct set",
    "similar",
    "wassa 2024 empathy",
    "that person",
    "correlation"
  ],
  "url": "https://aclanthology.org/2024.wassa-1.37/",
  "provenance": {
    "collected_at": "2025-06-05 11:12:04",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}