{
  "id": "2024.sigturk-1.9",
  "title": "Intelligent Tutor to Support Teaching and Learning of {T}atar",
  "authors": [
    "Zakirova, Alsu  and\nHou, Jue  and\nKatinskaia, Anisia  and\nVu, Anh-Duc  and\nYangarber, Roman"
  ],
  "year": "2024",
  "venue": "Proceedings of the First Workshop on Natural Language Processing for Turkic Languages (SIGTURK 2024)",
  "abstract": "This paper presents our work on tools to support the Tatar language, using Revita, a web-based Intelligent Tutoring System for language teaching and learning. The system allows the users — teachers and learners — to upload arbitrary authentic texts, and automatically creates exercises based on these texts that engage the learners in active production of language. It provides graduated feedback when they make mistakes, and performs continuous assessment, based on which the system selects exercises for the learners at the appropriate level. The assessment also helps the students maintain their learning pace, and helps the teachers to monitor their progress.The paper describes the functionality currently implemented for Tatar, which enables learners — who possess basic proficiency beyond the beginner level — to improve their competency, using texts of their choice as learning content. Support for Tatar is being developed to increase public interest in learning the language of this important regional minority, as well as to to provide tools for improving fluency to “heritage speakers” — those who have substantial passive competency, but lack active fluency and need support for regular practice.",
  "keywords": [
    "support",
    "feedback",
    "basic proficiency",
    "it",
    "learning",
    "beginner",
    "work",
    "proficiency",
    "language",
    "learners",
    "regular",
    "the beginner level",
    "the learners",
    "assessment",
    "tutoring"
  ],
  "url": "https://aclanthology.org/2024.sigturk-1.9/",
  "provenance": {
    "collected_at": "2025-06-05 11:10:25",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}