{
  "id": "2024.findings-acl.720",
  "title": "E}mo{T}rans{KG}: An Innovative Emotion Knowledge Graph to Reveal Emotion Transformation",
  "authors": [
    "Zhao, Huan  and\nZha, Xupeng  and\nZhang, Zixing"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "This paper introduces EmoTransKG, an innovative Emotion Knowledge Graph (EKG) that establishes connections and transformations between emotions across diverse open-textual events. Compared to existing EKGs, which primarily focus on linking emotion keywords to related terms or on assigning sentiment dimension ratings to emotion words by humans, EmoTransKG aims to represent the general knowledge involved in emotion transformation. Specifically, in conversations, successive emotions expressed by a single speaker are temporally considered as the head and tail entities, with open-text utterances (events) occurring between them representing the relation. To explore the knowledge of emotion transformations described in EmoTransKG, we develop a Transformer-based translational model called EmoTransNet, which predictively trains tail entities by interpreting the relation as an operation that transforms the source emotion into the target emotion. Particularly, our designed EmoTransNet serves as a plug-in module that seamlessly integrates with any conversational emotion recognition (CER) models for emotion retrofitting. Experimental results on two CER datasets demonstrate that the incorporation of EmoTransNet with baseline models results in substantial improvements, and the qualitative visualization of entities and relations clearly clarify their unique roles in emotion transformations. These experiments confirm the quality and effectiveness of EmoTransKG.",
  "keywords": [
    "tail entities",
    "conversations",
    "a transformer-based translational model",
    "we",
    "graph",
    "translational",
    "ekg",
    "existing ekgs",
    "text",
    "ekgs",
    "the qualitative visualization",
    "visualization",
    "sentiment",
    "transformer",
    "general"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.720/",
  "provenance": {
    "collected_at": "2025-06-05 10:58:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}