{
  "id": "2024.findings-acl.65",
  "title": "Pearl: A Review-driven Persona-Knowledge Grounded Conversational Recommendation Dataset",
  "authors": [
    "Kim, Minjin  and\nKim, Minju  and\nKim, Hana  and\nKwak, Beong-woo  and\nKang, SeongKu  and\nYu, Youngjae  and\nYeo, Jinyoung  and\nLee, Dongha"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Conversational recommender systems are an emerging area that has garnered increasing interest in the community, especially with the advancements in large language models (LLMs) that enable sophisticated handling of conversational input. Despite the progress, the field still has many aspects left to explore. The currently available public datasets for conversational recommendation lack specific user preferences and explanations for recommendations, hindering high-quality recommendations. To address such challenges, we present a novel conversational recommendation dataset named PEARL, synthesized with persona- and knowledge-augmented LLM simulators. We obtain detailed persona and knowledge from real-world reviews and construct a large-scale dataset with over 57k dialogues. Our experimental results demonstrate that PEARL contains more specific user preferences, show expertise in the target domain, and provides recommendations more relevant to the dialogue context than those in prior datasets. Furthermore, we demonstrate the utility of PEARL by showing that our downstream models outperform baselines in both human and automatic evaluations. We release our dataset and code.",
  "keywords": [
    "code",
    "the dialogue context",
    "field",
    "we",
    "dialogue",
    "llm",
    "conversational input",
    "the field",
    "reviews",
    "llms",
    "real-world reviews",
    "large language models llms",
    "knowledge",
    "language",
    "human"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.65/",
  "provenance": {
    "collected_at": "2025-06-05 10:49:29",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}