{
  "id": "2024.c3nlp-1.3",
  "title": "Synchronizing Approach in Designing Annotation Guidelines for Multilingual Datasets: A {COVID}-19 Case Study Using {E}nglish and {J}apanese Tweets",
  "authors": [
    "Ferawati, Kiki  and\nShe, Wan Jou  and\nWakamiya, Shoko  and\nAramaki, Eiji"
  ],
  "year": "2024",
  "venue": "Proceedings of the 2nd Workshop on Cross-Cultural Considerations in NLP",
  "abstract": "The difference in culture between the U.S. and Japan is a popular subject for Western vs. Eastern cultural comparison for researchers. One particular challenge is to obtain and annotate multilingual datasets. In this study, we utilized COVID-19 tweets from the two countries as a case study, focusing particularly on discussions concerning masks. The annotation task was designed to gain insights into societal attitudes toward the mask policies implemented in both countries. The aim of this study is to provide a practical approach for the annotation task by thoroughly documenting how we aligned the multilingual annotation guidelines to obtain a comparable dataset. We proceeded to document the effective practices during our annotation process to synchronize our multilingual guidelines. Furthermore, we discussed difficulties caused by differences in expression style and culture, and potential strategies that helped improve our agreement scores and reduce discrepancies between the annotation results in both languages. These findings offer an alternative method for synchronizing multilingual annotation guidelines and achieving feasible agreement scores for cross-cultural annotation tasks. This study resulted in a multilingual guideline in English and Japanese to annotate topics related to public discourses about COVID-19 masks in the U.S. and Japan.",
  "keywords": [
    "j",
    "we",
    "cross",
    "policies",
    "both countries",
    "the two countries",
    "potential strategies",
    "discrepancies",
    "societal attitudes",
    "difficulties",
    "strategies",
    "the mask policies",
    "countries",
    "process",
    "societal"
  ],
  "url": "https://aclanthology.org/2024.c3nlp-1.3/",
  "provenance": {
    "collected_at": "2025-06-05 11:05:02",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}