{
  "id": "2024.climatenlp-1.3",
  "title": "My Climate Advisor: An Application of {NLP} in Climate Adaptation for Agriculture",
  "authors": [
    "Nguyen, Vincent  and\nKarimi, Sarvnaz  and\nHallgren, Willow  and\nHarkin, Ashley  and\nPrakash, Mahesh"
  ],
  "year": "2024",
  "venue": "Proceedings of the 1st Workshop on Natural Language Processing Meets Climate Change (ClimateNLP 2024)",
  "abstract": "Climate adaptation in the agricultural sector necessitates tools that equip farmers and farm advisors with relevant and trustworthy information to help increase their resiliency to climate change. We introduceMy Climate Advisor, a question-answering (QA) prototype that synthesises information from different data sources, such as peer-reviewed scientific literature and high-quality, industry-relevant grey literature to generate answers, with references, to a given user’s question. Our prototype uses open-source generative models for data privacy and intellectual property protection, and retrieval augmented generation for answer generation, grounding and provenance. While there are standard evaluation metrics for QA systems, no existing evaluation framework suits our LLM-based QA application in the climate adaptation domain. We design an evaluation framework with seven metrics based on the requirements of the domain experts to judge the generated answers from 12 different LLM-based models. Our initial evaluations through a user study via domain experts show promising usability results.",
  "keywords": [
    "open-source generative models",
    "no existing evaluation framework",
    "peer-reviewed scientific literature",
    "standard evaluation metrics",
    "question",
    "12 different llm-based models",
    "the generated answers",
    "we",
    "llm",
    "seven metrics",
    "answer",
    "resiliency",
    "retrieval",
    "information",
    "a question-answering qa prototype"
  ],
  "url": "https://aclanthology.org/2024.climatenlp-1.3/",
  "provenance": {
    "collected_at": "2025-06-05 11:05:11",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}