{
  "id": "2024.acl-long.446",
  "title": "M}$^3${C}o{T}: A Novel Benchmark for Multi-Domain Multi-step Multi-modal Chain-of-Thought",
  "authors": [
    "Chen, Qiguang  and\nQin, Libo  and\nZhang, Jin  and\nChen, Zhi  and\nXu, Xiao  and\nChe, Wanxiang"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Multi-modal Chain-of-Thought (MCoT) requires models to leverage knowledge from both textual and visual modalities for step-by-step reasoning, which gains increasing attention. Nevertheless, the current MCoT benchmark still faces some challenges: (1) absence of visual modal reasoning, (2) single-step visual modal reasoning, and (3) domain missing, thereby hindering the development of MCoT. Motivated by this, we introduce a novel benchmark (M3CoT) to address the above challenges, advancing the multi-domain, multi-step, and multi-modal CoT. Additionally, we conduct a thorough evaluation involving abundant MCoT approaches on Vision Large Language Models (VLLMs). In addition, we highlight that the current VLLMs still struggle to correctly reason in M3CoT and there is a large gap between VLLMs and human performance in M3CoT, despite their superior results on previous MCoT benchmarks. To our knowledge, we take the first meaningful step toward the multi-domain, multi-step, and multi-modal scenario in MCoT. We hope that M3CoT will serve as a valuable resource, providing a pioneering foundation in multi-domain, multi-step, multi-modal chain-of-thought research.",
  "keywords": [
    "human",
    "knowledge",
    "language",
    "thought",
    "step and multi-modal cot",
    "cot",
    "the current mcot benchmark",
    "chain",
    "abundant mcot approaches",
    "mcot",
    "vllms",
    "modalities",
    "-",
    "a thorough evaluation",
    "previous mcot benchmarks"
  ],
  "url": "https://aclanthology.org/2024.acl-long.446/",
  "provenance": {
    "collected_at": "2025-06-05 10:40:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}