{
  "id": "2024.textgraphs-1.7",
  "title": "Leveraging Graph Structures to Detect Hallucinations in Large Language Models",
  "authors": [
    "Nonkes, Noa  and\nAgaronian, Sergei  and\nKanoulas, Evangelos  and\nPetcu, Roxana"
  ],
  "year": "2024",
  "venue": "Proceedings of TextGraphs-17: Graph-based Methods for Natural Language Processing",
  "abstract": "Large language models are extensively applied across a wide range of tasks, such as customer support, content creation, educational tutoring, and providing financial guidance. However, a well-known drawback is their predisposition to generate hallucinations. This damages the trustworthiness of the information these models provide, impacting decision-making and user confidence. We propose a method to detect hallucinations by looking at the structure of the latent space and finding associations within hallucinated and non-hallucinated generations. We create a graph structure that connects generations that lie closely in the embedding space. Moreover, we employ a Graph Attention Network which utilizes message passing to aggregate information from neighboring nodes and assigns varying degrees of importance to each neighbor based on their relevance. Our findings show that 1) there exists a structure in the latent space that differentiates between hallucinated and non-hallucinated generations, 2) Graph Attention Networks can learn this structure and generalize it to unseen generations, and 3) the robustness of our method is enhanced when incorporating contrastive learning. When evaluated against evidence-based benchmarks, our model performs similarly without access to search-based methods.",
  "keywords": [
    "support",
    "we",
    "graph",
    "unseen generations",
    "it",
    "information",
    "latent",
    "learning",
    "hallucinated and non-hallucinated generations",
    "generations",
    "a graph attention network",
    "language",
    "the embedding space",
    "model",
    "large language models"
  ],
  "url": "https://aclanthology.org/2024.textgraphs-1.7/",
  "provenance": {
    "collected_at": "2025-06-05 11:11:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}