{
  "id": "2024.findings-acl.624",
  "title": "I}njec{A}gent: Benchmarking Indirect Prompt Injections in Tool-Integrated Large Language Model Agents",
  "authors": [
    "Zhan, Qiusi  and\nLiang, Zhixiang  and\nYing, Zifan  and\nKang, Daniel"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Recent work has embodied LLMs as agents, allowing them to access tools, perform actions, and interact with external content (e.g., emails or websites). However, external content introduces the risk of indirect prompt injection (IPI) attacks, where malicious instructions are embedded within the content processed by LLMs, aiming to manipulate these agents into executing detrimental actions against users. Given the potentially severe consequences of such attacks, establishing benchmarks to assess and mitigate these risks is imperative.In this work, we introduce InjecAgent, a benchmark designed to assess the vulnerability of tool-integrated LLM agents to IPI attacks. InjecAgent comprises 1,054 test cases covering 17 different user tools and 62 attacker tools. We categorize attack intentions into two primary types: direct harm to users and exfiltration of private data. We conduct a comprehensive evaluation of 30 different LLM agents and show that agents are vulnerable to IPI attacks, with ReAct-prompted GPT-4 vulnerable to attacks 24% of the time. Further investigation into an enhanced setting, where the attacker instructions are reinforced with a hacking prompt, shows additional increases in success rates. Our findings raise questions about the widespread deployment of LLM Agents.",
  "keywords": [
    "tool-integrated llm agents",
    "we",
    "llm agents",
    "llm",
    "react-prompted gpt-4",
    "indirect prompt injections",
    "a comprehensive evaluation",
    "vulnerable",
    "a hacking prompt",
    "llms",
    "prompt",
    "i",
    "30 different llm agents",
    "gpt-4",
    "vulnerability"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.624/",
  "provenance": {
    "collected_at": "2025-06-05 10:57:08",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}