{
  "id": "2024.findings-acl.879",
  "title": "L}ang{S}uit{\\textperiodcentered}{E}: Planning, Controlling and Interacting with Large Language Models in Embodied Text Environments",
  "authors": [
    "Jia, Zixia  and\nWang, Mengmeng  and\nTong, Baichen  and\nZhu, Song-Chun  and\nZheng, Zilong"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Recent advances in Large Language Models (LLMs) have shown inspiring achievements in constructing autonomous agents that rely onlanguage descriptions as inputs. However, it remains unclear how well LLMs can function as few-shot or zero-shot embodied agents in dynamic interactive environments. To address this gap, we introduce LangSuit·E, a versatile and simulation-free testbed featuring 6 representative embodied tasks in textual embodied worlds. Compared with previous LLM-based testbeds, LangSuit·E (i) offers adaptability to diverse environments without multiple simulation engines, (ii) evaluates agents’ capacity to develop “internalized world knowledge” with embodied observations, and (iii) allows easy customization of communication and action strategies. To address the embodiment challenge, we devise a novel chain-of-thought (CoT) schema, EmMem, which summarizes embodied states w.r.t. history information. Comprehensive benchmark results illustrate challenges and insights of embodied planning. LangSuit·E represents a significant step toward building embodied generalists in the context of language models.",
  "keywords": [
    "generalists",
    "chain",
    "communication and action strategies",
    "we",
    "embodied text environments",
    "inspiring achievements",
    "llm",
    "shot",
    "embodied planning langsuit e",
    "textual embodied worlds",
    "cot",
    "it",
    "information",
    "ang",
    "llms"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.879/",
  "provenance": {
    "collected_at": "2025-06-05 11:00:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}