{
  "id": "2024.findings-acl.411",
  "title": "M}ath{B}ench: Evaluating the Theory and Application Proficiency of {LLM}s with a Hierarchical Mathematics Benchmark",
  "authors": [
    "Liu, Hongwei  and\nZheng, Zilong  and\nQiao, Yuxuan  and\nDuan, Haodong  and\nFei, Zhiwei  and\nZhou, Fengzhe  and\nZhang, Wenwei  and\nZhang, Songyang  and\nLin, Dahua  and\nChen, Kai"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Recent advancements in large language models (LLMs) have showcased significant improvements in mathematics. However, traditional math benchmarks like GSM8k offer a unidimensional perspective, which fall short in providing a holistic assessment of the LLMs’ math capabilities. To address this gap, we introduce MathBench, a new benchmark that rigorously assesses the mathematical capabilities of large language models. MathBench spans a wide range of mathematical disciplines, offering a detailed evaluation of both theoretical understanding and practical problem-solving skills. The benchmark progresses through five distinct stages, from basic arithmetic to college mathematics, and is structured to evaluate models at various depths of knowledge. Each stage includes theoretical questions and application problems, allowing us to measure a model’s mathematical proficiency and its ability to apply concepts in practical scenarios. MathBench aims to enhance the evaluation of LLMs’ mathematical abilities, providing a nuanced view of their knowledge understanding levels and problem solving skills in a bilingual context.",
  "keywords": [
    "a nuanced view",
    "we",
    "the mathematical capabilities",
    "mathematical abilities",
    "llm",
    "a detailed evaluation",
    "the llms math capabilities",
    "llms",
    "abilities",
    "large language models llms",
    "proficiency",
    "hierarchical",
    "knowledge",
    "language",
    "model"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.411/",
  "provenance": {
    "collected_at": "2025-06-05 10:54:13",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}