{
  "id": "2024.bionlp-1.34",
  "title": "Evaluating Large Language Models for Predicting Protein Behavior under Radiation Exposure and Disease Conditions",
  "authors": [
    "Engel, Ryan  and\nPark, Gilchan"
  ],
  "year": "2024",
  "venue": "Proceedings of the 23rd Workshop on Biomedical Natural Language Processing",
  "abstract": "The primary concern with exposure to ionizing radiation is the risk of developing diseases. While high doses of radiation can cause immediate damage leading to cancer, the effects of low-dose radiation (LDR) are less clear and more controversial. To further investigate this, it necessitates focusing on the underlying biological structures affected by radiation. Recent work has shown that Large Language Models (LLMs) can effectively predict protein structures and other biological properties. The aim of this research is to utilize open-source LLMs, such as Mistral, Llama 2, and Llama 3, to predict both radiation-induced alterations in proteins and the dynamics of protein-protein interactions (PPIs) within the presence of specific diseases. We show that fine-tuning these models yields state-of-the-art performance for predicting protein interactions in the context of neurodegenerative diseases, metabolic disorders, and cancer. Our findings contribute to the ongoing efforts to understand the complex relationships between radiation exposure and disease mechanisms, illustrating the nuanced capabilities and limitations of current computational models.",
  "keywords": [
    "other biological properties",
    "we",
    "the nuanced capabilities",
    "current",
    "neurodegenerative",
    "it",
    "properties",
    "neurodegenerative diseases",
    "llms",
    "large language models llms",
    "fine",
    "work",
    "language",
    "large language models",
    "open-source llms"
  ],
  "url": "https://aclanthology.org/2024.bionlp-1.34/",
  "provenance": {
    "collected_at": "2025-06-05 11:04:22",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}