{
  "id": "2024.findings-acl.703",
  "title": "CM}oral{E}val: A Moral Evaluation Benchmark for {C}hinese Large Language Models",
  "authors": [
    "Yu, Linhao  and\nLeng, Yongqi  and\nHuang, Yufei  and\nWu, Shang  and\nLiu, Haixin  and\nJi, Xinmeng  and\nZhao, Jiahui  and\nSong, Jinwang  and\nCui, Tingting  and\nCheng, Xiaoqing  and\nLiutao, Liutao  and\nXiong, Deyi"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "What a large language model (LLM) would respond in ethically relevant context? In this paper, we curate a large benchmark CMoralEval for morality evaluation of Chinese LLMs. The data sources of CMoralEval are two-fold: 1) a Chinese TV program discussing Chinese moral norms with stories from the society and 2) a collection of Chinese moral anomies from various newspapers and academic papers on morality. With these sources, we aim to create a moral evaluation dataset characterized by diversity and authenticity. We develop a morality taxonomy and a set of fundamental moral principles that are not only rooted in traditional Chinese culture but also consistent with contemporary societal norms. To facilitate efficient construction and annotation of instances in CMoralEval, we establish a platform with AI-assisted instance generation to streamline the annotation process. These help us curate CMoralEval that encompasses both explicit moral scenarios (14,964 instances) and moral dilemma scenarios (15,424 instances), each with instances from different data sources. We conduct extensive experiments with CMoralEval to examine a variety of Chinese LLMs. Experiment results demonstrate that CMoralEval is a challenging benchmark for Chinese LLMs.",
  "keywords": [
    "variety",
    "efficient",
    "we",
    "llm",
    "val",
    "efficient construction",
    "a variety",
    "llms",
    "contemporary societal norms",
    "chinese llms",
    "the society",
    "stories",
    "morality evaluation",
    "a moral evaluation benchmark",
    "society"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.703/",
  "provenance": {
    "collected_at": "2025-06-05 10:58:12",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}