{
  "id": "2024.arabicnlp-1.71",
  "title": "J}ustice{L}eague at {FIGNEWS} 2024 Shared Task: Innovations in Bias Annotation",
  "authors": [
    "Saleh, Amr  and\nMohamed, Huda  and\nSayed, Hager"
  ],
  "year": "2024",
  "venue": "Proceedings of the Second Arabic Natural Language Processing Conference",
  "abstract": "In response to the evolving media representation of the Gaza-Israel conflict, this study aims to categorize news articles based on their bias towards specific entities. Our primary objective is to annotate news articles with labels that indicate their bias: “Unbiased”, “Biased against Palestine”, “Biased against Israel”, “Biased against both Palestine and Israel”, “Biased against others”, “Unclear”, or “Not Applicable”.The methodology involves a detailed annotation process where each article is carefully reviewed and labeled according to predefined guidelines. For instance, an article reporting factual events without derogatory language is labeled as “Unbiased”, while one using inflammatory language against Palestinians is marked as “Biased against Palestine”.Key findings include the identification of various degrees of bias in news articles, highlighting the importance of critical analysis in media consumption. This research contributes to the broader effort of understanding media bias and promoting unbiased journalism. Tools such as Google Drive and Google Sheets facilitated the annotation process, enabling efficient collaboration and data management among the annotators.Our work also includes comprehensive guidelines and examples to ensure consistent annotation, enhancing the reliability of the data.",
  "keywords": [
    "bias",
    "unbiased",
    "efficient",
    "unbiased journalism tools",
    "their bias",
    "our primary objective",
    "analysis",
    "bias annotation",
    "objective",
    "work",
    "process",
    "language",
    "entities",
    "media bias",
    "specific entities"
  ],
  "url": "https://aclanthology.org/2024.arabicnlp-1.71/",
  "provenance": {
    "collected_at": "2025-06-05 11:03:09",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}