{
  "id": "2024.findings-acl.970",
  "title": "RESEMO}: A Benchmark {C}hinese Dataset for Studying Responsive Emotion from Social Media Content",
  "authors": [
    "Hu, Bo  and\nZhang, Meng  and\nXie, Chenfei  and\nTian, Yuanhe  and\nSong, Yan  and\nMao, Zhendong"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "On social media platforms, users’ emotions are triggered when they encounter particular content from other users,where such emotions are different from those that spontaneously emerged, owing to the “responsive” nature. Analyzing the aforementioned responsive emotions from user interactions is a task of significant importance for understanding human cognition, the mechanisms of emotion generation, and behavior on the Internet, etc. Performing the task with artificial intelligence generally requires human-annotated data to help train a well-performing system, while existing data resources do not cover this specific area, with none of them focusing on responsive emotion analysis. In this paper, we propose a Chinese dataset named ResEmo for responsive emotion analysis, including 3813 posts with 68,781 comments collected from Weibo, the largest social media platform in China. ResEmo contains three types of human annotations with respect to responsive emotions, namely, responsive relationship, responsive emotion cause, and responsive emotion category. Moreover, to test this dataset, we build large language model (LLM) baseline methods for responsive relation extraction, responsive emotion cause extraction, and responsive emotion detection, which show the potential of the proposed ResEmo being a benchmark for future studies on responsive emotions.",
  "keywords": [
    "extraction",
    "we",
    "llm",
    "future studies",
    "analysis",
    "generation",
    "language",
    "model",
    "studies",
    "human",
    "emotion generation",
    "area",
    "china",
    "responsive emotion analysis",
    "media"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.970/",
  "provenance": {
    "collected_at": "2025-06-05 11:01:50",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}