{
  "id": "2024.acl-long.859",
  "title": "L}oo{GLE}: Can Long-Context Language Models Understand Long Contexts?",
  "authors": [
    "Li, Jiaqi  and\nWang, Mengmeng  and\nZheng, Zilong  and\nZhang, Muhan"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Large language models (LLMs) are typically limited to processing texts within context window size, which has spurred significant research efforts into enhancing LLMs’ long-context understanding as well as developing high-quality benchmarks to evaluate the ability. However, prior datasets suffer from short comings like short length compared to the context window of modern LLMs; outdated documents that might have data leakage problems; and an emphasis on short dependency tasks only. In this paper, we present LooGLE , a Long Context Generic Language Evaluation benchmark. It features documents post-2022, with over 24,000 tokens per document and 6,000 newly generated questions spanning varying dependency ranges in diverse domains. Human annotators meticulously crafted over 1,100 high-quality question-answer (QA) pairs with thorough cross-validation for a most precise assessment of LLMs’ long dependency capabilities. We conduct a comprehensive evaluation of representative LLMs on LooGLE . The results indicate that most LLMs have shockingly bad long context ability and fail to capture long dependencies in the context, even when their context window size is enough to fit the entire document. Our results shed light on enhancing the “true long-context understanding” ability of LLMs instead of merely enlarging their context window.",
  "keywords": [
    "validation",
    "varying dependency",
    "question",
    "long dependency capabilities",
    "we",
    "newly generated questions",
    "cross",
    "short dependency tasks",
    "answer",
    "it",
    "long dependencies",
    "dependencies",
    "a comprehensive evaluation",
    "llms",
    "processing"
  ],
  "url": "https://aclanthology.org/2024.acl-long.859/",
  "provenance": {
    "collected_at": "2025-06-05 10:46:07",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}