{
  "id": "2024.acl-long.677",
  "title": "Analyzing {LLM} Behavior in Dialogue Summarization: Unveiling Circumstantial Hallucination Trends",
  "authors": [
    "Ramprasad, Sanjana  and\nFerracane, Elisa  and\nLipton, Zachary"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Recent advancements in large language models (LLMs) have significantly advanced the capabilities of summarization systems.However, they continue to face a persistent challenge: hallucination. While prior work has extensively examined LLMs in news domains, evaluation of dialogue summarization has primarily focused on BART-based models, resulting in a notable gap in understanding LLM effectiveness.Our work seeks to address this gap by benchmarking LLMs for dialogue summarization faithfulness using human annotations,focusing on identifying and categorizing span-level inconsistencies.Specifically, we evaluate two prominent LLMs: GPT-4 and Alpaca-13B.Our evaluation reveals that LLMs often generate plausible, but not fully supported inferences based on conversation contextual cues, a trait absent in older models. As a result, we propose a refined taxonomy of errors, introducing a novel category termed “Contextual Inference” to address this aspect of LLM behavior. Using our taxonomy, we compare the behavioral differences between LLMs and older fine-tuned models. Additionally, we systematically assess the efficacy of automatic error detection methods on LLM summaries and find that they struggle to detect these nuanced errors effectively. To address this, we introduce two prompt-based approaches for fine-grained error detection. Our methods outperform existing metrics, particularly in identifying the novel “Contextual Inference” error type.",
  "keywords": [
    "summarization",
    "we",
    "llm effectiveness",
    "dialogue",
    "summarization systems",
    "news domains evaluation",
    "llm",
    "the capabilities",
    "llm summaries",
    "llms",
    "prompt",
    "metrics",
    "dialogue summarization",
    "large language models llms",
    "two prominent llms"
  ],
  "url": "https://aclanthology.org/2024.acl-long.677/",
  "provenance": {
    "collected_at": "2025-06-05 10:43:38",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}