{
  "id": "2024.acl-tutorials.3",
  "title": "Computational Expressivity of Neural Language Models",
  "authors": [
    "Butoi, Alexandra  and\nChan, Robin  and\nCotterell, Ryan  and\nMerrill, William  and\nNowak, Franz  and\nPasti, Clemente  and\nStrobl, Lena  and\nSvete, Anej"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 5: Tutorial Abstracts)",
  "abstract": "Language models (LMs) are currently at the forefront of NLP research due to their remarkable versatility across diverse tasks. However, a large gap exists between their observed capabilities and the explanations proposed by established formal machinery. To motivate a better theoretical characterization of LMs’ abilities and limitations, this tutorial aims to provide a comprehensive introduction to a specific framework for formal analysis of modern LMs using tools from formal language theory (FLT). We present how tools from FLT can be useful in understanding the inner workings and predicting the capabilities of modern neural LM architectures. We cover recent results using FLT to make precise and practically relevant statements about LMs based on recurrent neural networks and transformers by relating them to formal devices such as finite-state automata, Turing machines, and analog circuits. Altogether, the results covered in this tutorial allow us to make precise statements and explanations about the observed as well as predicted behaviors of LMs, as well as provide theoretically motivated suggestions on the aspects of the architectures that could be improved.",
  "keywords": [
    "transformers",
    "we",
    "recurrent neural networks",
    "the inner workings",
    "neural",
    "inner",
    "machinery",
    "the capabilities",
    "recurrent",
    "analysis",
    "abilities",
    "lms abilities",
    "their observed capabilities",
    "established formal machinery",
    "nlp research"
  ],
  "url": "https://aclanthology.org/2024.acl-tutorials.3/",
  "provenance": {
    "collected_at": "2025-06-05 10:48:30",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}