{
  "id": "2024.acl-long.849",
  "title": "M}ulti{PIC}o: Multilingual Perspectivist Irony Corpus",
  "authors": [
    "Casola, Silvia  and\nFrenda, Simona  and\nLo, Soda Marem  and\nSezerer, Erhan  and\nUva, Antonio  and\nBasile, Valerio  and\nBosco, Cristina  and\nPedrani, Alessandro  and\nRubagotti, Chiara  and\nPatti, Viviana  and\nBernardi, Davide"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Recently, several scholars have contributed to the growth of a new theoretical framework in NLP called perspectivism. This approach aimsto leverage data annotated by different individuals to model diverse perspectives that affect their opinions on subjective phenomena such as irony. In this context, we propose MultiPICo, a multilingual perspectivist corpus of ironic short conversations in different languages andlinguistic varieties extracted from Twitter and Reddit. The corpus includes sociodemographic information about its annotators. Our analysis of the annotated corpus shows how different demographic cohorts may significantly disagree on their annotation of irony and how certain cultural factors influence the perception of the phenomenon and the agreement on the annotation. Moreover, we show how disaggregated annotations and rich annotator metadata can be exploited to benchmark the ability of large language models to recognize irony, their positionality with respect to sociodemographic groups, and the efficacy of perspective-taking prompting for irony detection in multiple languages.",
  "keywords": [
    "conversations",
    "ironic short conversations",
    "varieties",
    "we",
    "information",
    "rich",
    "different languages andlinguistic varieties",
    "analysis",
    "language",
    "nlp",
    "large language models",
    "perspective-taking prompting",
    "prompting",
    "pic",
    "the growth"
  ],
  "url": "https://aclanthology.org/2024.acl-long.849/",
  "provenance": {
    "collected_at": "2025-06-05 10:45:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}