{
  "id": "2024.acl-long.830",
  "title": "S}afety{B}ench: Evaluating the Safety of Large Language Models",
  "authors": [
    "Zhang, Zhexin  and\nLei, Leqi  and\nWu, Lindong  and\nSun, Rui  and\nHuang, Yongkang  and\nLong, Chong  and\nLiu, Xiao  and\nLei, Xuanyu  and\nTang, Jie  and\nHuang, Minlie"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "With the rapid development of Large Language Models (LLMs), increasing attention has been paid to their safety concerns. Consequently, evaluating the safety of LLMs has become an essential task for facilitating the broad applications of LLMs. Nevertheless, the absence of comprehensive safety evaluation benchmarks poses a significant impediment to effectively assess and enhance the safety of LLMs. In this work, we present SafetyBench, a comprehensive benchmark for evaluating the safety of LLMs, which comprises 11,435 diverse multiple choice questions spanning across 7 distinct categories of safety concerns. Notably, SafetyBench also incorporates both Chinese and English data, facilitating the evaluation in both languages. Our extensive tests over 25 popular Chinese and English LLMs in both zero-shot and few-shot settings reveal a substantial performance advantage for GPT-4 over its counterparts, and there is still significant room for improving the safety of current LLMs. We also demonstrate that the measured safety understanding abilities in SafetyBench are correlated with safety generation abilities. Data and evaluation guidelines are available at https://github.com/thu-coai/SafetyBench. Submission entrance and leaderboard are available at https://llmbench.ai/safety.",
  "keywords": [
    "https llmbench",
    "we",
    "current",
    "shot",
    "current llms",
    "increasing attention",
    "evaluation guidelines",
    "comprehensive safety evaluation benchmarks",
    "llms",
    "abilities",
    "categories",
    "gpt-4",
    "7 distinct categories",
    "work",
    "safety generation abilities data"
  ],
  "url": "https://aclanthology.org/2024.acl-long.830/",
  "provenance": {
    "collected_at": "2025-06-05 10:45:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}