{
  "id": "2024.acl-long.469",
  "title": "Towards Real-World Writing Assistance: A {C}hinese Character Checking Benchmark with Faked and Misspelled Characters",
  "authors": [
    "Li, Yinghui  and\nXu, Zishan  and\nChen, Shaoshen  and\nHuang, Haojing  and\nLi, Yangning  and\nMa, Shirong  and\nJiang, Yong  and\nLi, Zhongli  and\nZhou, Qingyu  and\nZheng, Hai-Tao  and\nShen, Ying"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Writing assistance aims to improve the correctness and quality of input texts, with character checking being crucial in detecting and correcting wrong characters. In the real world where handwriting occupies the vast majority, characters that humans get wrong include faked characters (i.e., untrue characters created due to writing errors) and misspelled characters (i.e., true characters used incorrectly due to spelling errors). However, existing datasets and related studies only focus on misspelled characters that can be represented by computer text encoding systems, thereby ignoring faked characters which are more common and difficult. To break through this dilemma, we presentVisual-C3, a human-annotatedVisualChineseCharacterChecking dataset with faked and misspelled Chinese characters. To the best of our knowledge, Visual-C3is the first real-world visual and the largest human-crafted dataset for the Chinese character checking scenario. Additionally, we also propose and evaluate novel baseline methods on Visual-C3. Extensive empirical results and analyses show that Visual-C3is high-quality yet challenging. As the first study focusing on Chinese faked characters, the dataset and the baseline methods are publicly available at https://github.com/THUKElab/Visual-C3.",
  "keywords": [
    "related studies",
    "we",
    "visual",
    "i",
    "text",
    "knowledge",
    "studies",
    "human",
    "characters",
    "scenario",
    "correctness",
    "wrong characters",
    "the first real-world visual",
    "faked characters",
    "we presentvisual-c3"
  ],
  "url": "https://aclanthology.org/2024.acl-long.469/",
  "provenance": {
    "collected_at": "2025-06-05 10:40:45",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}