{
  "id": "2024.findings-acl.652",
  "title": "Developing {PUGG} for {P}olish: A Modern Approach to {KBQA}, {MRC}, and {IR} Dataset Construction",
  "authors": [
    "Sawczyn, Albert  and\nViarenich, Katsiaryna  and\nWojtasik, Konrad  and\nDomoga{\\l}a, Aleksandra  and\nOleksy, Marcin  and\nPiasecki, Maciej  and\nKajdanowicz, Tomasz"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Advancements in AI and natural language processing have revolutionized machine-human language interactions, with question answering (QA) systems playing a pivotal role. The knowledge base question answering (KBQA) task, utilizing structured knowledge graphs (KG), allows for handling extensive knowledge-intensive questions. However, a significant gap exists in KBQA datasets, especially for low-resource languages. Many existing construction pipelines for these datasets are outdated and inefficient in human labor, and modern assisting tools like Large Language Models (LLM) are not utilized to reduce the workload. To address this, we have designed and implemented a modern, semi-automated approach for creating datasets, encompassing tasks such as KBQA, Machine Reading Comprehension (MRC), and Information Retrieval (IR), tailored explicitly for low-resource environments. We executed this pipeline and introduced the PUGG dataset, the first Polish KBQA dataset, and novel datasets for MRC and IR. Additionally, we provide a comprehensive implementation, insightful findings, detailed statistics, and evaluation of baseline models.",
  "keywords": [
    "inefficient",
    "question",
    "kbqa mrc",
    "we",
    "kbqa",
    "natural",
    "retrieval",
    "information",
    "structured knowledge graphs",
    "processing",
    "information retrieval",
    "knowledge",
    "language",
    "kbqa task",
    "machine"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.652/",
  "provenance": {
    "collected_at": "2025-06-05 10:57:31",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}