{
  "id": "2024.acl-long.134",
  "title": "V}erifi{NER}: Verification-augmented {NER} via Knowledge-grounded Reasoning with Large Language Models",
  "authors": [
    "Kim, Seoyeon  and\nSeo, Kwangwook  and\nChae, Hyungjoo  and\nYeo, Jinyoung  and\nLee, Dongha"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Recent approaches in domain-specific named entity recognition (NER), such as biomedical NER, have shown remarkable advances. However, they still lack of faithfulness, producing erroneous predictions. We assume that knowledge of entities can be useful in verifying the correctness of the predictions. Despite the usefulness of knowledge, resolving such errors with knowledge is nontrivial, since the knowledge itself does not directly indicate the ground-truth label. To this end, we propose VerifiNER, a post-hoc verification framework that identifies errors from existing NER methods using knowledge and revises them into more faithful predictions. Our framework leverages the reasoning abilities of large language models to adequately ground on knowledge and the contextual information in the verification process. We validate effectiveness of VerifiNER through extensive experiments on biomedical datasets. The results suggest that VerifiNER can successfully verify errors from existing models as a model-agnostic approach. Further analyses on out-of-domain and low-resource settings show the usefulness of VerifiNER on real-world applications.",
  "keywords": [
    "end",
    "biomedical ner",
    "we",
    "information",
    "abilities",
    "verifiner",
    "ner",
    "erifi ner verification-augmented ner",
    "process",
    "knowledge",
    "language",
    "existing ner methods",
    "model",
    "entities",
    "large language models"
  ],
  "url": "https://aclanthology.org/2024.acl-long.134/",
  "provenance": {
    "collected_at": "2025-06-05 10:36:07",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}