{
  "id": "2024.acl-long.233",
  "title": "C}o{CA}: Fusing Position Embedding with Collinear Constrained Attention in Transformers for Long Context Window Extending",
  "authors": [
    "Zhu, Shiyi  and\nYe, Jing  and\nJiang, Wei  and\nXue, Siqiao  and\nZhang, Qi  and\nWu, Yifan  and\nLi, Jianguo"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Self-attention and position embedding are two crucial modules in transformer-based Large Language Models (LLMs). However, the potential relationship between them is far from well studied, especially for long context window extending. In fact, anomalous behaviors that hinder long context extrapolation exist between Rotary Position Embedding (RoPE) and vanilla self-attention.Incorrect initial angles betweenQandKcan cause misestimation in modeling rotary position embedding of the closest tokens.To address this issue, we proposeCollinearConstrainedAttention mechanism, namely CoCA. Specifically, we enforce a collinear constraint betweenQandKto seamlessly integrate RoPE and self-attention.While only adding minimal computational and spatial complexity, this integration significantly enhances long context window extrapolation ability. We provide an optimized implementation, making it a drop-in replacement for any existing transformer-based models.Extensive experiments demonstrate that CoCA excels in extending context windows. A CoCA-based GPT model, trained with a context length of 512, can extend the context window up to 32K (60×) without any fine-tuning.Additionally, incorporating CoCA into LLaMA-7B achieves extrapolation up to 32K within a training length of only 2K.Our code is publicly available at: https://github.com/codefuse-ai/Collinear-Constrained-Attention",
  "keywords": [
    "code",
    "transformers",
    "any fine-tuning",
    "a collinear constraint betweenqandkto",
    "self-attention",
    "we",
    "collinear constrained attention",
    "training",
    "betweenqandkto",
    "it",
    "self",
    "tuning",
    "transformer-based large language models",
    "collinear-constrained-attention",
    "proposecollinearconstrainedattention mechanism"
  ],
  "url": "https://aclanthology.org/2024.acl-long.233/",
  "provenance": {
    "collected_at": "2025-06-05 10:37:29",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}