{
  "id": "2024.acl-long.99",
  "title": "Dissecting Human and {LLM} Preferences",
  "authors": [
    "Li, Junlong  and\nZhou, Fan  and\nSun, Shichao  and\nZhang, Yikai  and\nZhao, Hai  and\nLiu, Pengfei"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "As a relative quality comparison of model responses, human and Large Language Model (LLM) preferences serve as common alignment goals in model fine-tuning and criteria in evaluation. Yet, these preferences merely reflect broad tendencies, resulting in less explainable and controllable models with potential safety risks. In this work, we dissect the preferences of human and 32 different LLMs to understand their quantitative composition, using annotations from real-world user-model conversations for a fine-grained, scenario-wise analysis. We find that humans are less sensitive to errors, favor responses that support their stances, and show clear dislike when models admit their limits. On the contrary, advanced LLMs like GPT-4-Turbo emphasize correctness, clarity, and harmlessness more. Additionally, LLMs of similar sizes tend to exhibit similar preferences, regardless of their training methods, and fine-tuning for alignment does not significantly alter the preferences of pretrained-only LLMs. Finally, we show that preference-based evaluation can be intentionally manipulated. In both training-free and training-based settings, aligning a model with the preferences of judges boosts scores, while injecting the least preferred properties lowers them. This results in notable score shifts: up to 0.59 on MT-Bench (1-10 scale) and 31.94 on AlpacaEval 2.0 (0-100 scale), highlighting the significant impact of this strategic adaptation. We have made all resources of this project publicly available.",
  "keywords": [
    "pretrained-only llms",
    "conversations",
    "we",
    "gpt-4-turbo",
    "llm",
    "common alignment goals",
    "training",
    "fine-tuning",
    "llm preferences",
    "preference-based evaluation",
    "real-world user-model conversations",
    "properties",
    "analysis",
    "32 different llms",
    "llms"
  ],
  "url": "https://aclanthology.org/2024.acl-long.99/",
  "provenance": {
    "collected_at": "2025-06-05 10:35:38",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}