{
  "id": "2024.acl-long.774",
  "title": "The Heuristic Core: Understanding Subnetwork Generalization in Pretrained Language Models",
  "authors": [
    "Bhaskar, Adithya  and\nFriedman, Dan  and\nChen, Danqi"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Prior work has found that pretrained language models (LMs) fine-tuned with different random seeds can achieve similar in-domain performance but generalize differently on tests of syntactic generalization. In this work, we show that, even within a single model, we can find multiple subnetworks that perform similarly in-domain, but generalize vastly differently. To better understand these phenomena, we investigate if they can be understood in terms of “competing subnetworks”: the model initially represents a variety of distinct algorithms, corresponding to different subnetworks, and generalization occurs when it ultimately converges to one. This explanation has been used to account for generalization in simple algorithmic tasks (“grokking”). Instead of finding competing subnetworks, we find that all subnetworks—whether they generalize or not—share a set of attention heads, which we refer to as the _heuristic core_. Further analysis suggests that these attention heads emerge early in training and compute shallow, non-generalizing features. The model learns to generalize by incorporating additional attention heads, which depend on the outputs of the “heuristic” heads to compute higher-level features. Overall, our results offer a more detailed picture of the mechanisms for syntactic generalization in pre-trained LMs.",
  "keywords": [
    "compute shallow non-generalizing features",
    "variety",
    "syntactic generalization",
    "additional attention heads",
    "we",
    "these attention heads",
    "training",
    "it",
    "a variety",
    "generalizing",
    "core",
    "analysis",
    "attention heads",
    "subnetwork generalization",
    "generalization"
  ],
  "url": "https://aclanthology.org/2024.acl-long.774/",
  "provenance": {
    "collected_at": "2025-06-05 10:44:57",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}