{
  "id": "2024.findings-acl.199",
  "title": "Enhancing Semantic Consistency of Large Language Models through Model Editing: An Interpretability-Oriented Approach",
  "authors": [
    "Yang, Jingyuan  and\nChen, Dapeng  and\nSun, Yajing  and\nLi, Rongjun  and\nFeng, Zhiyong  and\nPeng, Wei"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "A Large Language Model (LLM) tends to generate inconsistent and sometimes contradictory outputs when presented with a prompt that has equivalent semantics but is expressed differently from the original prompt. To achieve semantic consistency of an LLM, one of the key approaches is to finetune the model with prompt-output pairs with semantically equivalent meanings. Despite its effectiveness, a data-driven finetuning method incurs substantial computation costs in data preparation and model optimization. In this regime, an LLM is treated as a “black box”, restricting our ability to gain deeper insights into its internal mechanism. In this paper, we are motivated to enhance the semantic consistency of LLMs through a more interpretable method (i.e., model editing) to this end. We first identify the model components (i.e., attention heads) that have a key impact on the semantic consistency of an LLM. We subsequently inject biases into the output of these model components along the semantic-consistency activation direction. It is noteworthy that these modifications are cost-effective, without reliance on mass manipulations of the original model parameters. Through comprehensive experiments on the constructed NLU and open-source NLG datasets, our method demonstrates significant improvements in the semantic consistency and task performance of LLMs. Additionally, our method exhibits promising generalization capabilities by performing well on tasks beyond the primary tasks.",
  "keywords": [
    "end",
    "an llm",
    "semantic",
    "we",
    "model optimization",
    "llm",
    "equivalent semantics",
    "semantics",
    "generalization capabilities",
    "it",
    "the semantic-consistency activation direction",
    "the original prompt",
    "llms",
    "semantically equivalent meanings",
    "prompt"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.199/",
  "provenance": {
    "collected_at": "2025-06-05 10:51:19",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}