{
  "id": "2024.climatenlp-1.6",
  "title": "Evaluating {C}hat{N}et{Z}ero, an {LLM}-Chatbot to Demystify Climate Pledges",
  "authors": [
    "Hsu, Angel  and\nLaney, Mason  and\nZhang, Ji  and\nManya, Diego  and\nFarczadi, Linda"
  ],
  "year": "2024",
  "venue": "Proceedings of the 1st Workshop on Natural Language Processing Meets Climate Change (ClimateNLP 2024)",
  "abstract": "This paper introduces and evaluates ChatNetZero, a large-language model (LLM) chatbot developed through Retrieval-Augmented Generation (RAG), which uses generative AI to produce answers grounded in verified, climate-domain specific information. We describe ChatNetZero’s design, particularly the innovation of anti-hallucination and reference modules designed to enhance the accuracy and credibility of generated responses. To evaluate ChatNetZero’s performance against other LLMs, including GPT-4, Gemini, Coral, and ChatClimate, we conduct two types of validation: comparing LLMs’ generated responses to original source documents to verify their factual accuracy, and employing an expert survey to evaluate the overall quality, accuracy and relevance of each response. We find that while ChatNetZero responses show higher factual accuracy when compared to original source data, experts surveyed prefer lengthier responses that provide more context. Our results highlight the importance of prioritizing information presentation in the design of domain-specific LLMs to ensure that scientific information is effectively communicated, especially as even expert audiences find it challenging to assess the credibility of AI-generated content.",
  "keywords": [
    "generated responses",
    "the accuracy",
    "llm chatbot",
    "validation",
    "gpt-4 gemini coral",
    "n",
    "we",
    "the overall quality accuracy",
    "-chatbot",
    "llm",
    "chatbot",
    "other llms",
    "a large-language model",
    "an llm -chatbot",
    "their factual accuracy"
  ],
  "url": "https://aclanthology.org/2024.climatenlp-1.6/",
  "provenance": {
    "collected_at": "2025-06-05 11:05:14",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}