{
  "id": "2024.findings-acl.888",
  "title": "I}nstruct{E}d: Soft-Instruction Tuning for Model Editing with Hops",
  "authors": [
    "Han, XiaoQi  and\nLi, Ru  and\nLi, Xiaoli  and\nLiang, Jiye  and\nZhang, Zifang  and\nPan, Jeff"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "The task of model editing becomes popular for correcting inaccurate or outdated parametric knowledge in Large Language Models (LLMs). However, there are major limitations of state of the art (SOTA) model editing methods, including the excessive memorization issue caused by the direct editing methods, as well as the error propagation and knowledge conflict issues from the memory enhancement methods, resulting in hindering models’ *portability*, e.g., the ability to transfer the new knowledge to related one-hop or multi-hop content. To address these issues, we propose the InstructEd method, the idea of which is to insert soft instructions into the attention module so as to facilitate interactions between instructions and questions and to understand and utilize new facts. Our main findings are: (i) InstructEd has achieved SOTA performance on three datasets for one-hop/multi-hop evaluation with LLaMAs and GPT2, achieving 10% (5%) improvement in one-hop (multi-hop) model editing.(ii) Different from earlier methods on editing parameters in FFN, we show that editing attention can also help. (iii) Model editing is highly related to retrieval augmented methods, which can help improve the locality of model editing while slightly decrease the editing performance with hops.",
  "keywords": [
    "one-hop multi-hop evaluation",
    "gpt2",
    "we",
    "instruction",
    "e",
    "earlier methods",
    "tuning",
    "retrieval augmented methods",
    "i",
    "soft",
    "g",
    "earlier",
    "knowledge",
    "language",
    "model"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.888/",
  "provenance": {
    "collected_at": "2025-06-05 11:00:42",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}