{
  "id": "2024.arabicnlp-1.2",
  "title": "Synthetic {A}rabic Medical Dialogues Using Advanced Multi-Agent {LLM} Techniques",
  "authors": [
    "ALMutairi, Mariam  and\nAlKulaib, Lulwah  and\nAktas, Melike  and\nAlsalamah, Sara  and\nLu, Chang-Tien"
  ],
  "year": "2024",
  "venue": "Proceedings of the Second Arabic Natural Language Processing Conference",
  "abstract": "The increasing use of artificial intelligence in healthcare requires robust datasets for training and validation, particularly in the domain of medical conversations. However, the creation and accessibility of such datasets in Arabic face significant challenges, especially due to the sensitivity and privacy concerns that are associated with medical conversations. These conversations are rarely recorded or preserved, making the availability of comprehensive Arabic medical dialogue datasets scarce. This limitation slows down not only the development of effective natural language processing models but also restricts the opportunity for open comparison of algorithms and their outcomes. Recent advancements in large language models (LLMs) like ChatGPT, GPT-4, Gemini-pro, and Claude-3 show promising capabilities in generating synthetic data. To address this gap, we introduce a novel Multi-Agent LLM approach capable of generating synthetic Arabic medical dialogues from patient notes, regardless of the original language. This development presents a significant step towards overcoming the barriers in dataset availability, enhancing the potential for broader research and application in AI-driven medical dialogue systems.",
  "keywords": [
    "validation",
    "conversations",
    "patient notes",
    "we",
    "dialogue",
    "these conversations",
    "llm",
    "synthetic arabic medical dialogues",
    "training",
    "natural",
    "ai-driven medical dialogue systems",
    "chatgpt",
    "medical conversations",
    "processing",
    "-agent llm approach"
  ],
  "url": "https://aclanthology.org/2024.arabicnlp-1.2/",
  "provenance": {
    "collected_at": "2025-06-05 11:02:13",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}