{
  "id": "2024.acl-long.435",
  "title": "Speech Sense Disambiguation: Tackling Homophone Ambiguity in End-to-End Speech Translation",
  "authors": [
    "Yu, Tengfei  and\nLiu, Xuebo  and\nDing, Liang  and\nChen, Kehai  and\nTao, Dacheng  and\nZhang, Min"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "End-to-end speech translation (ST) presents notable disambiguation challenges as it necessitates simultaneous cross-modal and cross-lingual transformations. While word sense disambiguation is an extensively investigated topic in textual machine translation, the exploration of disambiguation strategies for ST models remains limited. Addressing this gap, this paper introduces the concept of speech sense disambiguation (SSD), specifically emphasizing homophones - words pronounced identically but with different meanings. To facilitate this, we first create a comprehensive homophone dictionary and an annotated dataset rich with homophone information established based on speech-text alignment. Building on this unique dictionary, we introduce AmbigST, an innovative homophone-aware contrastive learning approach that integrates a homophone-aware masking strategy. Our experiments on different MuST-C and CoVoST ST benchmarks demonstrate that AmbigST sets new performance standards. Specifically, it achieves SOTA results on BLEU scores for English to German, Spanish, and French ST tasks, underlining its effectiveness in reducing speech sense ambiguity. Data, code and scripts are freely available at https://github.com/ytf-philp/AmbigST.",
  "keywords": [
    "code",
    "end",
    "bleu",
    "we",
    "translation",
    "cross",
    "it",
    "information",
    "rich",
    "word",
    "learning",
    "bleu scores",
    "st",
    "text",
    "strategies"
  ],
  "url": "https://aclanthology.org/2024.acl-long.435/",
  "provenance": {
    "collected_at": "2025-06-05 10:40:17",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}