{
  "id": "2024.findings-acl.558",
  "title": "Fact-Checking the Output of Large Language Models via Token-Level Uncertainty Quantification",
  "authors": [
    "Fadeeva, Ekaterina  and\nRubashevskii, Aleksandr  and\nShelmanov, Artem  and\nPetrakov, Sergey  and\nLi, Haonan  and\nMubarak, Hamdy  and\nTsymbalov, Evgenii  and\nKuzmin, Gleb  and\nPanchenko, Alexander  and\nBaldwin, Timothy  and\nNakov, Preslav  and\nPanov, Maxim"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Large language models (LLMs) are notorious for hallucinating, i.e., producing erroneous claims in their output. Such hallucinations can be dangerous, as occasional factual inaccuracies in the generated text might be obscured by the rest of the output being generally factually correct, making it extremely hard for the users to spot them. Current services that leverage LLMs usually do not provide any means for detecting unreliable generations. Here, we aim to bridge this gap. In particular, we propose a novel fact-checking and hallucination detection pipeline based on token-level uncertainty quantification. Uncertainty scores leverage information encapsulated in the output of a neural network or its layers to detect unreliable predictions, and we show that they can be used to fact-check the atomic claims in the LLM output. Moreover, we present a novel token-level uncertainty quantification method that removes the impact of uncertainty about what claim to generate on the current step and what surface form to use. Our method Claim Conditioned Probability (CCP) measures only the uncertainty of a particular claim value expressed by the model. Experiments on the task of biography generation demonstrate strong improvements for CCP compared to the baselines for seven different LLMs and four languages. Human evaluation reveals that the fact-checking pipeline based on uncertainty quantification is competitive with a fact-checking tool that leverages external knowledge.",
  "keywords": [
    "seven different llms",
    "inaccuracies",
    "occasional factual inaccuracies",
    "form",
    "we",
    "current",
    "llm",
    "biography generation",
    "means",
    "neural",
    "the generated text",
    "four languages human evaluation",
    "it",
    "token",
    "information"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.558/",
  "provenance": {
    "collected_at": "2025-06-05 10:56:13",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}