{
  "id": "2024.findings-acl.298",
  "title": "MIKE}: A New Benchmark for Fine-grained Multimodal Entity Knowledge Editing",
  "authors": [
    "Li, Jiaqi  and\nDu, Miaozeng  and\nZhang, Chuanyi  and\nChen, Yongrui  and\nHu, Nan  and\nQi, Guilin  and\nJiang, Haiyun  and\nCheng, Siyuan  and\nTian, Bozhong"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Multimodal knowledge editing represents a critical advancement in enhancing the capabilities of Multimodal Large Language Models (MLLMs). Despite its potential, current benchmarks predominantly focus on coarse-grained knowledge, leaving the intricacies of fine-grained (FG) multimodal entity knowledge largely unexplored. This gap presents a notable challenge, as FG entity recognition is pivotal for the practical deployment and effectiveness of MLLMs in diverse real-world scenarios. To bridge this gap, we introduce MIKE, a comprehensive benchmark and dataset specifically designed for the FG multimodal entity knowledge editing. MIKE encompasses a suite of tasks tailored to assess different perspectives, including Vanilla Name Answering, Entity-Level Caption, and Complex-Scenario Recognition. In addition, a new form of knowledge editing, Multi-step Editing, is introduced to evaluate the editing efficiency. Through our extensive evaluations, we demonstrate that the current state-of-the-art methods face significant challenges in tackling our proposed benchmark, underscoring the complexity of FG knowledge editing in MLLMs. Our findings spotlight the urgent need for novel approaches in this domain, setting a clear agenda for future research and development efforts within the community.",
  "keywords": [
    "intricacies",
    "form",
    "efficiency",
    "we",
    "current",
    "our extensive evaluations",
    "the intricacies",
    "the capabilities",
    "the editing efficiency",
    "mllms",
    "knowledge",
    "language",
    "evaluations",
    "capabilities",
    "entity"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.298/",
  "provenance": {
    "collected_at": "2025-06-05 10:52:41",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}