{
  "id": "2024.knowllm-1.7",
  "title": "Modeling Uncertainty and Using Post-fusion as Fallback Improves Retrieval Augmented Generation with {LLM}s",
  "authors": [
    "Liu, Ye  and\nMeng, Rui  and\nBhat, Meghana Moorthy  and\nJoty, Shafiq  and\nXiong, Caiming  and\nZhou, Yingbo  and\nYavuz, Semih"
  ],
  "year": "2024",
  "venue": "Proceedings of the 1st Workshop on Towards Knowledgeable Language Models (KnowLLM 2024)",
  "abstract": "The integration of retrieved passages and large language models (LLMs), such as ChatGPTs, has significantly contributed to improving open-domain question answering. However, there is still a lack of exploration regarding the optimal approach for incorporating retrieved passages into the answer generation process. This paper aims to fill this gap by investigating different methods of combining retrieved passages with LLMs to enhance answer generation. We begin by examining the limitations of a commonly-used concatenation approach. Surprisingly, this approach often results in generating “unknown” outputs, even when the correct document is among the top-kretrieved passages. To address this issue, we explore four alternative strategies for integrating the retrieved passages with the LLMs. These strategies include two single-round methods that utilize chain-of-thought reasoning and two multi-round strategies that incorporate feedback loops. Through comprehensive analyses and experiments, we provide insightful observations on how to effectively leverage retrieved passages to enhance the answer generation capability of LLMs. On three open-domain question answering datesets, NQ, TriviaQA and SQuAD, our multi-round approaches outperform traditional concatenation approach, achieving over a 10% improvement in answer EM.",
  "keywords": [
    "em",
    "these strategies",
    "feedback",
    "chain",
    "the llms",
    "question",
    "two multi-round strategies",
    "we",
    "fusion",
    "llm",
    "answer",
    "the top-kretrieved passages",
    "the retrieved passages",
    "retrieval",
    "answer generation"
  ],
  "url": "https://aclanthology.org/2024.knowllm-1.7/",
  "provenance": {
    "collected_at": "2025-06-05 11:07:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}