{
  "id": "2024.findings-acl.581",
  "title": "F}ast{GAS}: Fast Graph-based Annotation Selection for In-Context Learning",
  "authors": [
    "Chen, Zihan  and\nWang, Song  and\nShen, Cong  and\nLi, Jundong"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "In-context learning (ICL) empowers large language models (LLMs) to tackle new tasks by using a series of training instances as prompts. Since generating the prompts needs to sample from a vast pool of instances and annotate them (e.g., add labels in classification task), existing methods have proposed to select a subset of unlabeled examples for annotation, thus enhancing the quality of prompts and concurrently mitigating annotation costs. However, these methods often require a long time to select instances due to their complexity, hindering their practical viability. To address this limitation, we propose a graph-based selection method, FastGAS, designed to efficiently identify high-quality instances while minimizing computational overhead. Initially, we construct a data similarity graph based on instance similarities. Subsequently, employing a graph partitioning algorithm, we partition the graph into pieces. Within each piece (i.e., subgraph), we adopt a greedy approach to pick the most representative nodes. By aggregating nodes from diverse pieces and annotating the corresponding instances, we identify a set of diverse and representative instances for ICL. Compared to prior approaches, our method not only exhibits superior performance on different tasks but also significantly reduces selection time. In addition, we demonstrate the efficacy of our approach in LLMs of larger sizes.",
  "keywords": [
    "series",
    "ast",
    "we",
    "graph",
    "training",
    "classification",
    "pieces",
    "learning",
    "each piece",
    "the prompts",
    "classification task existing methods",
    "piece",
    "llms",
    "instance similarities",
    "i"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.581/",
  "provenance": {
    "collected_at": "2025-06-05 10:56:32",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}