{
  "id": "2024.acl-long.723",
  "title": "ESC}o{T}: Towards Interpretable Emotional Support Dialogue Systems",
  "authors": [
    "Zhang, Tenggan  and\nZhang, Xinjie  and\nZhao, Jinming  and\nZhou, Li  and\nJin, Qin"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Understanding the reason for emotional support response is crucial for establishing connections between users and emotional support dialogue systems. Previous works mostly focus on generating better responses but ignore interpretability, which is extremely important for constructing reliable dialogue systems. To empower the system with better interpretability, we propose an emotional support response generation scheme, namedEmotion-Focused andStrategy-DrivenChain-of-Thought (ESCoT), mimicking the process ofidentifying,understanding, andregulatingemotions. Specially, we construct a new dataset with ESCoT in two steps: (1)Dialogue Generationwhere we first generate diverse conversation situations, then enhance dialogue generation using richer emotional support strategies based on these situations; (2)Chain Supplementwhere we focus on supplementing selected dialogues with elements such as emotion, stimuli, appraisal, and strategy reason, forming the manually verified chains. Additionally, we further develop a model to generate dialogue responses with better interpretability. We also conduct extensive experiments and human evaluations to validate the effectiveness of the proposed ESCoT and generated dialogue responses. Our dataset, code, and model will be released.",
  "keywords": [
    "richer emotional support strategies",
    "code",
    "support",
    "chain",
    "emotional support dialogue systems",
    "we",
    "dialogue",
    "dialogue responses",
    "the manually verified chains",
    "dialogue generation",
    "the proposed escot",
    "reliable dialogue systems",
    "selected dialogues",
    "strategies",
    "human evaluations"
  ],
  "url": "https://aclanthology.org/2024.acl-long.723/",
  "provenance": {
    "collected_at": "2025-06-05 10:44:15",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}