{
  "id": "2024.acl-short.12",
  "title": "On the Role of Long-tail Knowledge in Retrieval Augmented Large Language Models",
  "authors": [
    "Li, Dongyang  and\nYan, Junbing  and\nZhang, Taolin  and\nWang, Chengyu  and\nHe, Xiaofeng  and\nHuang, Longtao  and\nXue{'}, Hui  and\nHuang, Jun"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers)",
  "abstract": "Retrieval augmented generation (RAG) exhibits outstanding performance in promoting the knowledge capabilities of large language models (LLMs) with retrieved documents related to user queries. However, RAG only focuses on improving the response quality of LLMs via enhancing queries indiscriminately with retrieved information, paying little attention to what type of knowledge LLMs really need to answer original queries more accurately. In this paper, we suggest that long-tail knowledge is crucial for RAG as LLMs have already remembered common world knowledge during large-scale pre-training. Based on our observation, we propose a simple but effective long-tail knowledge detection method for LLMs. Specifically, the novel Generative Expected Calibration Error (GECE) metric is derived to measure the “long-tailness” of knowledge based on both statistics and semantics. Hence, we retrieve relevant documents and infuse them into the model for patching knowledge loopholes only when the input query relates to long-tail knowledge. Experiments show that, compared to existing RAG pipelines, our method achieves over 4x speedup in average inference time and consistent performance improvement in downstream tasks.",
  "keywords": [
    "little attention",
    "we",
    "training",
    "the knowledge capabilities",
    "knowledge llms",
    "semantics",
    "queries",
    "retrieval",
    "information",
    "retrieved information",
    "llms",
    "augmented generation rag",
    "generative",
    "original queries",
    "metric"
  ],
  "url": "https://aclanthology.org/2024.acl-short.12/",
  "provenance": {
    "collected_at": "2025-06-05 10:46:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}