{
  "id": "2024.acl-demos.34",
  "title": "An {LLM}-based Knowledge Synthesis and Scientific Reasoning Framework for Biomedical Discovery",
  "authors": [
    "Wysocki, Oskar  and\nMagdalena.wysocka@cruk.manchester.ac.uk, Magdalena.wysocka@cruk.manchester.ac.uk  and\nCarvalho, Danilo  and\nBogatu, Alex  and\nDanilo.miranda@idiap.ch, Danilo.miranda@idiap.ch  and\nMaxime.delmas@idiap.ch, Maxime.delmas@idiap.ch  and\nHarriet.unsworth@cruk.manchester.ac.uk, Harriet.unsworth@cruk.manchester.ac.uk  and\nFreitas, Andre"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 3: System Demonstrations)",
  "abstract": "We present BioLunar, developed using the Lunar framework, as a tool for supporting biological analyses, with a particular emphasis on molecular-level evidence enrichment for biomarker discovery in oncology. The platform integrates Large Language Models (LLMs) to facilitate complex scientific reasoning across distributed evidence spaces, enhancing the capability for harmonizing and reasoning over heterogeneous data sources. Demonstrating its utility in cancer research, BioLunar leverages modular design, reusable data access and data analysis components, and a low-code user interface, enabling researchers of all programming levels to construct LLM-enabled scientific workflows. By facilitating automatic scientific discovery and inference from heterogeneous evidence, BioLunar exemplifies the potential of the integration between LLMs, specialised databases and biomedical tools to support expert-level knowledge synthesis and discovery.",
  "keywords": [
    "code",
    "scientific reasoning framework",
    "llm-enabled scientific workflows",
    "we",
    "automatic scientific discovery",
    "scientific",
    "analysis",
    "llms",
    "complex scientific reasoning",
    "knowledge",
    "language",
    "biolunar",
    "all programming levels",
    "low",
    "tools"
  ],
  "url": "https://aclanthology.org/2024.acl-demos.34/",
  "provenance": {
    "collected_at": "2025-06-05 10:47:44",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}