{
  "id": "2024.acl-long.194",
  "title": "A Multi-Task Embedder For Retrieval Augmented {LLM}s",
  "authors": [
    "Zhang, Peitian  and\nLiu, Zheng  and\nXiao, Shitao  and\nDou, Zhicheng  and\nNie, Jian-Yun"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "LLMs confront inherent limitations in terms of its knowledge, memory, and action. The retrieval augmentation stands as a vital mechanism to address these limitations, which brings in useful information from external sources to augment the LLM. However, existing retrieval methods encounter two pressing issues. On one hand, the general retrievers are not properly optimized for retrieval augmentation hence exhibit limited effectiveness; on the other hand, the task-specific retrievers excel in the targeted retrieval augmentation scenario, while lack the versatility to handle diverse scenarios. In this work, we propose LLM-Embedder for the unified support of diverse retrieval augmentation scenarios. Our method presents three technical contributions. Firstly, we introduce a new reward formulation, namely rank-aware reward. It exploits the ranking position of the desired output among N sampled outputs from the LLM, which leads to fine-grained and robust computation of reward from the LLM’s feedback. Secondly, we design a novel distillation objective, called graded distillation. It incorporates both the absolute value and the relative order of the reward for more sufficient utilization of the LLM’s feedback. Thirdly, we systematically optimize the multi-task learning, which effectively unifies the multiple retrieval functionalities into one model. In our experiment, LLM-Embedder substantially improves the LLM’s performances in various downstream tasks, while introducing superior retrieval augmentation’s effect over both general and task-specifc retrievers. Our data, code, and model have been released at https://github.com/FlagOpen/FlagEmbedding.",
  "keywords": [
    "code",
    "functionalities",
    "support",
    "feedback",
    "we",
    "llm",
    "retrieval augmentation",
    "it",
    "a novel distillation objective",
    "unified",
    "retrieval",
    "information",
    "sufficient",
    "the general retrievers",
    "learning"
  ],
  "url": "https://aclanthology.org/2024.acl-long.194/",
  "provenance": {
    "collected_at": "2025-06-05 10:36:57",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}