{
  "id": "2024.acl-long.702",
  "title": "DRAGIN}: Dynamic Retrieval Augmented Generation based on the Real-time Information Needs of Large Language Models",
  "authors": [
    "Su, Weihang  and\nTang, Yichen  and\nAi, Qingyao  and\nWu, Zhijing  and\nLiu, Yiqun"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Dynamic retrieval augmented generation (RAG) paradigm actively decides when and what to retrieve during the text generation process of Large Language Models (LLMs).There are two key elements of this paradigm: identifying the optimal moment to activate the retrieval module (deciding when to retrieve) and crafting the appropriate query once retrieval is triggered (determining what to retrieve).However, current dynamic RAG methods fall short in both aspects. Firstly, the strategies for deciding when to retrieve often rely on static rules. Moreover, the strategies for deciding what to retrieve typically limit themselves to the LLM’s most recent sentence or the last few tokens, while the LLM’s information needs may span across the entire context.To overcome these limitations, we introduce a new framework, DRAGIN, i.e., Dynamic Retrieval Augmented Generation based on the Information Needs of LLMs. Our framework is specifically designed to make decisions on when and what to retrieve based on the LLM’s information needs during the text generation process.We evaluate DRAGIN along with existing methods comprehensively over 4 knowledge-intensive generation datasets. Experimental results show that DRAGIN achieves superior performance on all tasks, demonstrating the effectiveness of our method.",
  "keywords": [
    "we",
    "current",
    "llm",
    "the strategies",
    "the retrieval module",
    "retrieval",
    "information",
    "the text generation process",
    "llms",
    "i",
    "text",
    "strategies",
    "moment",
    "process",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2024.acl-long.702/",
  "provenance": {
    "collected_at": "2025-06-05 10:43:58",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}