{
  "id": "2024.climatenlp-1.14",
  "title": "Unlearning Climate Misinformation in Large Language Models",
  "authors": [
    "Fore, Michael  and\nSingh, Simranjit  and\nLee, Chaehong  and\nPandey, Amritanshu  and\nAnastasopoulos, Antonios  and\nStamoulis, Dimitrios"
  ],
  "year": "2024",
  "venue": "Proceedings of the 1st Workshop on Natural Language Processing Meets Climate Change (ClimateNLP 2024)",
  "abstract": "Misinformation regarding climate change is a key roadblock in addressing one of the most serious threats to humanity. This paper investigates factual accuracy in large language models (LLMs) regarding climate information. Using true/false labeled Q&A data for fine-tuning and evaluating LLMs on climate-related claims, we compare open-source models, assessing their ability to generate truthful responses to climate change questions. We investigate the detectability of models intentionally poisoned with false climate information, finding that such poisoning may not affect the accuracy of a model’s responses in other domains. Furthermore, we compare the effectiveness of unlearning algorithms, fine-tuning, and Retrieval-Augmented Generation (RAG) for factually grounding LLMs on climate change topics. Our evaluation reveals that unlearning algorithms can be effective for nuanced conceptual claims, despite previous findings suggesting their inefficacy in privacy contexts. These insights aim to guide the development of more factually reliable LLMs and highlight the need for additional work to secure LLMs against misinformation attacks.",
  "keywords": [
    "the accuracy",
    "we",
    "fine-tuning",
    "more factually reliable llms",
    "retrieval",
    "information",
    "llms",
    "tuning",
    "factual accuracy",
    "q",
    "large language models misinformation",
    "large language models llms",
    "fine",
    "accuracy",
    "our evaluation"
  ],
  "url": "https://aclanthology.org/2024.climatenlp-1.14/",
  "provenance": {
    "collected_at": "2025-06-05 11:05:20",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}