{
  "id": "2024.findings-acl.45",
  "title": "How Proficient Are Large Language Models in Formal Languages? An In-Depth Insight for Knowledge Base Question Answering",
  "authors": [
    "Liu, Jinxin  and\nCao, Shulin  and\nShi, Jiaxin  and\nZhang, Tingjian  and\nNie, Lunyiu  and\nHu, Linmei  and\nHou, Lei  and\nLi, Juanzi"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Knowledge Base Question Answering (KBQA) aims to answer natural language questions based on facts in knowledge bases. A typical approach to KBQA is semantic parsing, which translates a question into an executable logical form in a formal language. Recent works leverage the capabilities of large language models (LLMs) for logical form generation to improve performance. However, although it is validated that LLMs are capable of solving some KBQA problems, there has been little discussion on the differences in LLMs’ proficiency in formal languages used in semantic parsing. In this work, we propose to evaluate the understanding and generation ability of LLMs to deal with differently structured logical forms by examining the inter-conversion of natural and formal language through in-context learning of LLMs. Extensive experiments with models of different sizes show that state-of-the-art LLMs can understand formal languages as well as humans, but generating correct logical forms given a few examples remains a challenge. Most importantly, our results also indicate that LLMs exhibit considerable sensitivity. In general, the formal language with a lower formalization level, i.e., the more similar it is to natural language, is more friendly to LLMs. Code and data can be found at https://github.com/Matthewlliu/structure_probe.",
  "keywords": [
    "code",
    "parsing",
    "question",
    "form",
    "semantic",
    "logical form generation",
    "we",
    "kbqa",
    "friendly",
    "natural",
    "it",
    "llms proficiency",
    "learning",
    "the capabilities",
    "natural language"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.45/",
  "provenance": {
    "collected_at": "2025-06-05 10:49:12",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}