{
  "id": "2024.findings-acl.744",
  "title": "Exciting Mood Changes: A Time-aware Hierarchical Transformer for Change Detection Modelling",
  "authors": [
    "Hills, Anthony  and\nTseriotou, Talia  and\nMiscouridou, Xenia  and\nTsakalidis, Adam  and\nLiakata, Maria"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Through the rise of social media platforms, longitudinal language modelling has received much attention over the latest years, especially in downstream tasks such as mental health monitoring of individuals where modelling linguistic content in a temporal fashion is crucial. A key limitation in existing work is how to effectively model temporal sequences within Transformer-based language models. In this work we address this challenge by introducing a novel approach for predicting ‘Moments of Change’ (MoC) in the mood of online users, by simultaneously considering user linguistic and time-aware context. A Hawkes process-inspired transformation layer is applied over the proposed architecture to model the influence of time on users’ posts – capturing both their immediate and historical dynamics. We perform experiments on the two existing datasets for the MoC task and showcase clear performance gains when leveraging the proposed layer. Our ablation study reveals the importance of considering temporal dynamics in detecting subtle and rare mood changes. Our results indicate that considering linguistic and temporal information in a hierarchical manner provide valuable insights into the temporal dynamics of modelling user generated content over time, with applications in mental health monitoring.",
  "keywords": [
    "much attention",
    "layer",
    "we",
    "information",
    "manner",
    "longitudinal language modelling",
    "transformer-based language models",
    "work",
    "transformer",
    "hierarchical",
    "process",
    "a hierarchical manner",
    "language",
    "a time-aware hierarchical transformer",
    "attention"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.744/",
  "provenance": {
    "collected_at": "2025-06-05 10:58:45",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}