{
  "id": "2024.acl-long.453",
  "title": "Direct Metric Optimization for Image Captioning through Reward-Weighted Augmented Data Utilization",
  "authors": [
    "Takada, Takumi  and\nSuzuki, Yuma  and\nTakushima, Hiroki  and\nTanoue, Hayato  and\nSato, Haruki  and\nKumar, Aiswariya  and\nNishihara, Hiroki  and\nHori, Takayuki  and\nUeki, Kazuya"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "While image captioning is an essential field of vision language models (VLM), a lack of continuity between the learning objective and final performance metrics of VLMs complicates their training and optimization. Reinforcement learning (RL) can directly optimize such metrics, but it is accompanied by a significant computational cost, making it difficult to apply to recent large-scale VLMs. In this paper, we propose Direct Metric Optimization (DMO), which is a lightweight final-metric-optimizing training method. We replace the computationally expensive exploration process in RL with an offline, diverse text data augmentation and show that self-supervised training on reward-weighted augmented data leads to direct and stable metric optimization. Our experiments demonstrate that DMO achieves performance comparable to those of the state-of-the-art RL method while saving hundreds of times more model forwarding iterations and greater amounts of computation time. This suggests that DMO constitutes a promising alternative for metric optimization in the era of large-scale VLMs.",
  "keywords": [
    "field",
    "direct metric optimization",
    "era",
    "we",
    "training",
    "it",
    "self",
    "learning",
    "an essential field",
    "the learning objective",
    "metric",
    "text",
    "objective",
    "metrics",
    "metric optimization"
  ],
  "url": "https://aclanthology.org/2024.acl-long.453/",
  "provenance": {
    "collected_at": "2025-06-05 10:40:32",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}