{
  "id": "2024.acl-long.684",
  "title": "A Community-Centric Perspective for Characterizing and Detecting Anti-{A}sian Violence-Provoking Speech",
  "authors": [
    "Verma, Gaurav  and\nGrover, Rynaa  and\nZhou, Jiawei  and\nMathew, Binny  and\nKraemer, Jordan  and\nChoudhury, Munmun  and\nKumar, Srijan"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Violence-provoking speech – speech that implicitly or explicitly promotes violence against the members of the targeted community, contributed to a massive surge in anti-Asian crimes during the COVID-19 pandemic. While previous works have characterized and built tools for detecting other forms of harmful speech, like fear speech and hate speech, our work takes a community-centric approach to studying anti-Asian violence-provoking speech. Using data from ~420k Twitter posts spanning a 3-year duration (January 1, 2020 to February 1, 2023), we develop a codebook to characterize anti-Asian violence-provoking speech and collect a community-crowdsourced dataset to facilitate its large-scale detection using state-of-the-art classifiers. We contrast the capabilities of natural language processing classifiers, ranging from BERT-based to LLM-based classifiers, in detecting violence-provoking speech with their capabilities to detect anti-Asian hateful speech. In contrast to prior work that has demonstrated the effectiveness of such classifiers in detecting hateful speech (F1= 0.89), our work shows that accurate and reliable detection of violence-provoking speech is a challenging task (F1= 0.69). We discuss the implications of our findings, particularly the need for proactive interventions to support Asian communities during public health crises.",
  "keywords": [
    "llm-based classifiers",
    "classifiers",
    "communities",
    "asian communities",
    "we",
    "a challenging task f1",
    "natural",
    "hateful speech f1",
    "the capabilities",
    "such classifiers",
    "processing",
    "bert",
    "anti",
    "natural language processing classifiers",
    "their capabilities"
  ],
  "url": "https://aclanthology.org/2024.acl-long.684/",
  "provenance": {
    "collected_at": "2025-06-05 10:43:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}