{
  "id": "2024.findings-acl.384",
  "title": "Exploring Defeasibility in Causal Reasoning",
  "authors": [
    "Cui, Shaobo  and\nMilikic, Lazar  and\nFeng, Yiyang  and\nIsmayilzada, Mete  and\nPaul, Debjit  and\nBosselut, Antoine  and\nFaltings, Boi"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Defeasibility in causal reasoning implies that the causal relationship between cause and effect can be strengthened or weakened. Namely, the causal strength between cause and effect should increase or decrease with the incorporation of strengthening arguments (supporters) or weakening arguments (defeaters), respectively. However, existing works ignore defeasibility in causal reasoning and fail to evaluate existing causal strength metrics in defeasible settings. In this work, we presentğ›¿-CAUSAL, the first benchmark dataset for studying defeasibility in causal reasoning.ğ›¿-CAUSAL includes around 11K events spanning ten domains, featuring defeasible causality pairs, namely, cause-effect pairs accompanied by supporters and defeaters. We further show that current causal strength metrics fail to reflect the change of causal strength with the incorporation of supporters or defeaters inğ›¿-CAUSAL. To this end, we propose CESAR (Causal Embedding aSsociation with Attention Rating), a metric that measures causal strength based on token-level causal relationships. CESAR achieves a significant 69.7% relative improvement over existing metrics, increasing from 47.2% to 80.1% in capturing the causal strength change brought by supporters and defeaters. We further demonstrate even Large Language Models (LLMs) like GPT-3.5 still lag 4.5 and 10.7 points behind humans in generating supporters and defeaters, emphasizing the challenge posed byğ›¿-CAUSAL.",
  "keywords": [
    "work",
    "existing causal strength metrics",
    "end",
    "language",
    "even large language models",
    "metric",
    "metrics",
    "token",
    "gpt-3",
    "attention",
    "we",
    "current causal strength metrics",
    "existing metrics",
    "current",
    "cesar causal embedding association"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.384/",
  "provenance": {
    "collected_at": "2025-06-05 10:53:51",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}