{
  "id": "2024.acl-tutorials.1",
  "title": "Computational Linguistics for Brain Encoding and Decoding: Principles, Practices and Beyond",
  "authors": [
    "Sun, Jingyuan  and\nWang, Shaonan  and\nChen, Zijiao  and\nLi, Jixing  and\nMoens, Marie-Francine"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 5: Tutorial Abstracts)",
  "abstract": "Computational linguistics (CL) has witnessed tremendous advancements in recent years, with models such as large language models demonstrating exceptional performance in various natural language processing tasks. These advancements highlight their potential to help understand brain language processing, especially through the lens of brain encoding and decoding. Brain encoding involves the mapping of linguistic stimuli to brain activity, while brain decoding is the process of reconstructing linguistic stimuli from observed brain activities. CL models that excel at capturing and manipulating linguistic features are crucial for mapping linguistic stimuli to brain activities and vice versa. Brain encoding and decoding have vast applications, from enhancing human-computer interaction to developing assistive technologies for individuals with communication impairments. This tutorial will focus on elucidating how computational linguistics can facilitate brain encoding and decoding. We will delve into the principles and practices of using computational linguistics methods for brain encoding and decoding. We will also discuss the challenges and future directions of brain encoding and decoding. Through this tutorial, we aim to provide a comprehensive and informative overview of the intersection between computational linguistics and cognitive neuroscience, inspiring future research in this exciting and rapidly evolving field.",
  "keywords": [
    "field",
    "cognitive neuroscience",
    "overview",
    "we",
    "brain activities",
    "natural",
    "technologies",
    "processing",
    "neuroscience",
    "observed brain activities",
    "versa",
    "activities",
    "process",
    "language",
    "human"
  ],
  "url": "https://aclanthology.org/2024.acl-tutorials.1/",
  "provenance": {
    "collected_at": "2025-06-05 10:48:29",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}