{
  "id": "2024.sigturk-1.5",
  "title": "Do {LLM}s Recognize me, When {I} is not me: Assessment of {LLM}s Understanding of {T}urkish Indexical Pronouns in Indexical Shift Contexts",
  "authors": [
    "O{\\u{g}}uz, Metehan  and\nCiftci, Yusuf  and\nBakman, Yavuz Faruk"
  ],
  "year": "2024",
  "venue": "Proceedings of the First Workshop on Natural Language Processing for Turkic Languages (SIGTURK 2024)",
  "abstract": "Large language models (LLMs) have shown impressive capabilities in tasks such as machine translation, text summarization, question answering, and solving complex mathematical problems. However, their primary training on data-rich languages like English limits their performance in low-resource languages. This study addresses this gap by focusing on the Indexical Shift problem in Turkish. The Indexical Shift problem involves resolving pronouns in indexical shift contexts, a grammatical challenge not present in high-resource languages like English. We present the first study examining indexical shift in any language, releasing a Turkish dataset specifically designed for this purpose. Our Indexical Shift Dataset consists of 156 multiple-choice questions, each annotated with necessary linguistic details, to evaluate LLMs in a few-shot setting. We evaluate recent multilingual LLMs, including GPT-4, GPT-3.5, Cohere-AYA, Trendyol-LLM, and Turkcell-LLM, using this dataset. Our analysis reveals that even advanced models like GPT-4 struggle with the grammatical nuances of indexical shift in Turkish, achieving only moderate performance. These findings underscore the need for focused research on the grammatical challenges posed by low-resource languages. We released the dataset and code here.",
  "keywords": [
    "t",
    "code",
    "question",
    "summarization",
    "we",
    "llm s understanding",
    "llm",
    "shot",
    "training",
    "translation",
    "recent multilingual llms",
    "a few-shot setting",
    "rich",
    "impressive capabilities",
    "analysis"
  ],
  "url": "https://aclanthology.org/2024.sigturk-1.5/",
  "provenance": {
    "collected_at": "2025-06-05 11:10:22",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}