{
  "id": "2024.acl-long.50",
  "title": "V}isual{W}eb{A}rena: Evaluating Multimodal Agents on Realistic Visual Web Tasks",
  "authors": [
    "Koh, Jing Yu  and\nLo, Robert  and\nJang, Lawrence  and\nDuvvur, Vikram  and\nLim, Ming  and\nHuang, Po-Yu  and\nNeubig, Graham  and\nZhou, Shuyan  and\nSalakhutdinov, Russ  and\nFried, Daniel"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Autonomous agents capable of planning, reasoning, and executing actions on the web offer a promising avenue for automating computer tasks. However, the majority of existing benchmarks primarily focus on text-based agents, neglecting many natural tasks that require visual information to effectively solve. Given that most computer interfaces cater to human perception, visual information often augments textual data in ways that text-only models struggle to harness effectively. To bridge this gap, we introduce VisualWebArena, a benchmark designed to assess the performance of multimodal web agents on *realistic visually grounded tasks*. VisualWebArena comprises of a set of diverse and complex web-based tasks that evaluate various capabilities of autonomous multimodal agents. To perform on this benchmark, agents need to accurately process image-text inputs, interpret natural language instructions, and execute actions on websites to accomplish user-defined objectives. We conduct an extensive evaluation of state-of-the-art LLM-based autonomous agents, including several multimodal models. Through extensive quantitative and qualitative analysis, we identify several limitations of text-only LLM agents, and reveal gaps in the capabilities of state-of-the-art multimodal language agents. VisualWebArena provides a framework for evaluating multimodal autonomous language agents, and offers insights towards building stronger autonomous agents for the web.",
  "keywords": [
    "objectives",
    "isual",
    "we",
    "various capabilities",
    "llm",
    "natural",
    "information",
    "the capabilities",
    "visual",
    "user-defined objectives",
    "analysis",
    "text",
    "an extensive evaluation",
    "language",
    "human"
  ],
  "url": "https://aclanthology.org/2024.acl-long.50/",
  "provenance": {
    "collected_at": "2025-06-05 10:34:58",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}