{
  "id": "2024.argmining-1",
  "title": "ARIES}: A General Benchmark for Argument Relation Identification",
  "authors": [
    "Gemechu, Debela  and\nRuiz-Dolz, Ramon  and\nReed, Chris"
  ],
  "year": "2024",
  "venue": "Proceedings of the 11th Workshop on Argument Mining (ArgMining 2024)",
  "abstract": "Measuring advances in argument mining is one of the main challenges in the area. Different theories of argument, heterogeneous annotations, and a varied set of argumentation domains make it difficult to contextualise and understand the results reported in different work from a general perspective. In this paper, we present ARIES, a general benchmark for Argument Relation Identification aimed at providing with a standard evaluation for argument mining research. ARIES covers the three different language modelling approaches: sequence and token modelling, and sequence-to-sequence-to-sequence alignment, together with the three main Transformer-based model architectures: encoder-only, decoder-only, and encoder-decoder. Furthermore, the benchmark consists of eight different argument mining datasets, covering the most common argumentation domains, and standardised with the same annotation structures. This paper provides a first comprehensive and comparative set of results in argument mining across a broad range of configurations to compare with, both advancing the state-of-the-art, and establishing a standard way to measure future advances in the area. Across varied task setups and architectures, our experiments reveal consistent challenges in cross-dataset evaluation, with notably poor results. Given the models’ struggle to acquire transferable skills, the task remains challenging, opening avenues for future research.",
  "keywords": [
    "varied",
    "theories",
    "a general benchmark",
    "we",
    "cross",
    "a varied set",
    "it",
    "decoder",
    "sequence",
    "a general perspective",
    "different theories",
    "a standard evaluation",
    "cross-dataset evaluation",
    "mining",
    "work"
  ],
  "url": "https://aclanthology.org/2024.argmining-1.1/",
  "provenance": {
    "collected_at": "2025-06-05 11:03:38",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}