{
  "id": "2024.findings-acl.823",
  "title": "M}ulti{SQL}: A Schema-Integrated Context-Dependent {T}ext2{SQL} Dataset with Diverse {SQL} Operations",
  "authors": [
    "Li, Chunhui  and\nWang, Yifan  and\nWu, Zhen  and\nYu, Zhen  and\nZhao, Fei  and\nHuang, Shujian  and\nDai, Xinyu"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Text2SQL is a task that translates natural language into SQL statements. Context-dependent Text2SQL offers a more natural database interaction by simulating dialogues between users and databases, with CoSQL and SparC as representative datasets. Yet, these datasets struggle to accurately replicate real-world situations. To address this, we introduce MultiSQL, which extends them in three key aspects: (1) Diverse SQL Operations. We incorporate diverse SQL types such as Create, Update, and Insert to broaden the scope of SQL operations. (2) Schema-Integrated Context. We integrated query context with database schema dependencies to better depict database complexity. (3) Extended Dialogues. We expand dialogue length to better simulate long conversations and complex interactions. This multi-type, schema-integrated, context-dependent Text2SQL dataset comprises nearly 800 dialogue groups and over 9,000 interaction turns across 166 complex databases, offering a better benchmark for interactive user-database dialogue.Addressing MultiSQL’s challenges, we refined evaluation metrics to better capture diverse SQL types and schema dependencies. We designed a prompt framework that leverages historical data and self-refinement to accurately capture the dependency between text queries and database structures. Experiments with GPT-3.5, GPT-4, and LLaMA2-7B show both the effectiveness of our strategies and the challenges of MultiSQL. The datasets is available at https://github.com/grandchicken/MultiSQL.",
  "keywords": [
    "gpt-3 5 gpt-4",
    "conversations",
    "we",
    "dialogue",
    "natural",
    "queries",
    "self",
    "nearly 800 dialogue groups",
    "dependencies",
    "gpt-3",
    "long conversations",
    "natural language",
    "m",
    "a prompt framework",
    "prompt"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.823/",
  "provenance": {
    "collected_at": "2025-06-05 10:59:49",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}