{
  "id": "2024.acl-long.417",
  "title": "STICKERCONV}: Generating Multimodal Empathetic Responses from Scratch",
  "authors": [
    "Zhang, Yiqun  and\nKong, Fanheng  and\nWang, Peidong  and\nSun, Shuang  and\nSWangLing, SWangLing  and\nFeng, Shi  and\nWang, Daling  and\nZhang, Yifei  and\nSong, Kaisong"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Stickers, while widely recognized for enhancing empathetic communication in online interactions, remain underexplored in current empathetic dialogue research, notably due to the challenge of a lack of comprehensive datasets. In this paper, we introduce the Agent for STICKERCONV (Agent4SC), which uses collaborative agent interactions to realistically simulate human behavior with sticker usage, thereby enhancing multimodal empathetic communication. Building on this foundation, we develop a multimodal empathetic dialogue dataset, STICKERCONV, comprising 12.9K dialogue sessions, 5.8K unique stickers, and 2K diverse conversational scenarios. This dataset serves as a benchmark for multimodal empathetic generation. To advance further, we propose PErceive and Generate Stickers (PEGS), a multimodal empathetic response generation framework, complemented by a comprehensive set of empathy evaluation metrics based on LLM. Our experiments demonstrate PEGS’s effectiveness in generating contextually relevant and emotionally resonant multimodal empathetic responses, contributing to the advancement of more nuanced and engaging empathetic dialogue systems.",
  "keywords": [
    "we",
    "dialogue",
    "multimodal empathetic generation",
    "stickerconv generating",
    "current",
    "empathy evaluation metrics",
    "current empathetic dialogue research",
    "empathetic dialogue systems",
    "metrics",
    "perceive and generate stickers",
    "generating",
    "generation",
    "human",
    "conversational",
    "evaluation"
  ],
  "url": "https://aclanthology.org/2024.acl-long.417/",
  "provenance": {
    "collected_at": "2025-06-05 10:40:02",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}