{
  "id": "2024.findings-acl.405",
  "title": "ETAS}: Zero-Shot Transformer Architecture Search via Network Trainability and Expressivity",
  "authors": [
    "Yang, Jiechao  and\nLiu, Yong"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Transformer Architecture Search (TAS) methods aim to automate searching for the optimal Transformer architecture configurations for a given task. However, they are impeded by the prohibitive cost of evaluating Transformer architectures. Recently, several Zero-Shot TAS methods have been proposed to mitigate this problem by utilizing zero-cost proxies to evaluate Transformer architectures without training. Unfortunately, they are limited to specific computer vision or natural language processing tasks. Nonetheless, most of them are developed based on empirical observations and lack theoretical guarantees. To solve this problem, we develop a new zero-cost proxy called NTSR that combines two theoretically-inspired indicators to measure the trainability and expressivity of Transformer networks separately. We then integrate it into an effective regularized evolution framework called ETAS to demonstrate its efficacy on various tasks. The results show that our proposed NTSR proxy can consistently achieve a higher correlation with the true performance of Transformer networks on both computer vision and natural language processing tasks. Further, it can significantly accelerate the search process for finding the best-performing Transformer architecture configurations.",
  "keywords": [
    "transformer",
    "transformer networks",
    "processing",
    "process",
    "language",
    "natural",
    "natural language processing tasks",
    "it",
    "several zero-shot tas methods",
    "transformer architectures",
    "proxies",
    "network",
    "we",
    "zero-cost proxies",
    "shot"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.405/",
  "provenance": {
    "collected_at": "2025-06-05 10:54:08",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}