{
  "id": "2024.acl-long.63",
  "title": "C}on{S}i{DERS}-The-Human Evaluation Framework: Rethinking Human Evaluation for Generative Large Language Models",
  "authors": [
    "Elangovan, Aparna  and\nLiu, Ling  and\nXu, Lei  and\nBodapati, Sravan Babu  and\nRoth, Dan"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "In this position paper, we argue that human evaluation of generative large language models (LLMs) should be a multidisciplinary undertaking that draws upon the insights from disciplines such as user experience research and human behavioral psychology to ensure that the experimental design and results are reliable. The conclusions from these evaluations, therefore, must consider factors such as usability, aesthetics and cognitive biases. We highlight how cognitive biases can conflate fluent information and truthfulness, and how cognitive uncertainty affects the reliability of rating scores such as Likert. Furthermore, the evaluation should differentiate the capabilities and weaknesses of increasingly powerful large language models - which requires effective test sets. Scalability of human evaluation is also crucial to wider adoption. Hence, to design an effective human evaluation system in the age of generative NLP we propose the ConSiDERS-The-Human evaluation framework consisting of 6 pillars - Consistency, Scoring Criteria, Differentiating, User Experience, Responsible, and Scalability.",
  "keywords": [
    "how cognitive biases",
    "generative large language models",
    "we",
    "generative nlp",
    "human evaluation",
    "information",
    "the capabilities",
    "llms",
    "generative",
    "i",
    "s",
    "the considers-the-human evaluation framework",
    "these evaluations",
    "experience",
    "age"
  ],
  "url": "https://aclanthology.org/2024.acl-long.63/",
  "provenance": {
    "collected_at": "2025-06-05 10:35:09",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}