{
  "id": "2024.acl-srw.10",
  "title": "Document Alignment based on Overlapping Fixed-Length Segments",
  "authors": [
    "Wang, Xiaotian  and\nUtsuro, Takehito  and\nNagata, Masaaki"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 4: Student Research Workshop)",
  "abstract": "Acquiring large-scale parallel corpora is crucial for NLP tasks such asNeural Machine Translation, and web crawling has become a popularmethodology for this purpose. Previous studies have been conductedbased on sentence-based segmentation (SBS) when aligning documents invarious languages which are obtained through web crawling. Among them,the TK-PERT method (Thompson and Koehn, 2020) achieved state-of-the-artresults and addressed the boilerplate text in web crawling data wellthrough a down-weighting approach. However, there remains a problemwith how to handle long-text encoding better. Thus, we introduce thestrategy of Overlapping Fixed-Length Segmentation (OFLS) in place ofSBS, and observe a pronounced enhancement when performing the sameapproach for document alignment. In this paper, we compare the SBS andOFLS using three previous methods, Mean-Pool, TK-PERT (Thompson andKoehn, 2020), and Optimal Transport (Clark et al., 2019; El- Kishky andGuzman, 2020), on the WMT16 document alignment shared task forFrench-English, as well as on our self-established Japanese-Englishdataset MnRN. As a result, for the WMT16 task, various SBS basedmethods showed an increase in recall by 1% to 10% after reproductionwith OFLS. For MnRN data, OFLS demonstrated notable accuracyimprovements and exhibited faster document embedding speed.",
  "keywords": [
    "notable accuracyimprovements",
    "we",
    "translation",
    "self",
    "nlp tasks",
    "previous studies",
    "text",
    "document alignment",
    "the wmt16 document alignment",
    "accuracyimprovements",
    "alignment",
    "recall",
    "nlp",
    "machine",
    "studies"
  ],
  "url": "https://aclanthology.org/2024.acl-srw.10/",
  "provenance": {
    "collected_at": "2025-06-05 10:47:54",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}