{
  "id": "2024.acl-long.520",
  "title": "Beyond Recognising Entailment: Formalising Natural Language Inference from an Argumentative Perspective",
  "authors": [
    "Saadat-Yazdi, Ameer  and\nK{\\\"o}kciyan, Nadin"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "In argumentation theory, argument schemes are a characterisation of stereotypical patterns of inference. There has been little work done to develop computational approaches to identify these schemes in natural language. Moreover, advancements in recognizing textual entailment lack a standardized definition of inference, which makes it challenging to compare methods trained on different datasets and rely on the generalisability of their results. In this work, we propose a rigorous approach to align entailment recognition with argumentation theory. Wagemans’ Periodic Table of Arguments (PTA), a taxonomy of argument schemes, provides the appropriate framework to unify these two fields. To operationalise the theoretical model, we introduce a tool to assist humans in annotating arguments according to the PTA. Beyond providing insights into non-expert annotator training, we present Kialo-PTA24, the first multi-topic dataset for the PTA. Finally, we benchmark the performance of pre-trained language models on various aspects of argument analysis. Our experiments show that the task of argument canonicalisation poses a significant challenge for state-of-the-art models, suggesting an inability to represent argumentative reasoning and a direction for future investigation.",
  "keywords": [
    "the generalisability",
    "these two fields",
    "we",
    "fields",
    "training",
    "pre-trained language models",
    "natural",
    "it",
    "natural language",
    "analysis",
    "topic",
    "work",
    "language",
    "generalisability",
    "model"
  ],
  "url": "https://aclanthology.org/2024.acl-long.520/",
  "provenance": {
    "collected_at": "2025-06-05 10:41:28",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}