{
  "id": "2024.findings-acl.646",
  "title": "Efficiently Exploring Large Language Models for Document-Level Machine Translation with In-context Learning",
  "authors": [
    "Cui, Menglong  and\nDu, Jiangcun  and\nZhu, Shaolin  and\nXiong, Deyi"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Large language models (LLMs) exhibit outstanding performance in machine translation via in-context learning. In contrast to sentence-level translation, document-level translation (DOCMT) by LLMs based on in-context learning faces two major challenges: firstly, document translations generated by LLMs are often incoherent; secondly, the length of demonstration for in-context learning is usually limited. To address these issues, we propose a Context-Aware Prompting method (CAP), which enables LLMs to generate more accurate, cohesive, and coherent translations via in-context learning. CAP takes into account multi-level attention, selects the most relevant sentences to the current one as context, and then generates a summary from these collected sentences. Subsequently, sentences most similar to the summary are retrieved from the datastore as demonstrations, which effectively guide LLMs in generating cohesive and coherent translations. We conduct extensive experiments across various DOCMT tasks, and the results demonstrate the effectiveness of our approach, particularly in zero pronoun translation (ZPT) and literary translation tasks.",
  "keywords": [
    "document-level machine translation",
    "language",
    "machine",
    "zero pronoun translation zpt",
    "large language models",
    "machine translation",
    "firstly document translations",
    "attention",
    "we",
    "learning",
    "translations",
    "literary translation tasks",
    "current",
    "account multi-level attention",
    "cohesive and coherent translations"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.646/",
  "provenance": {
    "collected_at": "2025-06-05 10:57:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}