{
  "id": "2024.acl-long.206",
  "title": "M}ental{M}anip: A Dataset For Fine-grained Analysis of Mental Manipulation in Conversations",
  "authors": [
    "Wang, Yuxin  and\nYang, Ivory  and\nHassanpour, Saeed  and\nVosoughi, Soroush"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Mental manipulation, a significant form of abuse in interpersonal conversations, presents a challenge to identify due to its context-dependent and often subtle nature. The detection of manipulative language is essential for protecting potential victims, yet the field of Natural Language Processing (NLP) currently faces a scarcity of resources and research on this topic. Our study addresses this gap by introducing a new dataset, namedMentalManip, which consists of 4,000 annotated fictional dialogues. This dataset enables a comprehensive analysis of mental manipulation, pinpointing both the techniques utilized for manipulation and the vulnerabilities targeted in victims. Our research further explores the effectiveness of leading-edge models in recognizing manipulative dialogue and its components through a series of experiments with various configurations. The results demonstrate that these models inadequately identify and categorize manipulative content. Attempts to improve their performance by fine-tuning with existing datasets on mental health and toxicity have not overcome these limitations. We anticipate thatMentalManipwill stimulate further research, leading to progress in both understanding and mitigating the impact of mental manipulation in conversations.",
  "keywords": [
    "conversations",
    "field",
    "series",
    "form",
    "we",
    "the vulnerabilities",
    "dialogue",
    "manipulative dialogue",
    "natural language processing nlp",
    "fine-tuning",
    "edge",
    "natural",
    "the field",
    "conversations mental manipulation",
    "analysis"
  ],
  "url": "https://aclanthology.org/2024.acl-long.206/",
  "provenance": {
    "collected_at": "2025-06-05 10:37:07",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}