{
  "id": "2024.findings-acl.311",
  "title": "SDA}: Semantic Discrepancy Alignment for Text-conditioned Image Retrieval",
  "authors": [
    "Yang, Yuchen  and\nWang, Yu  and\nWang, Yanfeng"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "In the realm of text-conditioned image retrieval, models utilize a query composed of a reference image and modification text to retrieve corresponding images. Despite its significance, this task is fraught with challenges, including small-scale datasets due to labeling costs and the complexity of attributes in modification texts. These challenges often result in models learning a generalized representation of the query, thereby missing the semantic correlations of image and text attributes.In this paper, we introduce a general boosting framework designed to address these issues by employing semantic discrepancy alignment. Our framework first leverages the ChatGPT to augment text data by modifying the original modification text’s attributes. The augmented text is then combined with the original reference image to create an augmented composed query. Then we generate corresponding images using GPT-4 for the augmented composed query.We realize the cross-modal semantic discrepancy alignment by formulating distance consistency and neighbor consistency between the image and text domains. Through this novel approach, attribute in the text domain can be more effectively transferred to the image domain, enhancing retrieval performance. Extensive experiments on three prominent datasets validate the effectiveness of our approach, with state-of-the-art results on a majority of evaluation metrics compared to various baseline methods.",
  "keywords": [
    "generalized",
    "semantic",
    "we",
    "cross",
    "text-conditioned image retrieval",
    "retrieval",
    "chatgpt",
    "semantic discrepancy alignment",
    "a generalized representation",
    "text",
    "metrics",
    "a general boosting framework",
    "gpt-4",
    "evaluation metrics",
    "the chatgpt"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.311/",
  "provenance": {
    "collected_at": "2025-06-05 10:52:51",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}