{
  "id": "2024.acl-demos.17",
  "title": "IMGTB}: A Framework for Machine-Generated Text Detection Benchmarking",
  "authors": [
    "Spiegel, Michal  and\nMacko, Dominik"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 3: System Demonstrations)",
  "abstract": "In the era of large language models generating high quality texts, it is a necessity to develop methods for detection of machine-generated text to avoid their harmful use or simply for annotation purposes. It is, however, also important to properly evaluate and compare such developed methods. Recently, a few benchmarks have been proposed for this purpose; however, integration of newest detection methods is rather challenging, since new methods appear each month and provide slightly different evaluation pipelines.In this paper, we present the IMGTB framework, which simplifies the benchmarking of machine-generated text detection methods by easy integration of custom (new) methods and evaluation datasets. In comparison to existing frameworks, it enables to objectively compare statistical metric-based zero-shot detectors with classification-based detectors and with differently fine-tuned detectors. Its configurability and flexibility makes research and development of new detection methods easier, especially their comparison to the existing state-of-the-art detectors. The default set of analyses, metrics and visualizations offered by the tool follows the established practices of machine-generated text detection benchmarking found in state-of-the-art literature.",
  "keywords": [
    "analyses metrics",
    "era",
    "we",
    "shot",
    "classification",
    "it",
    "machine-generated text",
    "classification-based detectors",
    "machine-generated text detection",
    "evaluation datasets",
    "metric",
    "text",
    "metrics",
    "machine-generated text detection methods",
    "easier"
  ],
  "url": "https://aclanthology.org/2024.acl-demos.17/",
  "provenance": {
    "collected_at": "2025-06-05 10:47:30",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}