{
  "id": "2024.loresmt-1.10",
  "title": "Super donors and super recipients: Studying cross-lingual transfer between high-resource and low-resource languages",
  "authors": [
    "Protasov, Vitaly  and\nStakovskii, Elisei  and\nVoloshina, Ekaterina  and\nShavrina, Tatiana  and\nPanchenko, Alexander"
  ],
  "year": "2024",
  "venue": "Proceedings of the Seventh Workshop on Technologies for Machine Translation of Low-Resource Languages (LoResMT 2024)",
  "abstract": "Despite the increasing popularity of multilingualism within the NLP community, numerous languages continue to be underrepresented due to the lack of available resources.Our work addresses this gap by introducing experiments on cross-lingual transfer between 158 high-resource (HR) and 31 low-resource (LR) languages.We mainly focus on extremely LR languages, some of which are first presented in research works.Across158*31HR–LR language pairs, we investigate how continued pretraining on different HR languages affects the mT5 model’s performance in representing LR languages in the LM setup.Our findings surprisingly reveal that the optimal language pairs with improved performance do not necessarily align with direct linguistic motivations, with subtoken overlap playing a more crucial role. Our investigation indicates that specific languages tend to be almost universally beneficial for pretraining (super donors), while others benefit from pretraining with almost any language (super recipients). This pattern recurs in various setups and is unrelated to the linguistic similarity of HR-LR pairs.Furthermore, we perform evaluation on two downstream tasks, part-of-speech (POS) tagging and machine translation (MT), showing how HR pretraining affects LR language performance.",
  "keywords": [
    "super recipients",
    "recipients",
    "the nlp community",
    "we",
    "translation",
    "cross",
    "transfer",
    "pos",
    "work",
    "language",
    "nlp",
    "model",
    "machine",
    "tagging",
    "evaluation"
  ],
  "url": "https://aclanthology.org/2024.loresmt-1.10/",
  "provenance": {
    "collected_at": "2025-06-05 11:08:13",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}