{
  "id": "2024.climatenlp-1.12",
  "title": "Challenges in End-to-End Policy Extraction from Climate Action Plans",
  "authors": [
    "Gandhi, Nupoor  and\nCorringham, Tom  and\nStrubell, Emma"
  ],
  "year": "2024",
  "venue": "Proceedings of the 1st Workshop on Natural Language Processing Meets Climate Change (ClimateNLP 2024)",
  "abstract": "Gray policy literature such as climate action plans (CAPs) provide an information-rich resource with potential to inform analysis and decision-making. However, these corpora are currently underutilized due to the substantial manual effort and expertise required to sift through long and detailed documents. Automatically structuring relevant information using information extraction (IE) would be useful for assisting policy scientists in synthesizing vast gray policy corpora to identify relevant entities, concepts and themes. LLMs have demonstrated strong performance on IE tasks in the few-shot setting, but it is unclear whether these gains transfer to gray policy literature which differs significantly to traditional benchmark datasets in several aspects, such as format of information content, length of documents, and inconsistency of document structure. We perform a case study on end-to-end IE with California CAPs, inspecting the performance of state-of-the-art tools for: (1) extracting content from CAPs into structured markup segments; (2) few-shot IE with LLMs; and (3) the utility of extracted entities for downstream analyses. We identify challenges at several points of the end-to-end IE pipeline for CAPs, and we provide recommendations for open problems centered around representing rich non-textual elements, document structure, flexible annotation schemes, and global information. Tackling these challenges would make it possible to realize the potential of LLMs for IE with gray policy literature.",
  "keywords": [
    "end",
    "extracted entities",
    "extraction",
    "policy scientists",
    "we",
    "shot",
    "it",
    "the end-to-end ie pipeline",
    "information",
    "format",
    "relevant entities concepts",
    "rich",
    "analysis",
    "themes llms",
    "llms"
  ],
  "url": "https://aclanthology.org/2024.climatenlp-1.12/",
  "provenance": {
    "collected_at": "2025-06-05 11:05:18",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}