{
  "id": "2024.c3nlp-1.1",
  "title": "CDE}val: A Benchmark for Measuring the Cultural Dimensions of Large Language Models",
  "authors": [
    "Wang, Yuhang  and\nZhu, Yanxu  and\nKong, Chao  and\nWei, Shuyu  and\nYi, Xiaoyuan  and\nXie, Xing  and\nSang, Jitao"
  ],
  "year": "2024",
  "venue": "Proceedings of the 2nd Workshop on Cross-Cultural Considerations in NLP",
  "abstract": "As the scaling of Large Language Models (LLMs) has dramatically enhanced their capabilities, there has been a growing focus on the alignment problem to ensure their responsible and ethical use. While existing alignment efforts predominantly concentrate on universal values such as the HHH principle, the aspect of culture, which is inherently pluralistic and diverse, has not received adequate attention. This work introduces a new benchmark, CDEval, aimed at evaluating the cultural dimensions of LLMs. CDEval is constructed by incorporating both GPT-4’s automated generation and human verification, covering six cultural dimensions across seven domains. Our comprehensive experiments provide intriguing insights into the culture of mainstream LLMs, highlighting both consistencies and variations across different dimensions and domains. The findings underscore the importance of integrating cultural considerations in LLM development, particularly for applications in diverse cultural settings. This benchmark serves as a valuable resource for cultural studies in LLMs, paving the way for more culturally aware and sensitive models.",
  "keywords": [
    "llm development",
    "llm",
    "val",
    "both gpt-4",
    "both consistencies",
    "mainstream llms",
    "consistencies",
    "llms",
    "large language models llms",
    "gpt-4",
    "cultural studies",
    "their capabilities",
    "work",
    "alignment",
    "language"
  ],
  "url": "https://aclanthology.org/2024.c3nlp-1.1/",
  "provenance": {
    "collected_at": "2025-06-05 11:05:01",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}