{
  "id": "2024.fieldmatters-1.3",
  "title": "User-Centered Design of Digital Tools for Sociolinguistic Studies in Under-Resourced Languages",
  "authors": [
    "Adler, Jonas  and\nScholle, Carsten  and\nBuschek, Daniel  and\nBrandizzi, Nicolo{'}  and\nAdnan, Muhadj"
  ],
  "year": "2024",
  "venue": "Proceedings of the 3rd Workshop on NLP Applications to Field Linguistics (Field Matters 2024)",
  "abstract": "Investigating language variation is a core aspect of sociolinguistics, especially through the use of linguistic corpora. Collecting and analyzing spoken language in text-based corpora can be time-consuming and error-prone, especially for under-resourced languages with limited software assistance. This paper explores the language variation research process using a User-Centered Design (UCD) approach from the field of Human-Computer Interaction (HCI), offering guidelines for the development of digital tools for sociolinguists. We interviewed four researchers, observed their workflows and software usage, and analyzed the data using Grounded Theory. This revealed key challenges in manual tasks, software assistance, and data management. Based on these insights, we identified a set of requirements that future tools should meet to be valuable for researchers in this domain. The paper concludes by proposing design concepts with sketches and prototypes based on the identified requirements. These concepts aim to guide the implementation of a fully functional, open-source tool. This work presents an interdisciplinary approach between sociolinguistics and HCI by emphasizing the practical aspects of research that are often overlooked.",
  "keywords": [
    "the identified requirements",
    "field",
    "we",
    "the field",
    "core",
    "text",
    "work",
    "sociolinguistic studies",
    "process",
    "language",
    "studies",
    "human",
    "time",
    "theory",
    "approach"
  ],
  "url": "https://aclanthology.org/2024.fieldmatters-1.3/",
  "provenance": {
    "collected_at": "2025-06-05 11:05:53",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}