{
  "id": "2024.knowllm-1.10",
  "title": "Beyond Probabilities: Unveiling the Misalignment in Evaluating Large Language Models",
  "authors": [
    "Lyu, Chenyang  and\nWu, Minghao  and\nAji, Alham"
  ],
  "year": "2024",
  "venue": "Proceedings of the 1st Workshop on Towards Knowledgeable Language Models (KnowLLM 2024)",
  "abstract": "Large Language Models (LLMs) have demonstrated remarkable capabilities across various applications, fundamentally reshaping the landscape of natural language processing (NLP) research. However, recent evaluation frameworks often rely on the output probabilities of LLMs for predictions, primarily due to computational constraints, diverging from real-world LLM usage scenarios. While widely employed, the efficacy of these probability-based evaluation strategies remains an open research question. This study aims to scrutinize the validity of such probability-based evaluation methods within the context of using LLMs for Multiple Choice Questions (MCQs), highlighting their inherent limitations. Our empirical investigation reveals that the prevalent probability-based evaluation method inadequately aligns with generation-based prediction. Furthermore, current evaluation frameworks typically assess LLMs through predictive tasks based on output probabilities rather than directly generating responses, owing to computational limitations. We illustrate that these probability-based approaches do not effectively correspond with generative predictions. The outcomes of our study can enhance the understanding of LLM evaluation methodologies and provide insights for future research in this domain.",
  "keywords": [
    "remarkable capabilities",
    "question",
    "we",
    "current",
    "llm",
    "misalignment",
    "natural",
    "generative predictions",
    "such probability-based evaluation methods",
    "llms",
    "generative",
    "the output probabilities",
    "processing",
    "llm evaluation methodologies",
    "recent evaluation frameworks"
  ],
  "url": "https://aclanthology.org/2024.knowllm-1.10/",
  "provenance": {
    "collected_at": "2025-06-05 11:07:29",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}