{
  "id": "2024.arabicnlp-1.38",
  "title": "S}emantic{C}uet{S}ync at {A}ra{F}in{NLP}2024: Classification of Cross-Dialect Intent in the Banking Domain using Transformers",
  "authors": [
    "Paran, Ashraful  and\nShohan, Symom  and\nHossain, Md.  and\nHossain, Jawad  and\nAhsan, Shawly  and\nHoque, Mohammed Moshiul"
  ],
  "year": "2024",
  "venue": "Proceedings of the Second Arabic Natural Language Processing Conference",
  "abstract": "Intention detection is a crucial aspect of natural language understanding (NLU), focusing on identifying the primary objective underlying user input. In this work, we present a transformer-based method that excels in determining the intent of Arabic text within the banking domain. We explored several machine learning (ML), deep learning (DL), and transformer-based models on an Arabic banking dataset for intent detection. Our findings underscore the challenges that traditional ML and DL models face in understanding the nuances of various Arabic dialects, leading to subpar performance in intent detection. However, the transformer-based methods, designed to tackle such complexities, significantly outperformed the other models in classifying intent across different Arabic dialects. Notably, the AraBERTv2 model achieved the highest micro F1 score of 82.08% in ArBanking77 dataset, a testament to its effectiveness in this context. This achievement, which contributed to our work being ranked 5thin the shared task, AraFinNLP2024, highlights the importance of developing models that can effectively handle the intricacies of Arabic language processing and intent detection.",
  "keywords": [
    "deep",
    "transformers",
    "intricacies",
    "we",
    "complexities",
    "classification",
    "cross",
    "natural",
    "the transformer-based methods",
    "the arabertv2 model",
    "the intricacies",
    "achievement",
    "learning",
    "natural language",
    "arabertv2"
  ],
  "url": "https://aclanthology.org/2024.arabicnlp-1.38/",
  "provenance": {
    "collected_at": "2025-06-05 11:02:42",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}