{
  "id": "2024.findings-acl.528",
  "title": "MEEL}: Multi-Modal Event Evolution Learning",
  "authors": [
    "Tao, Zhengwei  and\nJin, Zhi  and\nHuang, Junqiang  and\nChen, Xiancai  and\nBai, Xiaoying  and\nZhang, Yifan  and\nTao, Chongyang"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Multi-modal Event Reasoning (MMER) endeavors to endow machines with the ability to comprehend intricate event relations across diverse data modalities. MMER is fundamental and underlies a wide broad of applications. Despite extensive instruction fine-tuning, current multi-modal large language models still fall short in such ability. The disparity stems from that existing models are insufficient to capture underlying principles governing event evolution in various scenarios. In this paper, we introduce Multi-Modal Event Evolution Learning (MEEL) to enable the model to grasp the event evolution mechanism yielding advanced MMER ability. Specifically, we commence with the design of event diversification to gather seed events from a rich spectrum of scenarios. Subsequently, we employ ChatGPT to generate evolving graphs for these seed events. We propose an instruction encapsulation process that formulates the evolving graphs into instruction-tuning data, aligning the comprehension of event reasoning to humans. Finally, we observe that models trained in this way are still struggling to fully comprehend event evolution. In such a case, we propose the guiding discrimination strategy, in which models are trained to discriminate the improper evolution direction. We collect and curate a benchmark M-EV2 for MMER. Extensive experiments on M-EV2 validate the effectiveness of our approach, showcasing competitive performance in open-source multi-modal LLMs.",
  "keywords": [
    "open-source multi-modal llms",
    "we",
    "current",
    "instruction",
    "chatgpt",
    "rich",
    "diverse data modalities mmer",
    "m",
    "llms",
    "insufficient",
    "process",
    "language",
    "model",
    "modalities",
    "multi"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.528/",
  "provenance": {
    "collected_at": "2025-06-05 10:55:49",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}