{
  "id": "2024.findings-acl.335",
  "title": "On the Relationship Between {RNN} Hidden-State Vectors and Semantic Structures",
  "authors": [
    "Muskardin, Edi  and\nTappler, Martin  and\nPill, Ingo  and\nAichernig, Bernhard  and\nPock, Thomas"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "We examine the assumption that hidden-state vectors of recurrent neural networks (RNNs) tend to form clusters of semantically similar vectors, which we dub the clustering hypothesis. While this hypothesis has been assumed in RNN analyses in recent years, its validity has not been studied thoroughly on modern RNN architectures. We first consider RNNs that were trained to recognize regular languages. This enables us to draw on perfect ground-truth automata in our evaluation, against which we can compare the RNN’s accuracy and the distribution of the hidden-state vectors. Then, we consider context-free languages to examine if RNN states form clusters for more expressive languages.For our analysis, we fit (generalized) linear models to classify RNN states into automata states and we apply different unsupervised clustering techniques. With a new ambiguity score, derived from information entropy, we measure how well an abstraction function maps the hidden state vectors to abstract clusters. Our evaluation supports the validity of the clustering hypothesis for regular languages, especially if RNNs are well-trained, i.e., clustering techniques succeed in finding clusters of similar state vectors. However, the clustering accuracy decreases substantially for context-free languages. This suggests that clustering is not a reliable abstraction technique for RNNs used in tasks like natural language processing.",
  "keywords": [
    "the clustering hypothesis",
    "rnns",
    "semantic",
    "we",
    "neural",
    "natural",
    "generalized linear models",
    "e clustering techniques",
    "the rnn s accuracy",
    "information",
    "the hidden-state vectors",
    "natural language processing",
    "recurrent",
    "semantically similar vectors",
    "analysis"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.335/",
  "provenance": {
    "collected_at": "2025-06-05 10:53:11",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}