{
  "id": "2024.acl-long.721",
  "title": "S}$^2${GSL}: Incorporating Segment to Syntactic Enhanced Graph Structure Learning for Aspect-based Sentiment Analysis",
  "authors": [
    "Chen, Bingfeng  and\nOuyang, Qihan  and\nLuo, Yongqi  and\nXu, Boyan  and\nCai, Ruichu  and\nHao, Zhifeng"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Previous graph-based approaches in Aspect-based Sentiment Analysis(ABSA) have demonstrated impressive performance by utilizing graph neural networks and attention mechanisms to learn structures of static dependency trees and dynamic latent trees. However, incorporating both semantic and syntactic information simultaneously within complex global structures can introduce irrelevant contexts and syntactic dependencies during the process of graph structure learning, potentially resulting in inaccurate predictions. In order to address the issues above, we propose S2GSL, incorporating Segment to Syntactic enhanced Graph Structure Learning for ABSA. Specifically, S2GSL is featured with a segment-aware semantic graph learning and a syntax-based latent graph learning enabling the removal of irrelevant contexts and dependencies, respectively. We further propose a self-adaptive aggregation network that facilitates the fusion of two graph learning branches, thereby achieving complementarity across diverse structures. Experimental results on four benchmarks demonstrate the effectiveness of our framework.",
  "keywords": [
    "aspect-based sentiment analysis absa",
    "syntactic dependencies",
    "attention mechanisms",
    "semantic",
    "we",
    "graph",
    "fusion",
    "syntax",
    "neural",
    "self",
    "dependencies",
    "information",
    "latent",
    "learning",
    "analysis"
  ],
  "url": "https://aclanthology.org/2024.acl-long.721/",
  "provenance": {
    "collected_at": "2025-06-05 10:44:14",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}