{
  "id": "2024.sdp-1.11",
  "title": "An end-to-end entity recognition and disambiguation framework for identifying Author Affiliation from literature publications",
  "authors": [
    "Lin, Lianghong  and\nWenxixie-c@my.cityu.edu.hk, Wenxixie-c@my.cityu.edu.hk  and\nSpczili@speed-polyu.edu.hk, Spczili@speed-polyu.edu.hk  and\nHao, Tianyong"
  ],
  "year": "2024",
  "venue": "Proceedings of the Fourth Workshop on Scholarly Document Processing (SDP 2024)",
  "abstract": "Author affiliation information plays a key role in bibliometric analyses and is essential for evaluating studies. However, as author affiliation information has not been standardized, which leads to difficulties such as synonym ambiguity and incomplete data during automated processing. To address the challenge, this paper proposes an end-to-end entity recognition and disambiguation framework for identifying author affiliation from literature publications. For entity disambiguation, an algorithm combining word embedding and spatial embedding is presented considering that author affiliation texts often contain rich geographic information. The disambiguation algorithm utilizes the semantic information and geographic information, which effectively enhances entity recognition and disambiguation effect. In addition, the proposed framework facilitates the effective utilization of the extensive literature in the PubMed database for comprehensive bibliometric analysis. The experimental results verify the robustness and effectiveness of the algorithm.",
  "keywords": [
    "processing",
    "end",
    "the semantic information",
    "studies",
    "information",
    "rich",
    "semantic",
    "word",
    "difficulties",
    "entity",
    "analysis",
    "recognition",
    "synonym ambiguity",
    "disambiguation",
    "the experimental results"
  ],
  "url": "https://aclanthology.org/2024.sdp-1.11/",
  "provenance": {
    "collected_at": "2025-06-05 11:09:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}