{
  "id": "2024.findings-acl.529",
  "title": "LLM}-{REDIAL}: A Large-Scale Dataset for Conversational Recommender Systems Created from User Behaviors with {LLM}s",
  "authors": [
    "Liang, Tingting  and\nJin, Chenxin  and\nWang, Lingzhi  and\nFan, Wenqi  and\nXia, Congying  and\nChen, Kai  and\nYin, Yuyu"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "The large-scale conversational recommendation dataset is pivotal for the development of conversational recommender systems (CRS). Most existing CRS datasets suffers from the problems of data inextensibility and semantic inconsistency. To tackle these limitations and establish a benchmark in the conversational recommendation scenario, in this paper, we introduce the LLM-REDIAL dataset to facilitate the research in CRS. LLM-REDIAL is constructed by leveraging large language models (LLMs) to generate the high-quality dialogues. To provide the LLMs with detailed guidance, we integrate historical user behavior data with dialogue templates that are carefully designed through the combination of multiple pre-defined goals. LLM-REDIAL has two main advantages. First, it is the largest multi-domain CRS dataset which consists of 47.6k multi-turn dialogues with 482.6k utterances across 4 domains. Second, dialogue semantics and the users’ historical interaction information is highly consistent. Human evaluation are conducted to verify the quality of LLM-REDIAL. In addition, we evaluate the usability of advanced LLM-based models on LLM-REDIAL.",
  "keywords": [
    "second dialogue semantics",
    "conversational recommender systems",
    "the llms",
    "advanced llm-based models",
    "semantic",
    "we",
    "dialogue",
    "llm",
    "llm-redial",
    "semantics",
    "it",
    "information",
    "highly consistent human evaluation",
    "the conversational recommendation scenario",
    "llms"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.529/",
  "provenance": {
    "collected_at": "2025-06-05 10:55:50",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}