{
  "id": "2024.acl-demos.16",
  "title": "L}ingua{L}inked: Distributed Large Language Model Inference on Mobile Devices",
  "authors": [
    "Zhao, Junchen  and\nSong, Yurun  and\nLiu, Simeng  and\nHarris, Ian G.  and\nAbdu Jyothi, Sangeetha"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 3: System Demonstrations)",
  "abstract": "Deploying Large Language Models (LLMs) locally on mobile devices presents a significant challenge due to their extensive memory requirements. In this paper, we introduce LinguaLinked, a system for decentralized, distributed LLM inference on mobile devices. LinguaLinked enables collaborative execution of the inference task across multiple trusted devices and ensures data privacy by processing information locally. LinguaLinked uses three key strategies. First, an optimized model assignment technique segments LLMs and uses linear optimization to align segments with each device's capabilities. Second, an optimized data transmission mechanism ensures efficient and structured data flow between model segments while also maintaining the integrity of the original model structure. Finally, LinguaLinked incorporates a runtime load balancer that actively monitors and redistributes tasks among mobile devices to prevent bottlenecks, enhancing the system's overall efficiency and responsiveness. We demonstrate that LinguaLinked facilitates efficient LLM inference while maintaining consistent throughput and minimal latency through extensive testing across various mobile devices, from high-end to low-end Android devices.",
  "keywords": [
    "end",
    "efficient",
    "efficiency",
    "we",
    "llm",
    "linear optimization",
    "three key strategies",
    "large language model inference",
    "information",
    "llms",
    "strategies",
    "decentralized distributed llm inference",
    "language",
    "model",
    "large language models"
  ],
  "url": "https://aclanthology.org/2024.acl-demos.16/",
  "provenance": {
    "collected_at": "2025-06-05 10:47:29",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}