{
  "id": "2024.acl-long.302",
  "title": "Digital Socrates: Evaluating {LLM}s through Explanation Critiques",
  "authors": [
    "Gu, Yuling  and\nTafjord, Oyvind  and\nClark, Peter"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "While LLMs can provide reasoned explanations along with their answers, the nature and quality of those explanations are still poorly understood. In response, our goal is to define a detailed way of characterizing the explanation capabilities of modern models and to create a nuanced, interpretable explanation evaluation tool that can generate such characterizations automatically, without relying on expensive API calls or human annotations. Our approach is to (a) define the new task of explanation critiquing - identifying and categorizing any main flaw in an explanation and providing suggestions to address the flaw, (b) create a sizeable, human-verified dataset for this task, and (c) train an open-source, automatic critique model (called Digital Socrates) using this data. Through quantitative and qualitative analysis, we demonstrate how Digital Socrates is useful for revealing insights about student models by examining their reasoning chains, and how it can provide high-quality, nuanced, automatic evaluation of those model explanations for the first time. Digital Socrates thus fills an important gap in evaluation tools for understanding and improving the explanation behavior of models.",
  "keywords": [
    "we",
    "llm",
    "it",
    "c",
    "verified",
    "analysis",
    "llms",
    "evaluation tools",
    "s",
    "a sizeable human-verified dataset",
    "high-quality nuanced automatic evaluation",
    "model",
    "human",
    "capabilities",
    "evaluation"
  ],
  "url": "https://aclanthology.org/2024.acl-long.302/",
  "provenance": {
    "collected_at": "2025-06-05 10:38:27",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}