{
  "id": "2024.acl-srw.54",
  "title": "On the Interpretability of Deep Learning Models for Collaborative Argumentation Analysis in Classrooms",
  "authors": [
    "Wang, Deliang  and\nChen, Gaowei"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 4: Student Research Workshop)",
  "abstract": "Collaborative argumentation holds significant potential for enhancing students’ learning outcomes within classroom settings. Consequently, researchers have explored the application of artificial intelligence (AI) to automatically analyze argumentation in these contexts. Despite the remarkable performance of deep learning models in this task, their lack of interpretability poses a critical challenge, leading to teachers’ skepticism and limited utilization. To cultivate trust among teachers, this PhD thesis proposal aims to leverage explainable AI techniques to provide explanations for these deep learning models. Specifically, the study develops two deep learning models for automated analysis of argument moves (claim, evidence, and warrant) and specificity levels (low, medium, and high) within collaborative argumentation. To address the interpretability issue, four explainable AI methods are proposed: gradient sensitivity, gradient input, integrated gradient, and LIME. Computational experiments demonstrate the efficacy of these methods in elucidating model predictions by computing word contributions, with LIME delivering exceptional performance. Moreover, a quasi-experiment is designed to evaluate the impact of model explanations on user trust and knowledge, serving as a future study of this PhD proposal. By tackling the challenges of interpretability and trust, this PhD thesis proposal aims to contribute to fostering user trust in AI and facilitating the practical implementation of AI in educational contexts.",
  "keywords": [
    "deep",
    "two deep learning models",
    "word",
    "learning",
    "analysis",
    "-",
    "deep learning models",
    "knowledge",
    "ai",
    "model",
    "gradient",
    "these deep learning models",
    "significant potential",
    "low",
    "this phd proposal"
  ],
  "url": "https://aclanthology.org/2024.acl-srw.54/",
  "provenance": {
    "collected_at": "2025-06-05 10:48:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}