{
  "id": "2024.cmcl-1.19",
  "title": "Diachronic change in verb usage statistics predicts differences in sentence processing across the lifespan",
  "authors": [
    "Cain, Ellis  and\nRyskin, Rachel"
  ],
  "year": "2024",
  "venue": "Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics",
  "abstract": "Diachronic corpus analyses reveal that syntactic usage patterns change over time. Are these changes reflected in differences in language processing across the human lifespan? We use the attachment of with-prepositional phrases (PPs) as a case study for investigating this question: a with-PP can attach to a verb, describing an instrument with which to perform the action (e.g., Slice the cake [with a knife]), or to a direct object (DO), modifying the noun (e.g., Slice the cake [with the pink frosting]). The relative frequencies of the instrument and modifier constructions differ depending on the verb in the sentence — the ‘verb bias’. Using two diachronic corpora, Syntgram and CCOHA, we analyzed the co-occurrence statistics of 27 verbs and instrument vs. modifier with-PPs. Between the 1940s and the 2000s, some verbs were more instrument-biased (i.e., more likely to co-occur with with-PPs that attach to the verb than the DO) than others and co-occurrence patterns were more similar for temporally close decades, suggesting subtle diachronic changes in usage patterns. We collected sentence interpretation data probing with-PP attachment preferences in participants ranging in age from 25 to 75. Interpretations of globally ambiguous sentences (e.g., Pet the rabbit with the towel) differed depending on the verb (i.e., some verbs elicit more instrument than modifier interpretations of the PP than others and vice versa) and on the age of the participant. In particular, verbs which became less instrument-biased over time elicited more instrument interpretations among older adults than young adults, suggesting that variation in language comprehension can be in part predicted from the corpus statistics of the time periods that an individual experienced.",
  "keywords": [
    "bias",
    "question",
    "we",
    "language processing",
    "modifier with-pps",
    "pp",
    "biased",
    "modifier",
    "processing",
    "i",
    "object",
    "the verb bias",
    "age",
    "action",
    "the relative frequencies"
  ],
  "url": "https://aclanthology.org/2024.cmcl-1.19/",
  "provenance": {
    "collected_at": "2025-06-05 11:05:41",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}