{
  "id": "2024.knowledgenlp-1.3",
  "title": "Collecting High-quality Multi-modal Conversational Search Data for {E}-Commerce",
  "authors": [
    "Collins, Marcus  and\nRokhlenko, Oleg  and\nAgichtein, Eugene  and\nMalmasi, Shervin"
  ],
  "year": "2024",
  "venue": "Proceedings of the 3rd Workshop on Knowledge Augmented Methods for NLP",
  "abstract": "Continued improvement of conversational assistants in knowledge-rich domains like E-Commerce requires large volumes of realistic high-quality conversation data to power increasingly sophisticated large language model chatbots, dialogue managers, response rankers, and recommenders. The problem is exacerbated for multi-modal interactions in realistic conversational product search and recommendation. Here, an artificial sales agent must interact intelligently with a customer using both textual and visual information and incorporate results from external search systems, such as a product catalog. Yet, it remains an open question how to best crowd-source large-scale, naturalistic multi-modal dialogue and action data, required to train such an artificial agent. We describe our crowd-sourced task where one worker (the Buyer) plays the role of the customer, and another (the Seller) plays the role of the sales agent. We identify subtle interactions between one worker’s environment and their partner’s behavior mediated by workers’ word choice. We find that limiting information presented to the Buyer, both in their backstory and by the Seller, improves conversation quality. We also show how conversations are improved through minimal automated Seller “coaching”. While typed and spoken messages are slightly different, the differences are not as large as frequently assumed. We plan to release our platform code and the resulting dialogues to advance research on conversational search agents.",
  "keywords": [
    "code",
    "their partner s behavior",
    "conversations",
    "question",
    "we",
    "dialogue",
    "it",
    "the resulting dialogues",
    "realistic conversational product search",
    "information",
    "conversational assistants",
    "e",
    "realistic high-quality conversation data",
    "rich",
    "word"
  ],
  "url": "https://aclanthology.org/2024.knowledgenlp-1.3/",
  "provenance": {
    "collected_at": "2025-06-05 11:07:16",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}