{
  "id": "2024.gebnlp-1.22",
  "title": "Detecting and Mitigating {LGBTQIA}+ Bias in Large {N}orwegian Language Models",
  "authors": [
    "Bergstrand, Selma  and\nGamb{\\\"a}ck, Bj{\\\"o}rn"
  ],
  "year": "2024",
  "venue": "Proceedings of the 5th Workshop on Gender Bias in Natural Language Processing (GeBNLP)",
  "abstract": "The paper aims to detect and mitigate LGBTQIA+ bias in large language models (LLMs). As the usage of LLMs quickly increases, so does the significance of the harms they may cause due to bias. The research field of bias in LLMs has seen massive growth, but few attempts have been made to detect or mitigate other biases than gender bias, and most focus has been on English LLMs. This work shows experimentally that LLMs may cause representational harms towards LGBTQIA+ individuals when evaluated on sentence completion tasks and on a benchmark dataset constructed from stereotypes reported by the queer community of Norway, collected through a survey in order to directly involve the affected community. Furthermore, Norwegian training corpora are probed for queer bias, revealing strong associations between queer terms and anti-queer slurs, as well as words related to pedophilia. Finally, a fine-tuning-based debiasing method is applied to two Norwegian LLMs. This method does not consistently reduce bias, but shows that queer bias can be altered, laying the foundation for future debiasing approaches. By shedding light on the severe discrimination that can occur through the usage of LLMs, this paper contributes to the ongoing fight for equal rights for the LGBTQIA+ community.",
  "keywords": [
    "bias",
    "english llms",
    "field",
    "future debiasing approaches",
    "training",
    "llms",
    "lgbtqia bias",
    "tuning",
    "the research field",
    "fine",
    "anti",
    "biases",
    "work",
    "a fine-tuning-based debiasing method",
    "language"
  ],
  "url": "https://aclanthology.org/2024.gebnlp-1.22/",
  "provenance": {
    "collected_at": "2025-06-05 11:06:17",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}