{
  "id": "2024.acl-srw.36",
  "title": "Can {LLM}s Augment Low-Resource Reading Comprehension Datasets? Opportunities and Challenges",
  "authors": [
    "Samuel, Vinay  and\nAynaou, Houda  and\nChowdhury, Arijit  and\nVenkat Ramanan, Karthik  and\nChadha, Aman"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 4: Student Research Workshop)",
  "abstract": "Large Language Models (LLMs) have demonstrated impressive zero-shot performance on a wide range of NLP tasks, demonstrating the ability to reason and apply common sense. A relevant application is to use them for creating high-quality synthetic datasets for downstream tasks. In this work, we probe whether GPT-4 can be used to augment existing extractive reading comprehension datasets. Automating data annotation processes has the potential to save large amounts of time, money, and effort that goes into manually labeling datasets. In this paper, we evaluate the performance of GPT-4 as a replacement for human annotators for low-resource reading comprehension tasks, by comparing performance after fine-tuning, and the cost associated with annotation. This work serves to be the first analysis of LLMs as synthetic data augmenters for QA systems, highlighting the unique opportunities and challenges. Additionally, we release augmented versions of low-resource datasets, that will allow the research community to create further benchmarks for evaluation of generated datasets. Github available at https://github.com/vsamuel2003/qa-gpt4",
  "keywords": [
    "opportunities",
    "we",
    "llm",
    "shot",
    "fine-tuning",
    "nlp tasks",
    "analysis",
    "llms",
    "tuning",
    "the unique opportunities",
    "large language models llms",
    "gpt-4",
    "impressive zero-shot performance",
    "fine",
    "vsamuel2003 qa-gpt4"
  ],
  "url": "https://aclanthology.org/2024.acl-srw.36/",
  "provenance": {
    "collected_at": "2025-06-05 10:48:12",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}