{
  "id": "2024.iwslt-1.37",
  "title": "IWSLT} 2024 {I}ndic Track system description paper: Speech-to-Text Translation from {E}nglish to multiple Low-Resource {I}ndian Languages",
  "authors": [
    "Singh, Deepanjali  and\nAnand, Ayush  and\nChaturvedi, Abhyuday  and\nBaliyan, Niyati"
  ],
  "year": "2024",
  "venue": "Proceedings of the 21st International Conference on Spoken Language Translation (IWSLT 2024)",
  "abstract": "Our Speech-to-Text (ST) translation system addresses low-resource Indian languages (Hindi, Bengali, Tamil) by combining advanced transcription and translation models for accurate and efficient translations. The key components of the system are: The Audio Processor and Transcription Module which utilizes ResembleAI for noise reduction and OpenAI’s Whisper model for transcription. The Input Module validates and preprocesses audio files. The Translation Modules integrate the Helsinki-NLP model for English to Hindi translation and Facebook’s MBart model for English to Tamil and Bengali translations, fine-tuned for better quality. The Output Module corrects syntax and removes hallucinations, delivering the final translated text. For performance evaluation purpose, SacreBLEU scores were used and attained the following values: English-to-Hindi: 24.21 (baseline: 5.23); English-to-Bengali: 16.18 (baseline: 5.86); English-to-Tamil: 10.79 (baseline: 1.9). The solution streamlines workflow from input validation to output delivery, significantly enhancing communication across different linguistic contexts and achieving substantial improvements in SacreBLEU scores. Through the creation of dedicated datasets and the development of robust models, our aim is to facilitate seamless communication and accessibility across diverse linguistic communities, ultimately promoting inclusivity and empowerment.",
  "keywords": [
    "sacrebleu",
    "validation",
    "efficient",
    "communities",
    "the translation modules",
    "hindi translation",
    "syntax",
    "translation",
    "bengali translations",
    "reduction",
    "i",
    "the helsinki-nlp model",
    "translation models",
    "text",
    "diverse linguistic communities"
  ],
  "url": "https://aclanthology.org/2024.iwslt-1.37/",
  "provenance": {
    "collected_at": "2025-06-05 11:07:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}