{
  "id": "2024.findings-acl.340",
  "title": "M}u{T}ox: Universal {MU}ltilingual Audio-based {TOX}icity Dataset and Zero-shot Detector",
  "authors": [
    "Costa-juss{\\`a}, Marta  and\nMeglioli, Mariano  and\nAndrews, Pierre  and\nDale, David  and\nHansanti, Prangthip  and\nKalbassi, Elahe  and\nMourachko, Alexandre  and\nRopers, Christophe  and\nWood, Carleigh"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Research in toxicity detection in natural language processing for the speech modality (audio-based) is quite limited, particularly for languages other than English. To address these limitations and lay the groundwork for truly multilingual audio-based toxicity detection, we introduce MuTox, the first highly multilingual audio-based dataset with toxicity labels which covers 14 different linguistic families. The dataset comprises 20,000 audio utterances for English and Spanish, and 4,000 for the other 28 languages. To demonstrate the quality of this dataset, we trained the MuTox audio-based toxicity classifier, which enables zero-shot toxicity detection across a wide range of languages. This classifier performs on par with existing text-based trainable classifiers, while expanding the language coverage more than tenfold. When compared to a wordlist-based classifier that covers a similar number of languages, MuTox improves F1-Score by an average of 100%. This significant improvement underscores the potential of MuTox in advancing the field of audio-based toxicity detection.",
  "keywords": [
    "families",
    "classifier",
    "classifiers",
    "field",
    "we",
    "shot",
    "natural",
    "the field",
    "f1-score",
    "natural language processing",
    "zero-shot toxicity detection",
    "processing",
    "text",
    "par",
    "a wordlist-based classifier"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.340/",
  "provenance": {
    "collected_at": "2025-06-05 10:53:15",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}