{
  "id": "2024.sighan-1.13",
  "title": "ZZU}-{NLP} at {SIGHAN}-2024 dim{ABSA} Task: Aspect-Based Sentiment Analysis with Coarse-to-Fine In-context Learning",
  "authors": [
    "Zhu, Senbin  and\nZhao, Hanjie  and\nWxr, Wxr  and\n18437919080@163.com, 18437919080@163.com  and\nJia, Yuxiang  and\nZan, Hongying"
  ],
  "year": "2024",
  "venue": "Proceedings of the 10th SIGHAN Workshop on Chinese Language Processing (SIGHAN-10)",
  "abstract": "The DimABSA task requires fine-grained sentiment intensity prediction for restaurant reviews, including scores for Valence and Arousal dimensions for each Aspect Term. In this study, we propose a Coarse-to-Fine In-context Learning(CFICL) method based on the Baichuan2-7B model for the DimABSA task in the SIGHAN 2024 workshop. Our method improves prediction accuracy through a two-stage optimization process. In the first stage, we use fixed in-context examples and prompt templates to enhance the model’s sentiment recognition capability and provide initial predictions for the test data. In the second stage, we encode the Opinion field using BERT and select the most similar training data as new in-context examples based on similarity. These examples include the Opinion field and its scores, as well as related opinion words and their average scores. By filtering for sentiment polarity, we ensure that the examples are consistent with the test data. Our method significantly improves prediction accuracy and consistency by effectively utilizing training data and optimizing in-context examples, as validated by experimental results.",
  "keywords": [
    "prompt templates",
    "prediction accuracy",
    "field",
    "the opinion field",
    "we",
    "training",
    "restaurant reviews",
    "a two-stage optimization process",
    "analysis",
    "reviews",
    "prompt",
    "bert",
    "fine",
    "accuracy",
    "sentiment"
  ],
  "url": "https://aclanthology.org/2024.sighan-1.13/",
  "provenance": {
    "collected_at": "2025-06-05 11:10:11",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}