{
  "id": "2024.acl-long.528",
  "title": "Self-Modifying State Modeling for Simultaneous Machine Translation",
  "authors": [
    "Yu, Donglei  and\nKang, Xiaomian  and\nLiu, Yuchen  and\nZhou, Yu  and\nZong, Chengqing"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Simultaneous Machine Translation (SiMT) generates target outputs while receiving stream source inputs and requires a read/write policy to decide whether to wait for the next source token or generate a new target token, whose decisions form a decision path. Existing SiMT methods, which learn the policy by exploring various decision paths in training, face inherent limitations. These methods not only fail to precisely optimize the policy due to the inability to accurately assess the individual impact of each decision on SiMT performance, but also cannot sufficiently explore all potential paths because of their vast number. Besides, building decision paths requires unidirectional encoders to simulate streaming source inputs, which impairs the translation quality of SiMT models. To solve these issues, we propose Self-Modifying State Modeling (SM2), a novel training paradigm for SiMT task. Without building decision paths, SM2individually optimizes decisions at each state during training. To precisely optimize the policy, SM2introduces Self-Modifying process to independently assess and adjust decisions at each state. For sufficient exploration, SM2proposes Prefix Sampling to efficiently traverse all potential states. Moreover, SM2ensures compatibility with bidirectional encoders, thus achieving higher translation quality. Experiments show that SM2outperforms strong baselines. Furthermore, SM2allows offline machine translation models to acquire SiMT ability with fine-tuning.",
  "keywords": [
    "we",
    "offline machine translation models",
    "training",
    "translation",
    "fine-tuning",
    "self",
    "sufficient",
    "higher translation quality experiments",
    "tuning",
    "sufficient exploration sm2proposes",
    "unidirectional encoders",
    "fine",
    "bidirectional encoders",
    "encoders",
    "process"
  ],
  "url": "https://aclanthology.org/2024.acl-long.528/",
  "provenance": {
    "collected_at": "2025-06-05 10:41:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}