{
  "id": "2024.acl-long.122",
  "title": "LRQ}uant: Learnable and Robust Post-Training Quantization for Large Language Models",
  "authors": [
    "Zhao, Jiaqi  and\nZhang, Miao  and\nZeng, Chao  and\nWang, Ming  and\nLiu, Xuebo  and\nNie, Liqiang"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Post-training quantization (PTQ) for large language models (LLMs) significantly accelerates model inference and relieves memory constraints, without incurring model training. A “smoothing paradigm” is commonly used in LLM quantization, which transfers the quantization difficulty of activation to weight quantization using mathematically equivalent transformations. However, existing methods face two issues: 1) Most smoothing parameters are hand-crafted defined which leads to suboptimal results; 2) There are significant performance degradations when tested on unseen datasets. To address these challenges, this paper introduces a robust learnable smooth-based PTQ framework, called LRQuant. Firstly, we consider a learnable paradigm to find optimal smoothing parameters which are initialized by logarithmic activation equivalent. In addition, we empirically found that only relying on MSE loss could hardly lead to optimal quantization results, and we then propose a novel loss function based on the negative logarithm of cosine similarity (NLC loss) between outputs of full-precision and quantized block. At last, we pioneeringly introduce Test-time adaptation (TTA) into LLM quantization, which allows for rapid model adaptation during testing to improve generalization performance. More surprisingly, we find that by using our TTA method, we can achieve better results on test sets than directly using test sets for calibration in some cases while avoiding catastrophic forgetting. Codes are available at https://github.com/zjq0455/RLQ.",
  "keywords": [
    "precision",
    "we",
    "llm",
    "training",
    "loss",
    "a novel loss function",
    "logarithmic activation",
    "llms",
    "full-precision and quantized block",
    "activation",
    "large language models llms",
    "generalization",
    "llm quantization",
    "function",
    "generalization performance"
  ],
  "url": "https://aclanthology.org/2024.acl-long.122/",
  "provenance": {
    "collected_at": "2025-06-05 10:35:57",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}