{
  "id": "2024.findings-acl.89",
  "title": "C}on{T}empo: A Unified Temporally Contrastive Framework for Temporal Relation Extraction",
  "authors": [
    "Niu, Jingcheng  and\nLiao, Saifei  and\nNg, Victoria  and\nDe Montigny, Simon  and\nPenn, Gerald"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "The task of temporal relation extraction (TRE) involves identifying and extracting temporal relations between events from narratives. We identify two primary issues with TRE systems. First, by formulating TRE as a simple text classification task where every temporal relation is independent, it is hard to enhance the TRE model’s representation of meaning of temporal relations, and its facility with the underlying temporal calculus. We solve the issue by proposing a novel Temporally Contrastive learning model (ConTempo) that increase the model’s awareness of the meaning of temporal relations by leveraging their symmetric or antisymmetric properties. Second, the reusability of innovations has been limited due to incompatibilities in model architectures. Therefore, we propose a unified framework and show that ConTempo is compatible with all three main branches of TRE research. Our results demonstrate that the performance gains of ConTempo are more pronounced, with the total combination achieving state-of-the-art performance on the widely used MATRES and TBD corpora. We furthermore identified and corrected a large number of annotation errors present in the test set of MATRES, after which the performance increase brought by ConTempo becomes more apparent.",
  "keywords": [
    "t",
    "extraction",
    "we",
    "classification",
    "it",
    "a unified framework",
    "unified",
    "properties",
    "learning",
    "text",
    "incompatibilities",
    "model",
    "a large number",
    "state",
    "awareness"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.89/",
  "provenance": {
    "collected_at": "2025-06-05 10:49:49",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}