{
  "id": "2024.findings-acl.378",
  "title": "ONSEP}: A Novel Online Neural-Symbolic Framework for Event Prediction Based on Large Language Model",
  "authors": [
    "Yu, Xuanqing  and\nSun, Wangtao  and\nLi, Jingwei  and\nLiu, Kang  and\nLiu, Chengbao  and\nTan, Jie"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "In the realm of event prediction, temporal knowledge graph forecasting (TKGF) stands as a pivotal technique. Previous approaches face the challenges of not utilizing experience during testing and relying on a single short-term history, which limits adaptation to evolving data. In this paper, we introduce the Online Neural-Symbolic Event Prediction (ONSEP) framework, which innovates by integrating dynamic causal rule mining (DCRM) and dual history augmented generation (DHAG). DCRM dynamically constructs causal rules from real-time data, allowing for swift adaptation to new causal relationships. In parallel, DHAG merges short-term and long-term historical contexts, leveraging a bi-branch approach to enrich event prediction. Our framework demonstrates notable performance enhancements across diverse datasets, with significant Hit@k (k=1,3,10) improvements, showcasing its ability to augment large language models (LLMs) for event prediction without necessitating extensive retraining. The ONSEP framework not only advances the field of TKGF but also underscores the potential of neural-symbolic approaches in adapting to dynamic data environments.",
  "keywords": [
    "augmented generation dhag dcrm",
    "large language model",
    "field",
    "we",
    "graph",
    "neural",
    "the field",
    "experience",
    "mining",
    "knowledge",
    "language",
    "generation",
    "tkgf",
    "model",
    "large language models"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.378/",
  "provenance": {
    "collected_at": "2025-06-05 10:53:46",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}