{
  "id": "2024.acl-long.656",
  "title": "LAND}e{RMT}: Dectecting and Routing Language-Aware Neurons for Selectively Finetuning {LLM}s to Machine Translation",
  "authors": [
    "Zhu, Shaolin  and\nPan, Leiyu  and\nLi, Bo  and\nXiong, Deyi"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Recent advancements in large language models (LLMs) have shown promising results in multilingual translation even with limited bilingual supervision. The major challenges are catastrophic forgetting and parameter interference for finetuning LLMs when provided parallel training data. To address these challenges, we propose LANDeRMT, a Language-Aware Neuron Detecting and Routing framework that selectively finetunes LLMs to Machine Translation with diverse translation training data. In LANDeRMT, we evaluate the awareness of neurons to MT tasks and categorize them into language-general and language-specific neurons. This categorization enables selective parameter updates during finetuning, mitigating parameter interference and catastrophic forgetting issues. For the detected neurons, we further propose a conditional awareness-based routing mechanism to dynamically adjust language-general and language-specific capacity within LLMs, guided by translation signals. Experimental results demonstrate that the proposed LANDeRMT is very effective in learning translation knowledge, significantly improving translation quality over various strong baselines for multiple language pairs.",
  "keywords": [
    "translation signals",
    "machine translation",
    "we",
    "multilingual translation",
    "llm",
    "parameter",
    "training",
    "translation",
    "language-general and language-specific capacity",
    "translation knowledge",
    "llms",
    "large language models llms",
    "translation quality",
    "diverse translation training data",
    "language-general and language-specific neurons"
  ],
  "url": "https://aclanthology.org/2024.acl-long.656/",
  "provenance": {
    "collected_at": "2025-06-05 10:43:20",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}