{
  "id": "2024.acl-demos.28",
  "title": "S}ea{LLM}s - Large Language Models for {S}outheast {A}sia",
  "authors": [
    "Nguyen, Xuan-Phi  and\nZhang, Wenxuan  and\nLi, Xin  and\nAljunied, Mahani  and\nHu, Zhiqiang  and\nShen, Chenhui  and\nChia, Yew Ken  and\nLi, Xingxuan  and\nWang, Jianyu  and\nTan, Qingyu  and\nCheng, Liying  and\nChen, Guanzheng  and\nDeng, Yue  and\nYang, Sen  and\nLiu, Chaoqun  and\nZhang, Hang  and\nBing, Lidong"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 3: System Demonstrations)",
  "abstract": "Despite the remarkable achievements of large language models (LLMs) in various tasks, there remains a linguistic bias that favors high-resource languages, such as English, often at the expense of low-resource and regional languages. To address this imbalance, we introduce SeaLLMs, an innovative series of language models that specifically focuses on Southeast Asian (SEA) languages. SeaLLMs are built upon popular English-centric models through continued pre-training with an extended vocabulary, specialized instruction and alignment tuning to better capture the intricacies of regional languages. This allows them to respect and reflect local cultural norms, customs, stylistic preferences, and legal considerations. Our comprehensive evaluation demonstrates that SeaLLM models exhibit superior performance across a wide spectrum of linguistic tasks and assistant-style instruction-following capabilities relative to comparable open-source models. Moreover, they outperform ChatGPT-3.5 in non-Latin languages, such as Thai, Khmer, Lao, and Burmese, by large margins while remaining lightweight and cost-effective to operate.",
  "keywords": [
    "assistant-style instruction-following capabilities",
    "bias",
    "intricacies",
    "series",
    "we",
    "llm",
    "training",
    "instruction",
    "the intricacies",
    "s",
    "language models",
    "seallms",
    "the remarkable achievements",
    "alignment",
    "our comprehensive evaluation"
  ],
  "url": "https://aclanthology.org/2024.acl-demos.28/",
  "provenance": {
    "collected_at": "2025-06-05 10:47:39",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}