{
  "id": "2024.acl-long.799",
  "title": "Latxa: An Open Language Model and Evaluation Suite for {B}asque",
  "authors": [
    "Etxaniz, Julen  and\nSainz, Oscar  and\nMiguel, Naiara  and\nAldabe, Itziar  and\nRigau, German  and\nAgirre, Eneko  and\nOrmazabal, Aitor  and\nArtetxe, Mikel  and\nSoroa, Aitor"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "We introduce Latxa, a family of large language models for Basque ranging from 7 to 70 billion parameters. Latxa is based on Llama 2, which we continue pretraining on a new Basque corpus comprising 4.3M documents and 4.2B tokens. Addressing the scarcity of high-quality benchmarks for Basque, we further introduce 4 multiple choice evaluation datasets: EusProficiency, comprising 5,169 questions from official language proficiency exams; EusReading, comprising 352 reading comprehension questions; EusTrivia, comprising 1,715 trivia questions from 5 knowledge areas; and EusExams, comprising 16,046 questions from public examinations. In our extensive evaluation, Latxa outperforms all previous open models we compare to by a large margin. In addition, it is competitive with GPT-4 Turbo in language proficiency and understanding, despite lagging behind in reading comprehension and knowledge-intensive tasks. Both the Latxa family of models, as well as our new pretraining corpora and evaluation datasets, are publicly available under open licenses. Our suite enables reproducible research on methods to build LLMs for low-resource languages.",
  "keywords": [
    "language proficiency",
    "official language proficiency exams",
    "we",
    "it",
    "llms",
    "evaluation suite",
    "gpt-4",
    "our extensive evaluation",
    "an open language model",
    "gpt-4 turbo",
    "proficiency",
    "knowledge",
    "language",
    "model",
    "large language models"
  ],
  "url": "https://aclanthology.org/2024.acl-long.799/",
  "provenance": {
    "collected_at": "2025-06-05 10:45:18",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}