{
  "id": "2024.findings-acl.397",
  "title": "Forward-Backward Reasoning in Large Language Models for Mathematical Verification",
  "authors": [
    "Jiang, Weisen  and\nShi, Han  and\nYu, Longhui  and\nLiu, Zhengying  and\nZhang, Yu  and\nLi, Zhenguo  and\nKwok, James"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Self-Consistency samples diverse reasoning chains with answers and chooses the final answer by majority voting. It is based on forward reasoning and cannot further improve performance by sampling more reasoning chains when saturated. To further boost performance, we introduce backward reasoning to verify candidate answers. Specifically, for mathematical tasks, we mask a number in the question and ask the LLM to answer a backward question created by a simple template, i.e., to predict the masked number when a candidate answer is provided. Instead of using forward or backward reasoning alone, we propose **FOBAR** to combine **FO**rward and **BA**ckward **R**easoning for verification. Extensive experiments on six standard mathematical data sets and three LLMs show that FOBAR achieves state-of-the-art performance. In particular, FOBAR outperforms Self-Consistency, which uses forward reasoning alone, demonstrating that combining forward and backward reasoning is more accurate in verification. In addition, FOBAR achieves higher accuracy than existing verification methods, showing the effectiveness of the simple template used in backward reasoning and the proposed combination.",
  "keywords": [
    "question",
    "three llms",
    "we",
    "llm",
    "answer",
    "it",
    "self",
    "higher accuracy",
    "llms",
    "i",
    "the llm",
    "accuracy",
    "language",
    "large language models",
    "state"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.397/",
  "provenance": {
    "collected_at": "2025-06-05 10:54:01",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}