{
  "id": "2024.acl-long.346",
  "title": "Self-Evolving {GPT}: A Lifelong Autonomous Experiential Learner",
  "authors": [
    "Gao, Jinglong  and\nDing, Xiao  and\nCui, Yiming  and\nZhao, Jianbai  and\nWang, Hepeng  and\nLiu, Ting  and\nQin, Bing"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "To improve the performance of large language models (LLMs), researchers have explored providing LLMs with textual task-solving experience via prompts. However, they rely on manual efforts to acquire and apply such experience for each task, which is not feasible for the growing demand for LLMs and the variety of user questions.To address this issue, we design a lifelong autonomous experiential learning framework based on LLMs to explore whether LLMs can imitate human ability for learning and utilizing experience. It autonomously learns and accumulates experience through experience transfer and induction, categorizing the types of input questions to select which accumulated experience to employ for them.Experimental results on six widely used NLP datasets show that our framework performs reliably in each intermediate step and effectively improves the performance of GPT-3.5 and GPT-4. This validates the feasibility of using LLMs to mimic human experiential learning and application capabilities, offering a new path worth further exploration for the evolution of machine intelligence. Additionally, we provide a detailed analysis of the behavior of our framework at each step.We will open source codes after the acceptance, fostering open research in the NLP community and beyond.",
  "keywords": [
    "variety",
    "the nlp community",
    "we",
    "which accumulated experience",
    "it",
    "experience transfer",
    "self",
    "gpt-3",
    "learning",
    "transfer",
    "analysis",
    "llms",
    "textual task-solving experience",
    "such experience",
    "learner"
  ],
  "url": "https://aclanthology.org/2024.acl-long.346/",
  "provenance": {
    "collected_at": "2025-06-05 10:39:03",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}