{
  "id": "2024.findings-acl.188",
  "title": "GENDEX}: Generative Data Augmentation Strategy Leveraging External Data for Abstractive Dialogue Summarization",
  "authors": [
    "Park, Sangwon  and\nChoi, Hongseok  and\nChoi, Dongha  and\nLee, Hyunju"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "With the proliferation of digital communication, dialogue summarization has become increasingly important. However, it still faces a shortage of data. To address this issue, we developed **Gen**erative **D**ata Augmentation Strategy Leveraging **Ex**ternal Data for Abstractive Dialogue Summarization (**GENDEX**), which is based on the hypothetical foundation that texts containing people and their interpersonal interactions can potentially serve as summaries of corresponding dialogues. We filter short texts containing people and resolve coreferences for better contextual analysis. We then identify the semantic roles of words within the texts and filter them based on the patterns observed in the dialogue summarization datasets. Using these texts, we generate synthetic dialogues through a controlled generation method. To better leverage the augmented data, we utilize noise-tolerant training to fine-tune the summarization model. The experimental results demonstrate the effectiveness of our proposed method, showing its robust performance, generalizability, and scalability. Moreover, performance improvements by *GENDEX* were observed regardless of complexity of dialogues. The code is available at https://github.com/DMCB-GIST/GENDEX.",
  "keywords": [
    "code",
    "a controlled generation method",
    "semantic",
    "summarization",
    "we",
    "its robust performance generalizability",
    "dialogue",
    "generalizability",
    "corresponding dialogues",
    "training",
    "it",
    "the semantic roles",
    "analysis",
    "generative",
    "gen"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.188/",
  "provenance": {
    "collected_at": "2025-06-05 10:51:09",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}