{
  "id": "2024.findings-acl.274",
  "title": "Probing the Uniquely Identifiable Linguistic Patterns of Conversational {AI} Agents",
  "authors": [
    "Zahid, Iqra  and\nMadusanka, Tharindu  and\nBatista-Navarro, Riza  and\nSun, Youcheng"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "The proliferation of Conversational AI agents (CAAs) has emphasised the need to distinguish between human and machine-generated texts, with implications spanning digital forensics and cybersecurity. While prior research primarily focussed on distinguishing human from machine-generated text, our study takes a more refined approach by analysing different CAAs. We construct linguistic profiles for five CAAs, aiming to identify Uniquely Identifiable Linguistic Patterns (UILPs) for each model using authorship attribution techniques. Authorship attribution (AA) is the task of identifying the author of an unknown text from a pool of known authors. Our research seeks to answer crucial questions about the existence of UILPs in CAAs, the linguistic overlap between various text types generated by these models, and the feasibility of Authorship Attribution (AA) for CAAs based on UILPs. Promisingly, we are able to attribute CAAs based on their original texts with a weighted F1-score of 96.94%. Further, we are able to attribute CAAs according to their writing style (as specified by prompts), yielding a weighted F1-score of 95.84%, which sets the baseline for this task. By employing principal component analysis (PCA), we identify the top 100 most informative linguistic features for each CAA, achieving a weighted F1-score ranging from 86.04% to 97.93%, and an overall weighted F1-score of 93.86%.",
  "keywords": [
    "an overall weighted f1-score",
    "we",
    "conversational ai agents caas",
    "machine-generated text",
    "a weighted f1-score",
    "human and machine-generated texts",
    "analysis",
    "a weighted f1-score ranging",
    "text",
    "prompts",
    "model",
    "machine",
    "human",
    "conversational ai agents",
    "conversational"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.274/",
  "provenance": {
    "collected_at": "2025-06-05 10:52:21",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}