{
  "id": "2024.wassa-1.13",
  "title": "Guiding Sentiment Analysis with Hierarchical Text Clustering: Analyzing the {G}erman {X}/{T}witter Discourse on Face Masks in the 2020 {COVID}-19 Pandemic",
  "authors": [
    "Wehrli, Silvan  and\nEzekannagha, Chisom  and\nHattab, Georges  and\nBoender, Tamara  and\nArnrich, Bert  and\nIrrgang, Christopher"
  ],
  "year": "2024",
  "venue": "Proceedings of the 14th Workshop on Computational Approaches to Subjectivity, Sentiment, {\\&} Social Media Analysis",
  "abstract": "Social media are a critical component of the information ecosystem during public health crises. Understanding the public discourse is essential for effective communication and misinformation mitigation. Computational methods can aid these efforts through online social listening. We combined hierarchical text clustering and sentiment analysis to examine the face mask-wearing discourse in Germany during the COVID-19 pandemic using a dataset of 353,420 German X (formerly Twitter) posts from 2020. For sentiment analysis, we annotated a subsample of the data to train a neural network for classifying the sentiments of posts (neutral, negative, or positive). In combination with clustering, this approach uncovered sentiment patterns of different topics and their subtopics, reflecting the online public response to mask mandates in Germany. We show that our approach can be used to examine long-term narratives and sentiment dynamics and to identify specific topics that explain peaks of interest in the social media discourse.",
  "keywords": [
    "we",
    "hierarchical text clustering",
    "neural",
    "information",
    "analysis",
    "sentiment analysis",
    "text",
    "sentiment",
    "hierarchical",
    "a neural network",
    "clustering",
    "network",
    "term",
    "subtopics",
    "the social media discourse"
  ],
  "url": "https://aclanthology.org/2024.wassa-1.13/",
  "provenance": {
    "collected_at": "2025-06-05 11:11:45",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}