{
  "id": "2024.findings-acl.214",
  "title": "D}ev{E}val: A Manually-Annotated Code Generation Benchmark Aligned with Real-World Code Repositories",
  "authors": [
    "Li, Jia  and\nLi, Ge  and\nZhao, Yunfei  and\nLi, Yongmin  and\nLiu, Huanyu  and\nZhu, Hao  and\nWang, Lecheng  and\nLiu, Kaibo  and\nFang, Zheng  and\nWang, Lanshen  and\nDing, Jiazheng  and\nZhang, Xuanming  and\nZhu, Yuqi  and\nDong, Yihong  and\nJin, Zhi  and\nLi, Binhua  and\nHuang, Fei  and\nLi, Yongbin  and\nGu, Bin  and\nYang, Mengfei"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "How to evaluate the coding abilities of Large Language Models (LLMs) remains an open question. We find that existing benchmarks are poorly aligned with real-world code repositories and are insufficient to evaluate the coding abilities of LLMs.To address the knowledge gap, we propose a new benchmark named DevEval, which has three advances. (1) DevEval aligns with real-world repositories in multiple dimensions, e.g., code and dependency distributions. (2) DevEval is annotated by 13 developers and contains comprehensive annotations (e.g., requirements, original repositories, reference code, and reference dependencies). (3) DevEval comprises 1,825 testing samples from 115 repositories, covering 10 popular domains (e.g., Internet, Database). Based on DevEval, we propose repository-level code generation and evaluate 8 popular LLMs on DevEval (e.g., gpt-4, gpt-3.5, StarCoder 2, DeepSeek Coder, CodeLLaMa). Our experiments reveal these LLMs’ coding abilities in real-world code repositories. For example, the highest Pass@1 of gpt-4 only is 53.04% in our experiments. We also analyze LLMs’ failed cases and summarize their shortcomings. We hope DevEval can facilitate the development of LLMs in real code repositories. DevEval, prompts, and LLMs’ predictions have been released.",
  "keywords": [
    "code",
    "115 repositories",
    "real-world repositories",
    "question",
    "we",
    "real-world code repositories",
    "the coding abilities",
    "val",
    "repositories",
    "gpt-3",
    "llms",
    "coder",
    "abilities",
    "gpt-4",
    "insufficient"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.214/",
  "provenance": {
    "collected_at": "2025-06-05 10:51:31",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}