{
  "id": "2024.findings-acl.34",
  "title": "Meta-Reasoning: Semantics-Symbol Deconstruction for Large Language Models",
  "authors": [
    "Wang, Yiming  and\nZhang, Zhuosheng  and\nZhang, Pei  and\nYang, Baosong  and\nWang, Rui"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Neural-symbolic methods have demonstrated efficiency in enhancing the reasoning abilities of large language models (LLMs). However, existing methods mainly rely on syntactically mapping natural languages to complete formal languages like Python and SQL. Those methods require that reasoning tasks be convertible into programs, which cater to the computer execution mindset and deviate from human reasoning habits. To broaden symbolic methods’ applicability and adaptability in the real world, we propose Meta-Reasoning from a linguistic perspective. This method empowers LLMs to deconstruct reasoning-independent semantic information into generic symbolic representations, thereby efficiently capturing more generalized reasoning knowledge. We conduct extensive experiments on more than ten datasets encompassing conventional reasoning tasks like arithmetic, symbolic, and logical reasoning, and the more complex interactive reasoning tasks like theory-of-mind reasoning. Experimental results demonstrate that Meta-Reasoning significantly enhances in-context reasoning accuracy, learning efficiency, out-of-domain generalization, and output stability compared to the Chain-of-Thought technique.",
  "keywords": [
    "reasoning-independent semantic information",
    "chain",
    "generalized",
    "efficiency",
    "semantic",
    "we",
    "neural",
    "natural",
    "semantics",
    "information",
    "more generalized reasoning knowledge",
    "llms",
    "abilities",
    "meta-reasoning semantics-symbol deconstruction",
    "generic"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.34/",
  "provenance": {
    "collected_at": "2025-06-05 10:49:03",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}