{
  "id": "2024.wassa-1.33",
  "title": "Empathify at {WASSA} 2024 Empathy and Personality Shared Task: Contextualizing Empathy with a {BERT}-Based Context-Aware Approach for Empathy Detection",
  "authors": [
    "Numano{\\u{g}}lu, Arda  and\nAte{\\c{s}}, S{\\\"u}leyman  and\nCicekli, Nihan  and\nK{\\\"u}{\\c{c}}{\\\"u}k, Dilek"
  ],
  "year": "2024",
  "venue": "Proceedings of the 14th Workshop on Computational Approaches to Subjectivity, Sentiment, {\\&} Social Media Analysis",
  "abstract": "Empathy detection from textual data is a complex task that requires an understanding of both the content and context of the text. This study presents a BERT-based context-aware approach to enhance empathy detection in conversations and essays. We participated in the WASSA 2024 Shared Task, focusing on two tracks: empathy and emotion prediction in conversations (CONV-turn) and empathy and distress prediction in essays (EMP). Our approach leverages contextual information by incorporating related articles and emotional characteristics as additional inputs, using BERT-based Siamese (parallel) architecture. Our experiments demonstrated that using article summaries as context significantly improves performance, with the parallel BERT approach outperforming the traditional method of concatenating inputs with the ‘[SEP]‘ token. These findings highlight the importance of context-awareness in empathy detection and pave the way for future improvements in the sensitivity and accuracy of such systems.",
  "keywords": [
    "conversations",
    "we",
    "article summaries",
    "information",
    "a bert-based context-aware approach",
    "bert",
    "text",
    "the parallel bert approach",
    "accuracy",
    "summaries",
    "bert-based siamese parallel architecture",
    "conversations conv-turn",
    "conv",
    "the wassa",
    "approach"
  ],
  "url": "https://aclanthology.org/2024.wassa-1.33/",
  "provenance": {
    "collected_at": "2025-06-05 11:12:01",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}