{
  "id": "2024.repl4nlp-1.2",
  "title": "D}omain{I}nv: Domain Invariant Fine Tuning and Adversarial Label Correction For Unsupervised {QA} Domain Adaptation",
  "authors": [
    "Khandelwal, Anant"
  ],
  "year": "2024",
  "venue": "Proceedings of the 9th Workshop on Representation Learning for NLP (RepL4NLP-2024)",
  "abstract": "Existing Question Answering (QA) systems are limited in their ability to answer questions from unseen domains or any out-of-domain distributions, making them less reliable for deployment in real scenarios. Importantly, all existing QA domain adaptation methods are either based on generating synthetic data or pseudo-labeling the target domain data. Domain adaptation methods relying on synthetic data and pseudo-labeling suffer from either the need for extensive computational resources or an additional overhead of carefully selecting the confidence threshold to distinguish noisy examples from the training dataset. In this paper, we propose unsupervised domain adaptation for an unlabeled target domain by transferring the target representation close to the source domain without using supervision from the target domain. To achieve this, we introduce the idea of domain-invariant fine-tuning along with adversarial label correction (DomainInv) to identify target instances that are distant from the source domain. This involves learning the domain invariant feature encoder to minimize the distance between such target instances and source instances class-wisely. This eliminates the possibility of learning features of the target domain that are still close to the source support but are ambiguous. The evaluation of our QA domain adaptation method, namely DomainInv, on multiple target QA datasets reveals a performance improvement over the strongest baseline.",
  "keywords": [
    "support",
    "question",
    "we",
    "training",
    "tuning",
    "fine",
    "domain-invariant fine-tuning",
    "multiple target qa datasets",
    "class",
    "encoder",
    "qa systems",
    "evaluation",
    "the evaluation",
    "target instances",
    "supervision"
  ],
  "url": "https://aclanthology.org/2024.repl4nlp-1.2/",
  "provenance": {
    "collected_at": "2025-06-05 11:09:18",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}