{
  "id": "2024.findings-acl.396",
  "title": "LLM} can Achieve Self-Regulation via Hyperparameter Aware Generation",
  "authors": [
    "Wang, Siyin  and\nLi, Shimin  and\nSun, Tianxiang  and\nFu, Jinlan  and\nCheng, Qinyuan  and\nYe, Jiasheng  and\nYe, Junjie  and\nQiu, Xipeng  and\nHuang, Xuanjing"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "In the realm of Large Language Models (LLMs), users commonly employ diverse decoding strategies and adjust hyperparameters to control the generated text. However, a critical question emerges: Are LLMs conscious of the existence of these decoding strategies and capable of regulating themselves? The current decoding generation process often relies on empirical and heuristic manual adjustments to hyperparameters based on types of tasks and demands. However, this process is typically cumbersome, and the decoding hyperparameters may not always be optimal for each sample. To address the aforementioned challenges, we propose a novel text generation paradigm termed Hyperparameter Aware Generation (HAG). By leveraging hyperparameter-aware instruction tuning, the LLM autonomously determines the optimal decoding strategy and configs based on the input samples, enabling self-regulation. Our approach eliminates the need for extensive manual tuning, offering a more autonomous, self-regulate model behavior. Experimental results spanning six datasets across reasoning, creativity, translation, and mathematics tasks demonstrate that hyperparameter-aware instruction tuning empowers the LLMs to self-regulate the decoding strategy and hyperparameter. HAG extends the current paradigm in the text generation process, highlighting the feasibility of endowing the LLMs with self-regulate decoding strategies.",
  "keywords": [
    "diverse decoding strategies",
    "the llms",
    "question",
    "the decoding hyperparameters",
    "we",
    "current",
    "llm",
    "translation",
    "instruction",
    "hyperparameters",
    "hyperparameter aware generation",
    "the generated text",
    "self",
    "hyperparameter aware generation hag",
    "hyperparameter-aware instruction tuning"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.396/",
  "provenance": {
    "collected_at": "2025-06-05 10:54:01",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}