{
  "id": "2024.acl-long.223",
  "title": "C}a{MML}: Context-Aware Multimodal Learner for Large Models",
  "authors": [
    "Chen, Yixin  and\nZhang, Shuai  and\nHan, Boran  and\nHe, Tong  and\nLi, Bo"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "In this work, we introduce Context-Aware MultiModal Learner (CaMML), for tuning large multimodal models (LMMs). CaMML, a lightweight module, is crafted to seamlessly integrate multimodal contextual samples into large models, thereby empowering the model to derive knowledge from analogous, domain-specific, up-to-date information and make grounded inferences. Importantly, CaMML is highly scalable and can efficiently handle lengthy multimodal context examples owing to its hierarchical design. Based on CaMML, we have developed two multimodal models, CaMML-7B and CaMML-13B, that have shown exceptional performance across an array of benchmark datasets for multimodal tasks. Remarkably, CaMML-13B achieves the state-of-the-art performance on over ten widely recognized multimodal benchmark datasets, surpassing LLaVA-1.5 (13B) with a noticeable margin, without integration of any external resources. Moreover, we have conducted extensive ablative studies to inspect the inner workings of CaMML and performed qualitative analyses to showcase its effectiveness in handling real-world challenging cases. Code and models are available at: https://github.com/amazon-science/camml.",
  "keywords": [
    "code",
    "we",
    "the inner workings",
    "information",
    "science",
    "inner",
    "its hierarchical design",
    "extensive ablative studies",
    "learner",
    "context-aware multimodal learner camml",
    "work",
    "hierarchical",
    "knowledge",
    "model",
    "studies"
  ],
  "url": "https://aclanthology.org/2024.acl-long.223/",
  "provenance": {
    "collected_at": "2025-06-05 10:37:21",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}