{
  "id": "2024.findings-acl.656",
  "title": "Exploiting Positional Bias for Query-Agnostic Generative Content in Search",
  "authors": [
    "Parry, Andrew  and\nMacAvaney, Sean  and\nGanguly, Debasis"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "In recent years, research shows that neural ranking models (NRMs) substantially outperform their lexical counterparts in text retrieval. In traditional search pipelines, a combination of features leads to well-defined behaviour. However, as neural approaches become increasingly prevalent as the final scoring component of engines or as standalone systems, their robustness to malicious text and, more generally, semantic perturbation needs to be better understood. We posit that the transformer attention mechanism can induce exploitable defects in search models through sensitivity to token position within a sequence, leading to an attack that could generalise beyond a single query or topic. We demonstrate such defects by showing that non-relevant text–such as promotional content–can be easily injected into a document without adversely affecting its position in search results. Unlike previous gradient-based attacks, we demonstrate the existence of these biases in a query-agnostic fashion. In doing so, without the knowledge of topicality, we can still reduce the negative effects of non-relevant content injection by controlling injection position. Our experiments are conducted with simulated on-topic promotional text automatically generated by prompting LLMs with topical context from target documents. We find that contextualisation of a non-relevant text further reduces negative effects whilst likely circumventing existing content filtering mechanisms. In contrast, lexical models are found to be more resilient to such content injection attacks. We then investigate a simple yet effective compensation for the weaknesses of the NRMs in search, validating our hypotheses regarding transformer bias.",
  "keywords": [
    "bias",
    "semantic",
    "we",
    "resilient",
    "neural",
    "token",
    "more generally semantic perturbation",
    "retrieval",
    "query-agnostic generative content",
    "transformer bias",
    "sequence",
    "positional bias",
    "llms",
    "generative",
    "previous gradient-based attacks"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.656/",
  "provenance": {
    "collected_at": "2025-06-05 10:57:34",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}