{
  "id": "2024.teachingnlp-1.3",
  "title": "Industry vs Academia: Running a Course on Transformers in Two Setups",
  "authors": [
    "Nikishina, Irina  and\nTikhonova, Maria  and\nChekalina, Viktoriia  and\nZaytsev, Alexey  and\nVazhentsev, Artem  and\nPanchenko, Alexander"
  ],
  "year": "2024",
  "venue": "Proceedings of the Sixth Workshop on Teaching NLP",
  "abstract": "This paper presents a course on neural networks based on the Transformer architecture targeted at diverse groups of people from academia and industry with experience in Python, Machine Learning, and Deep Learning but little or no experience with Transformers. The course covers a comprehensive overview of the Transformers NLP applications and their use for other data types. The course features 15 sessions, each consisting of a lecture and a practical part, and two homework assignments organized as CodaLab competitions. The first six sessions of the course are devoted to the Transformer and the variations of this architecture (e.g., encoders, decoders, encoder-decoders) as well as different techniques of model tuning. Subsequent sessions are devoted to multilingualism, multimodality (e.g., texts and images), efficiency, event sequences, and tabular data.We ran the course for different audiences: academic students and people from industry. The first run was held in 2022. During the subsequent iterations until 2024, it was constantly updated and extended with recently emerged findings on GPT-4, LLMs, RLHF, etc. Overall, it has been ran six times (four times in industry and twice in academia) and received positive feedback from academic and industry students.",
  "keywords": [
    "deep",
    "transformers",
    "feedback",
    "little or no experience",
    "python machine learning",
    "overview",
    "efficiency",
    "we",
    "images efficiency event sequences",
    "neural",
    "rlhf",
    "it",
    "decoders",
    "learning",
    "nlp applications"
  ],
  "url": "https://aclanthology.org/2024.teachingnlp-1.3/",
  "provenance": {
    "collected_at": "2025-06-05 11:11:07",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}