{
  "id": "2024.findings-acl.131",
  "title": "Do Large Language Models have Problem-Solving Capability under Incomplete Information Scenarios?",
  "authors": [
    "Chen, Yuyan  and\nLi, Yueze  and\nYan, Songzhou  and\nLiu, Sijia  and\nLiang, Jiaqing  and\nXiao, Yanghua"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "The evaluation of the problem-solving capability under incomplete information scenarios of Large Language Models (LLMs) is increasingly important, encompassing capabilities such as questioning, knowledge search, error detection, and path planning. Current research mainly focus on LLMs’ problem-solving capability such as “Twenty Questions”.However, these kinds of games do not require recognizing misleading cues which are necessary in the incomplete information scenario.Moreover, the existing game such as “Who is undercover” are highly subjective, making it challenging for evaluation.Therefore, in this paper, we introduce a novel game named BrainKing based on the “Who is undercover” and “Twenty Questions” for evaluating LLM capabilities under incomplete information scenarios. It requires LLMs to identify target entities with limited yes-or-no questions and potential misleading answers. By setting up easy, medium, and hard difficulty modes, we comprehensively assess the performance of LLMs across various aspects. Our results reveal the capabilities and limitations of LLMs in BrainKing, providing significant insights of LLM problem-solving levels.",
  "keywords": [
    "we",
    "current",
    "llm",
    "llm capabilities",
    "llms problem-solving capability",
    "it",
    "information",
    "the capabilities",
    "llms",
    "large language models llms",
    "target entities",
    "llm problem-solving levels",
    "increasingly important encompassing capabilities",
    "knowledge",
    "language"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.131/",
  "provenance": {
    "collected_at": "2025-06-05 10:50:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}