{
  "id": "2024.acl-long.73",
  "title": "Active Prompting with Chain-of-Thought for Large Language Models",
  "authors": [
    "Diao, Shizhe  and\nWang, Pengcheng  and\nLin, Yong  and\nPan, Rui  and\nLiu, Xiang  and\nZhang, Tong"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "The increasing scale of large language models (LLMs) brings emergent abilities to various complex tasks requiring reasoning, such as arithmetic and commonsense reasoning. It is known that the effective design of task-specific prompts is critical for LLMs’ ability to produce high-quality answers. In particular, an effective approach for complex question-and-answering tasks is example-based prompting with chain-of-thought (CoT) reasoning, which significantly improves the performance of LLMs. However, current CoT methods rely on a fixed set of human-annotated exemplars, which are not necessarily the most effective examples for different tasks. This paper proposes a new method, Active-Prompt, to adapt LLMs to different tasks with task-specific example prompts (annotated with human-designed CoT reasoning). For this purpose, we propose a solution to the key problem of determining which questions are the most important and helpful to annotate from a pool of task-specific queries. By borrowing ideas from the related problem of uncertainty-based active learning, we introduce several metrics to characterize the uncertainty so as to select the most uncertain questions for annotation. Experimental results demonstrate the superiority of our proposed method, achieving superior performance on eight complex reasoning tasks. Further analyses of different uncertainty metrics, pool sizes, zero-shot learning, and accuracy-uncertainty relationships demonstrate the effectiveness of our method.",
  "keywords": [
    "human-designed cot reasoning",
    "accuracy-uncertainty relationships",
    "chain",
    "question",
    "different uncertainty metrics pool",
    "we",
    "current",
    "task-specific queries",
    "shot",
    "cot",
    "it",
    "queries",
    "current cot methods",
    "learning",
    "llms"
  ],
  "url": "https://aclanthology.org/2024.acl-long.73/",
  "provenance": {
    "collected_at": "2025-06-05 10:35:17",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}