{
  "id": "2024.acl-long.773",
  "title": "How Johnny Can Persuade {LLM}s to Jailbreak Them: Rethinking Persuasion to Challenge {AI} Safety by Humanizing {LLM}s",
  "authors": [
    "Zeng, Yi  and\nLin, Hongpeng  and\nZhang, Jingwen  and\nYang, Diyi  and\nJia, Ruoxi  and\nShi, Weiyan"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Most traditional AI safety research views models as machines and centers on algorithm-focused attacks developed by security experts. As large language models (LLMs) become increasingly common and competent, non-expert users can also impose risks during daily interactions. Observing this, we shift the perspective, by treating LLMs as human-like communicators to examine the interplay between everyday language interaction and AI safety. Specifically, we study how to persuade LLMs to jailbreak them. First, we propose a persuasion taxonomy derived from decades of social science research. Then, we apply the taxonomy to automatically generate persuasive adversarial prompts (PAP) to jailbreak LLMs. Results show that persuasion significantly increases the jailbreak risk across all risk categories: PAP consistently achieves an attack success rate of over 92% on Llama-2-7b-Chat, GPT-3.5, and GPT-4 in 10 trials, surpassing recent algorithm-focused attacks. On the defense side, we explore various mechanisms against PAP, find a significant gap in existing defenses, and advocate for more fundamental solutions for AI safety.",
  "keywords": [
    "rate",
    "llm s",
    "we",
    "llm",
    "gpt-3",
    "science",
    "views",
    "to jailbreak llms results",
    "all risk categories",
    "llms",
    "social science research",
    "categories",
    "gpt-4",
    "chat",
    "prompts"
  ],
  "url": "https://aclanthology.org/2024.acl-long.773/",
  "provenance": {
    "collected_at": "2025-06-05 10:44:57",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}