{
  "id": "2024.findings-acl.530",
  "title": "Investigating Subtler Biases in {LLM}s: Ageism, Beauty, Institutional, and Nationality Bias in Generative Models",
  "authors": [
    "Kamruzzaman, Mahammed  and\nShovon, Md.  and\nKim, Gene"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "LLMs are increasingly powerful and widely used to assist users in a variety of tasks. This use risks introducing LLM biases into consequential decisions such as job hiring, human performance evaluation, and criminal sentencing. Bias in NLP systems along the lines of gender and ethnicity has been widely studied, especially for specific stereotypes (e.g., Asians are good at math). In this paper, we investigate bias along less-studied but still consequential, dimensions, such as age and beauty, measuring subtler correlated decisions that LLMs make between social groups and unrelated positive and negative attributes. Although these subtler biases are understudied they follow people as much as gender and ethnicity do. So, we want to see whether they also follow one with LLMs.We introduce a template-generated dataset of sentence completion tasks that asks the model to select the most appropriate attribute to complete an evaluative statement about a person described as a member of a specific social group. We also reverse the completion task to select the social group based on an attribute. We report the correlations that we find for 4 cutting-edge LLMs. This dataset can be used as a benchmark to evaluate progress in more generalized biases and the templating technique can be used to expand the benchmark with minimal additional human annotation.",
  "keywords": [
    "variety",
    "generative models",
    "bias",
    "more generalized biases",
    "generalized",
    "we",
    "llm",
    "edge",
    "subtler biases",
    "llm biases",
    "understudied",
    "a variety",
    "llms",
    "generative",
    "age"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.530/",
  "provenance": {
    "collected_at": "2025-06-05 10:55:51",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}