{
  "id": "2024.acl-long.318",
  "title": "Stealthy Attack on Large Language Model based Recommendation",
  "authors": [
    "Zhang, Jinghao  and\nLiu, Yuting  and\nLiu, Qiang  and\nWu, Shu  and\nGuo, Guibing  and\nWang, Liang"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Recently, the powerful large language models (LLMs) have been instrumental in propelling the progress of recommender systems (RS). However, while these systems have flourished, their susceptibility to security threats has been largely overlooked. In this work, we reveal that the introduction of LLMs into recommendation models presents new security vulnerabilities due to their emphasis on the textual content of items. We demonstrate that attackers can significantly boost an item’s exposure by merely altering its textual content during the testing phase, without requiring direct interference with the model’s training process. Additionally, the attack is notably stealthy, as it does not affect the overall recommendation performance and the modifications to the text are subtle, making it difficult for users and platforms to detect. Our comprehensive experiments across four mainstream LLM-based recommendation models demonstrate the superior efficacy and stealthiness of our approach. Our work unveils a significant security gap in LLM-based recommendation systems and paves the way for future research on protecting these systems.",
  "keywords": [
    "we",
    "training",
    "it",
    "llm-based recommendation systems",
    "new security vulnerabilities",
    "llms",
    "text",
    "work",
    "process",
    "language",
    "model",
    "vulnerabilities",
    "interference",
    "approach",
    "the overall recommendation performance"
  ],
  "url": "https://aclanthology.org/2024.acl-long.318/",
  "provenance": {
    "collected_at": "2025-06-05 10:38:40",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}