{
  "id": "2024.acl-long.479",
  "title": "MC}$^2$: Towards Transparent and Culturally-Aware {NLP} for Minority Languages in {C}hina",
  "authors": [
    "Zhang, Chen  and\nTao, Mingxu  and\nHuang, Quzhe  and\nLin, Jiuheng  and\nChen, Zhibin  and\nFeng, Yansong"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Current large language models demonstrate deficiencies in understanding low-resource languages, particularly the minority languages in China. This limitation stems from the scarcity of available pre-training data. To address this accessibility challenge, we present MC2, a Multilingual Corpus of Minority Languages in China, which is the largest open-source corpus of its kind so far. MC2includes four underrepresented languages: Tibetan, Uyghur, Kazakh, and Mongolian. Notably, we focus on the less common writing systems of Kazakh and Mongolian, i.e., Kazakh Arabic script and traditional Mongolian script, respectively, which have been long neglected in previous corpus construction efforts. Recognizing the prevalence of language contamination within existing corpora, we adopt a quality-centric solution for collecting MC2, prioritizing accuracy while enhancing diversity. Furthermore, we underscore the importance of attending to the multiplicity of writing systems, which is closely related to the cultural awareness of the resulting models. The MC2corpus and related models are made public to the community.",
  "keywords": [
    "we",
    "current",
    "training",
    "transparent and culturally-aware nlp",
    "available pre-training data",
    "accuracy",
    "language",
    "nlp",
    "deficiencies",
    "pre",
    "china",
    "awareness",
    "related models",
    "the scarcity",
    "kazakh"
  ],
  "url": "https://aclanthology.org/2024.acl-long.479/",
  "provenance": {
    "collected_at": "2025-06-05 10:40:54",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}