{
  "id": "2024.acl-long.44",
  "title": "The Belebele Benchmark: a Parallel Reading Comprehension Dataset in 122 Language Variants",
  "authors": [
    "Bandarkar, Lucas  and\nLiang, Davis  and\nMuller, Benjamin  and\nArtetxe, Mikel  and\nShukla, Satya Narayan  and\nHusa, Donald  and\nGoyal, Naman  and\nKrishnan, Abhinandan  and\nZettlemoyer, Luke  and\nKhabsa, Madian"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "We present Belebele, a multiple-choice machine reading comprehension (MRC) dataset spanning 122 language variants. Significantly expanding the language coverage of natural language understanding (NLU) benchmarks, this dataset enables the evaluation of text models in high-, medium-, and low-resource languages. Each question is based on a short passage from the FLORES-200 dataset and has four multiple-choice answers. The questions were carefully curated to discriminate between models with different levels of general language comprehension. The English dataset on its own proves difficult enough to challenge state-of-the-art language models. Being fully parallel, this dataset enables direct comparison of model performance across all languages. We use this dataset to evaluate the capabilities of multilingual masked language models (MLMs) and large language models (LLMs). We present extensive results and findings, notably that despite significant cross-lingual transfer in English-centric LLMs, much smaller MLMs pretrained on balanced multilingual data still understand far more languages. Overall, Belebele opens up new avenues for evaluating and analyzing the multilingual capabilities of NLP systems.",
  "keywords": [
    "general language comprehension",
    "question",
    "english-centric llms",
    "we",
    "cross",
    "the multilingual capabilities",
    "natural",
    "transfer",
    "the capabilities",
    "natural language",
    "llms",
    "text",
    "general",
    "language",
    "nlp"
  ],
  "url": "https://aclanthology.org/2024.acl-long.44/",
  "provenance": {
    "collected_at": "2025-06-05 10:34:53",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}