{
  "id": "2024.acl-long.85",
  "title": "A Non-autoregressive Generation Framework for End-to-End Simultaneous Speech-to-Any Translation",
  "authors": [
    "Ma, Zhengrui  and\nFang, Qingkai  and\nZhang, Shaolei  and\nGuo, Shoutao  and\nFeng, Yang  and\nZhang, Min"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Simultaneous translation models play a crucial role in facilitating communication. However, existing research primarily focuses on text-to-text or speech-to-text models, necessitating additional cascade components to achieve speech-to-speech translation. These pipeline methods suffer from error propagation and accumulate delays in each cascade component, resulting in reduced synchronization between the speaker and listener. To overcome these challenges, we propose a novel non-autoregressive generation framework for simultaneous speech translation (NAST-S2x), which integrates speech-to-text and speech-to-speech tasks into a unified end-to-end framework.We develop a non-autoregressive decoder capable of concurrently generating multiple text or acoustic unit tokens upon receiving fixed-length speech chunks. The decoder can generate blank or repeated tokens and employ CTC decoding to dynamically adjust its latency. Experimental results show that NAST-S2xoutperforms state-of-the-art models in both speech-to-text and speech-to-speech tasks. It achieves high-quality simultaneous interpretation within a delay of less than 3 seconds and provides a 28× decoding speedup in offline generation.",
  "keywords": [
    "end",
    "the decoder",
    "we",
    "translation",
    "listener",
    "it",
    "unified",
    "decoder",
    "a non-autoregressive generation framework",
    "a non-autoregressive decoder",
    "text",
    "offline generation",
    "generation",
    "propagation",
    "simultaneous speech translation nast-s2x"
  ],
  "url": "https://aclanthology.org/2024.acl-long.85/",
  "provenance": {
    "collected_at": "2025-06-05 10:35:27",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}