{
  "id": "2024.acl-long.756",
  "title": "What is the Best Way for {C}hat{GPT} to Translate Poetry?",
  "authors": [
    "Wang, Shanshan  and\nWong, Derek  and\nYao, Jingming  and\nChao, Lidia"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Machine translation (MT) has historically faced significant challenges when applied to literary works, particularly in the domain of poetry translation. The advent of Large Language Models such as ChatGPT holds potential for innovation in this field. This study examines ChatGPT’s capabilities in English-Chinese poetry translation tasks, utilizing targeted prompts and small sample scenarios to ascertain optimal performance. Despite promising outcomes, our analysis reveals persistent issues in the translations generated by ChatGPT that warrant attention. To address these shortcomings, we propose an Explanation-Assisted Poetry Machine Translation (EAPMT) method, which leverages monolingual poetry explanation as a guiding information for the translation process. Furthermore, we refine existing evaluation criteria to better suit the nuances of modern poetry translation. We engaged a panel of professional poets for assessments, complemented evaluations by using GPT-4. The results from both human and machine evaluations demonstrate that our EAPMT method outperforms traditional translation methods of ChatGPT and the existing online systems. This paper validates the efficacy of our method and contributes a novel perspective to machine-assisted literary translation.",
  "keywords": [
    "english-chinese poetry translation tasks",
    "modern poetry translation",
    "field",
    "we",
    "translation",
    "the translation process",
    "machine-assisted literary translation",
    "information",
    "chatgpt s capabilities",
    "chatgpt",
    "analysis",
    "existing evaluation criteria",
    "the translations",
    "targeted prompts",
    "traditional translation methods"
  ],
  "url": "https://aclanthology.org/2024.acl-long.756/",
  "provenance": {
    "collected_at": "2025-06-05 10:44:42",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}