{
  "id": "2024.findings-acl.373",
  "title": "C}hat{M}usician: Understanding and Generating Music Intrinsically with {LLM",
  "authors": [
    "Yuan, Ruibin  and\nLin, Hanfeng  and\nWang, Yi  and\nTian, Zeyue  and\nWu, Shangda  and\nShen, Tianhao  and\nZhang, Ge  and\nWu, Yuhang  and\nLiu, Cong  and\nZhou, Ziya  and\nXue, Liumeng  and\nMa, Ziyang  and\nLiu, Qin  and\nZheng, Tianyu  and\nLi, Yizhi  and\nMa, Yinghao  and\nLiang, Yiming  and\nChi, Xiaowei  and\nLiu, Ruibo  and\nWang, Zili  and\nLin, Chenghua  and\nLiu, Qifeng  and\nJiang, Tao  and\nHuang, Wenhao  and\nChen, Wenhu  and\nFu, Jie  and\nBenetos, Emmanouil  and\nXia, Gus  and\nDannenberg, Roger  and\nXue, Wei  and\nKang, Shiyin  and\nGuo, Yike"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "While LLMs demonstrate impressive capabilities in musical knowledge, we find that music reasoning is still an unsolved task.We introduce ChatMusician, an open-source large language model (LLM) that integrates intrinsic musical abilities. It is based on continual pre-training and finetuning LLaMA2 on a text-compatible music representation, ABC notation, and the music is treated as a second language.ChatMusician can understand and generate music with a pure text tokenizer without external multi-modal neural structures or tokenizers. Interestingly, endowing musical abilities does not harm language abilities, even achieving a slightly higher MMLU score.ChatMusician is capable of composing well-structured, full-length music, condition on texts, chords, melodies, motifs, musical forms, etc.On our meticulously curated college-level music understanding benchmark, MusicTheoryBench, ChatMusician surpasses LLaMA2 and GPT-3.5 by a noticeable margin. We show that ChatMusician preserves or even surpasses the original LLaMA2 7B’s language abilities by evaluating on MMLU benchmark.Our work reveals that LLMs can be an excellent compressor for music, which can be seen as humanity’s creative language, but there remains significant territory to be conquered.We release our 5B token music-language corpora MusicPiles, the collected MusicTheoryBench, code, model and demo.",
  "keywords": [
    "code",
    "texts chords melodies motifs",
    "intrinsic musical abilities",
    "we",
    "llm",
    "training",
    "neural",
    "language abilities",
    "it",
    "gpt-3",
    "impressive capabilities",
    "m",
    "llms",
    "abilities",
    "text"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.373/",
  "provenance": {
    "collected_at": "2025-06-05 10:53:42",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}