{
  "id": "2024.findings-acl.370",
  "title": "MM}-{SOC}: Benchmarking Multimodal Large Language Models in Social Media Platforms",
  "authors": [
    "Jin, Yiqiao  and\nChoi, Minje  and\nVerma, Gaurav  and\nWang, Jindong  and\nKumar, Srijan"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Social media platforms are hubs for multimodal information exchange, encompassing text, images, and videos, making it challenging for machines to comprehend the information or emotions associated with interactions in online spaces. Multimodal Large Language Models (MLLMs) have emerged as a promising solution to address these challenges, yet struggle with accurately interpreting human emotions and complex contents like misinformation. This paper introduces MM-Soc, a comprehensive benchmark designed to evaluate MLLMs’ understanding of multimodal social media content. MM-Soc compiles prominent multimodal datasets and incorporates a novel large-scale YouTube tagging dataset, targeting a range of tasks from misinformation detection, hate speech detection, and social context generation. Through our exhaustive evaluation on ten size-variants of four open-source MLLMs, we have identified significant performance disparities, highlighting the need for advancements in models’ social understanding capabilities. Our analysis reveals that, in a zero-shot setting, various types of MLLMs generally exhibit difficulties in handling social media tasks. However, MLLMs demonstrate performance improvements post fine-tuning, suggesting potential pathways for improvement.",
  "keywords": [
    "mllms understanding",
    "disparities",
    "four open-source mllms",
    "we",
    "shot",
    "fine-tuning",
    "it",
    "significant performance disparities",
    "large language models mllms",
    "information",
    "difficulties",
    "analysis",
    "tuning",
    "text",
    "a zero-shot"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.370/",
  "provenance": {
    "collected_at": "2025-06-05 10:53:39",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}