{
  "id": "2024.wassa-1.20",
  "title": "POL}ygraph: {P}olish Fake News Dataset",
  "authors": [
    "Dzienisiewicz, Daniel  and\nGrali{\\'n}ski, Filip  and\nJab{\\l}o{\\'n}ski, Piotr  and\nKubis, Marek  and\nSk{\\'o}rzewski, Pawe{\\l}  and\nWierzchon, Piotr"
  ],
  "year": "2024",
  "venue": "Proceedings of the 14th Workshop on Computational Approaches to Subjectivity, Sentiment, {\\&} Social Media Analysis",
  "abstract": "This paper presents the POLygraph dataset, a unique resource for fake news detection in Polish. The dataset, created by an interdisciplinary team, is composed of two parts: the “fake-or-not” dataset with 11,360 pairs of news articles (identified by their URLs) and corresponding labels, and the “fake-they-say” dataset with 5,082 news articles (identified by their URLs) and tweets commenting on them. Unlike existing datasets, POLygraph encompasses a variety of approaches from source literature, providing a comprehensive resource for fake news detection. The data was collected through manual annotation by expert and non-expert annotators. The project also developed a software tool that uses advanced machine learning techniques to analyze the data and determine content authenticity. The tool and dataset are expected to benefit various entities, from public sector institutions to publishers and fact-checking organizations. Further dataset exploration will foster fake news detection and potentially stimulate the implementation of similar models in other languages. The paper focuses on the creation and composition of the dataset, so it does not include a detailed evaluation of the software tool for content authenticity analysis, which is planned at a later stage of the project.",
  "keywords": [
    "variety",
    "a detailed evaluation",
    "it",
    "various entities",
    "a variety",
    "analysis",
    "machine",
    "entities",
    "evaluation",
    "institutions",
    "detailed",
    "polygraph",
    "models",
    "an interdisciplinary team",
    "similar"
  ],
  "url": "https://aclanthology.org/2024.wassa-1.20/",
  "provenance": {
    "collected_at": "2025-06-05 11:11:51",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}