{
  "id": "2024.findings-acl.954",
  "title": "Ask {LLM}s Directly, ``What shapes your bias?'': Measuring Social Bias in Large Language Models",
  "authors": [
    "Shin, Jisu  and\nSong, Hoyun  and\nLee, Huije  and\nJeong, Soyeong  and\nPark, Jong"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Social bias is shaped by the accumulation of social perceptions towards targets across various demographic identities. To fully understand such social bias in large language models (LLMs), it is essential to consider the composite of social perceptions from diverse perspectives among identities. Previous studies have either evaluated biases in LLMs by indirectly assessing the presence of sentiments towards demographic identities in the generated text or measuring the degree of alignment with given stereotypes. These methods have limitations in directly quantifying social biases at the level of distinct perspectives among identities. In this paper, we aim to investigate how social perceptions from various viewpoints contribute to the development of social bias in LLMs. To this end, we propose a novel strategy to intuitively quantify these social perceptions and suggest metrics that can evaluate the social biases within LLMs by aggregating diverse social perceptions. The experimental results show the quantitative demonstration of the social attitude in LLMs by examining social perception. The analysis we conducted shows that our proposed metrics capture the multi-dimensional aspects of social bias, enabling a fine-grained and comprehensive investigation of bias in LLMs.",
  "keywords": [
    "bias",
    "end",
    "identities",
    "various viewpoints",
    "we",
    "our proposed metrics",
    "llm",
    "various demographic identities",
    "social bias",
    "such social bias",
    "the generated text",
    "it",
    "the social biases",
    "analysis",
    "llms"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.954/",
  "provenance": {
    "collected_at": "2025-06-05 11:01:37",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}