{
  "id": "2024.findings-acl.520",
  "title": "Error Analysis Prompting Enables Human-Like Translation Evaluation in Large Language Models",
  "authors": [
    "Lu, Qingyu  and\nQiu, Baopu  and\nDing, Liang  and\nZhang, Kanjian  and\nKocmi, Tom  and\nTao, Dacheng"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Generative large language models (LLMs), e.g., ChatGPT, have demonstrated remarkable proficiency across several NLP tasks, such as machine translation, text summarization. Recent research (Kocmi and Federmann, 2023) has shown that utilizing LLMs for assessing the quality of machine translation (MT) achieves state-of-the-art performance at the system level but performs poorly at the segment level. To further improve the performance of LLMs on MT quality assessment, we conduct an investigation into several prompting designs, and propose a new prompting method called Error Analysis Prompting (EAPrompt) by combining Chain-of-Thoughts (Wei et al., 2022) and Error Analysis (Lu et al., 2023). This technique emulates the commonly accepted human evaluation framework - Multidimensional Quality Metrics (MQM, Freitag et al., (2021)) and produces explainable and reliable MT evaluations at both the system and segment level. Experimental Results from WMT22 metrics shared task validate the effectiveness of EAPrompt on various LLMs, with different structures. Further analysis confirms that EAPrompt effectively distinguishes major errors from minor ones, while also sharing a similar distribution of the number of errors with MQM. These findings highlight the potential of EAPrompt as a human-like evaluator prompting technique for MT evaluation. We will release our code and scripts to facilitate the community.",
  "keywords": [
    "code",
    "a new prompting method",
    "chain",
    "machine translation",
    "remarkable proficiency",
    "summarization",
    "we",
    "wmt22 metrics",
    "several nlp tasks",
    "translation",
    "e g chatgpt",
    "chatgpt",
    "several prompting designs",
    "eaprompt",
    "analysis"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.520/",
  "provenance": {
    "collected_at": "2025-06-05 10:55:42",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}