{
  "id": "2024.findings-acl.30",
  "title": "X}-Instruction: Aligning Language Model in Low-resource Languages with Self-curated Cross-lingual Instructions",
  "authors": [
    "Li, Chong  and\nYang, Wen  and\nZhang, Jiajun  and\nLu, Jinliang  and\nWang, Shaonan  and\nZong, Chengqing"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Large language models respond well in high-resource languages like English but struggle in low-resource languages. It may arise from the lack of high-quality instruction following data in these languages. Directly translating English samples into these languages can be a solution but unreliable, leading to responses with translation errors and lacking language-specific or cultural knowledge. To address this issue, we propose a novel method to construct cross-lingual instruction following samples with instruction in English and response in low-resource languages. Specifically, the language model first learns to generate appropriate English instructions according to the natural web texts in other languages as responses. The candidate cross-lingual instruction tuning samples are further refined and diversified. We have employed this method to build a large-scale cross-lingual instruction tuning dataset on 10 languages, namely X-Instruction. The instruction data built using our method incorporate more language-specific knowledge compared with the naive translation method. Experimental results have shown that the response quality of the model tuned on X-Instruction greatly exceeds the model distilled from a powerful teacher model, reaching or even surpassing the ones of ChatGPT. In addition, we find that models tuned on cross-lingual instruction following samples can follow the instruction in the output language without further tuning.",
  "keywords": [
    "we",
    "translation",
    "instruction",
    "cross",
    "natural",
    "it",
    "self",
    "chatgpt",
    "specifically the language model",
    "tuning",
    "language model",
    "-",
    "x",
    "translation errors",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.30/",
  "provenance": {
    "collected_at": "2025-06-05 10:49:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}