{
  "id": "2024.wassa-1.23",
  "title": "Loneliness Episodes: A {J}apanese Dataset for Loneliness Detection and Analysis",
  "authors": [
    "Fujikawa, Naoya  and\nNguyen, Quang Toan  and\nIto, Kazuhiro  and\nWakamiya, Shoko  and\nAramaki, Eiji"
  ],
  "year": "2024",
  "venue": "Proceedings of the 14th Workshop on Computational Approaches to Subjectivity, Sentiment, {\\&} Social Media Analysis",
  "abstract": "Loneliness, a significant public health concern, is closely connected to both physical and mental well-being. Hence, detection and intervention for individuals experiencing loneliness are crucial. Identifying loneliness in text is straightforward when it is explicitly stated but challenging when it is implicit. Detecting implicit loneliness requires a manually annotated dataset because whereas explicit loneliness can be detected using keywords, implicit loneliness cannot be. However, there are no freely available datasets with clear annotation guidelines for implicit loneliness. In this study, we construct a freely accessible Japanese loneliness dataset with annotation guidelines grounded in the psychological definition of loneliness. This dataset covers loneliness intensity and the contributing factors of loneliness. We train two models to classify whether loneliness is expressed and the intensity of loneliness. The model classifying loneliness versus non-loneliness achieves an F1-score of 0.833, but the model for identifying the intensity of loneliness has a low F1-score of 0.400, which is likely due to label imbalance and a shortage of a certain label in the dataset. We validate performance in another domain, specifically X (formerly Twitter), and observe a decrease. In addition, we propose improvement suggestions for domain adaptation.",
  "keywords": [
    "we",
    "a low f1-score",
    "it",
    "analysis",
    "an f1-score",
    "text",
    "model",
    "loneliness",
    "low",
    "straightforward",
    "guidelines",
    "models",
    "suggestions",
    "this dataset",
    "the contributing factors"
  ],
  "url": "https://aclanthology.org/2024.wassa-1.23/",
  "provenance": {
    "collected_at": "2025-06-05 11:11:53",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}