{
  "id": "2024.acl-long.217",
  "title": "Towards Real-world Scenario: Imbalanced New Intent Discovery",
  "authors": [
    "Zhang, Shun  and\nChaoran, Yan  and\nYang, Jian  and\nLiu, Jiaheng  and\nMo, Ying  and\nBai, Jiaqi  and\nLi, Tongliang  and\nLi, Zhoujun"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "New Intent Discovery (NID) aims at detecting known and previously undefined categories of user intent by utilizing limited labeled and massive unlabeled data. Most prior works often operate under the unrealistic assumption that the distribution of both familiar and new intent classes is uniform, overlooking the skewed and long-tailed distributions frequently encountered in real-world scenarios. To bridge the gap, our work introduces the imbalanced new intent discovery i-NID task, which seeks to identify familiar and novel intent categories within long-tailed distributions. A new benchmark baNID-Bench comprised of three datasets is created to simulate the real-world long-tail distributions. ImbaNID-Bench ranges from broad cross-domain to specific single-domain intent categories, providing a thorough representation of practical use cases. Besides, a robust baseline model ImbaNID is proposed to achieve cluster-friendly intent representations. It includes three stages: model pre-training, generation of reliable pseudo-labels, and robust representation learning that strengthens the model performance to handle the intricacies of real-world data distributions. Our extensive experiments on previous benchmarks and the newly established benchmark demonstrate the superior performance of ImbaNID in addressing the i-NID task, highlighting its potential as a powerful baseline for uncovering and categorizing user intents in imbalanced and long-tailed distributions.",
  "keywords": [
    "intricacies",
    "training",
    "cross",
    "friendly",
    "cluster",
    "it",
    "the intricacies",
    "learning",
    "categories",
    "-",
    "specific single-domain intent categories",
    "pre-training generation",
    "cluster-friendly intent representations",
    "work",
    "generation"
  ],
  "url": "https://aclanthology.org/2024.acl-long.217/",
  "provenance": {
    "collected_at": "2025-06-05 10:37:16",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}