{
  "id": "2024.acl-tutorials.5",
  "title": "Vulnerabilities of Large Language Models to Adversarial Attacks",
  "authors": [
    "Fu, Yu  and\nShayegan, Erfan  and\nAbdullah, Md. Mamun Al  and\nZaree, Pedram  and\nAbu-Ghazaleh, Nael  and\nDong, Yue"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 5: Tutorial Abstracts)",
  "abstract": "This tutorial serves as a comprehensive guide on the vulnerabilities of Large Language Models (LLMs) to adversarial attacks, an interdisciplinary field that blends perspectives from Natural Language Processing (NLP) and Cybersecurity. As LLMs become more complex and integrated into various systems, understanding their security attributes is crucial. However, current research indicates that even safety-aligned models are not impervious to adversarial attacks that can result in incorrect or harmful outputs. The tutorial first lays the foundation by explaining safety-aligned LLMs and concepts in cybersecurity. It then categorizes existing research based on different types of learning architectures and attack methods. We highlight the existing vulnerabilities of unimodal LLMs, multi-modal LLMs, and systems that integrate LLMs, focusing on adversarial attacks designed to exploit weaknesses and mislead AI systems. Finally, the tutorial delves into the potential causes of these vulnerabilities and discusses potential defense mechanisms.",
  "keywords": [
    "these vulnerabilities",
    "processing",
    "language",
    "nlp",
    "natural",
    "safety-aligned llms",
    "it",
    "vulnerabilities",
    "the existing vulnerabilities",
    "an interdisciplinary field",
    "large language models",
    "unimodal llms multi-modal llms",
    "field",
    "the vulnerabilities",
    "we"
  ],
  "url": "https://aclanthology.org/2024.acl-tutorials.5/",
  "provenance": {
    "collected_at": "2025-06-05 10:48:32",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}