{
  "id": "2024.acl-long.391",
  "title": "End-to-end Learning of Logical Rules for Enhancing Document-level Relation Extraction",
  "authors": [
    "Qi, Kunxun  and\nDu, Jianfeng  and\nWan, Hai"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Document-level relation extraction (DocRE) aims to extract relations between entities in a whole document. One of the pivotal challenges of DocRE is to capture the intricate interdependencies between relations of entity pairs. Previous methods have shown that logical rules can explicitly help capture such interdependencies. These methods either learn logical rules to refine the output of a trained DocRE model, or first learn logical rules from annotated data and then inject the learnt rules into a DocRE model using an auxiliary training objective. However, these learning pipelines may suffer from the issue of error propagation. To mitigate this issue, we proposeJoint Modeling Relation extraction and Logical rulesorJMRLfor short, a novel rule-based framework that jointly learns both a DocRE model and logical rules in an end-to-end fashion. Specifically, we parameterize a rule reasoning module in JMRL to simulate the inference of logical rules, thereby explicitly modeling the reasoning process. We also introduce an auxiliary loss and a residual connection mechanism in JMRL to better reconcile the DocRE model and the rule reasoning module. Experimental results on four benchmark datasets demonstrate that our proposed JMRL framework is consistently superior to existing rule-based frameworks, improving five baseline models for DocRE by a significant margin.",
  "keywords": [
    "end",
    "extraction",
    "we",
    "the intricate interdependencies",
    "such interdependencies",
    "training",
    "an auxiliary training objective",
    "loss",
    "learning",
    "interdependencies",
    "objective",
    "process",
    "model",
    "entities",
    "modeling"
  ],
  "url": "https://aclanthology.org/2024.acl-long.391/",
  "provenance": {
    "collected_at": "2025-06-05 10:39:40",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}