{
  "id": "2024.acl-long.848",
  "title": "COKE}: A Cognitive Knowledge Graph for Machine Theory of Mind",
  "authors": [
    "Wu, Jincenzi  and\nChen, Zhuang  and\nDeng, Jiawen  and\nSabour, Sahand  and\nMeng, Helen  and\nHuang, Minlie"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Theory of mind (ToM) refers to humans’ ability to understand and infer the desires, beliefs, and intentions of others. The acquisition of ToM plays a key role in humans’ social cognition and interpersonal relations. Though indispensable for social intelligence, ToM is still lacking for modern AI and NLP systems since they cannot access the human mental state and cognitive process beneath the training corpus. To empower AI systems with the ToM ability and narrow the gap between them and humans, in this paper, we propose COKE: the first cognitive knowledge graph for machine theory of mind. Specifically, COKE formalizes ToM as a collection of 45k+ manually verified cognitive chains that characterize human mental activities and subsequent behavioral/affective responses when facing specific social circumstances. In addition, we further generalize COKE using LLMs and build a powerful generation model COLM tailored for cognitive reasoning. Experimental results in both automatic and human evaluation demonstrate the high quality of COKE, the superior ToM ability of COLM, and its potential to significantly enhance social applications.",
  "keywords": [
    "manually verified cognitive chains",
    "a powerful generation model",
    "we",
    "graph",
    "training",
    "human mental activities",
    "a cognitive knowledge graph",
    "llms",
    "beliefs",
    "activities",
    "process",
    "knowledge",
    "generation",
    "nlp",
    "model"
  ],
  "url": "https://aclanthology.org/2024.acl-long.848/",
  "provenance": {
    "collected_at": "2025-06-05 10:45:58",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}