{
  "id": "2024.findings-acl.925",
  "title": "Hire a Linguist!: Learning Endangered Languages in {LLM}s with In-Context Linguistic Descriptions",
  "authors": [
    "Zhang, Kexun  and\nChoi, Yee  and\nSong, Zhenqiao  and\nHe, Taiqi  and\nWang, William Yang  and\nLi, Lei"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "How can large language models (LLMs) process and translate endangered languages? Many languages lack a large corpus to train a decent LLM; therefore existing LLMs rarely perform well in unseen, endangered languages. On the contrary, we observe that 2000 endangered languages, though without a large corpus, have a grammar book or a dictionary. We propose LingoLLM, a training-free approach to enable an LLM to process unseen languages that hardly occur in its pre-training. Our key insight is to demonstrate linguistic knowledge of an unseen language in an LLM’s prompt, including a dictionary, a grammar book, and morphologically analyzed input text. We implement LingoLLM on top of two models, GPT-4 and Mixtral, and evaluate their performance on 5 tasks across 8 endangered or low-resource languages. Our results show that LingoLLM elevates translation capability from GPT-4’s 0 to 10.5 BLEU for 10 language directions. Our findings demonstrate the tremendous value of linguistic knowledge in the age of LLMs for endangered languages. Our data, code, and model generations will be released to the public. Our data, code, and model generations can be found athttps://github.com/LLiLab/llm4endangeredlang.",
  "keywords": [
    "code",
    "top",
    "an llm",
    "bleu",
    "translation capability",
    "we",
    "llm",
    "training",
    "translation",
    "an llm s prompt",
    "llms",
    "prompt",
    "s",
    "text",
    "gpt-4"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.925/",
  "provenance": {
    "collected_at": "2025-06-05 11:01:13",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}