{
  "id": "2024.acl-long.711",
  "title": "Beyond Orthography: Automatic Recovery of Short Vowels and Dialectal Sounds in {A}rabic",
  "authors": [
    "El Kheir, Yassine  and\nMubarak, Hamdy  and\nAli, Ahmed  and\nChowdhury, Shammur"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "This paper presents a novel Dialectal Sound and Vowelization Recovery framework, designed to recognize borrowed and dialectal sounds within phonologically diverse and dialect-rich languages, that extends beyond its standard orthographic sound sets. The proposed framework utilized quantized sequence of input with(out) continuous pretrained self-supervised representation. We show the efficacy of the pipeline using limited data for Arabic, a dialect-rich language containing more than 22 major dialects. Phonetically correct transcribed speech resources for dialectal Arabic is scare. Therefore, we introduce ArabVoice15, a first of its kind, curated test set featuring 5 hours of dialectal speech across 15 Arab countries, with phonetically accurate transcriptions, including borrowed and dialect-specific sounds. We described in detail the annotation guideline along with the analysis of the dialectal confusion pairs. Our extensive evaluation includes both subjective – human perception tests and objective measures. Our empirical results, reported with three test sets, show that with only one and half hours of training data, our model improve character error rate by ≈7% in ArabVoice15 compared to the baseline.",
  "keywords": [
    "rate",
    "objective measures",
    "we",
    "confusion",
    "training",
    "self",
    "15 arab countries",
    "rich",
    "sequence",
    "analysis",
    "objective",
    "our extensive evaluation",
    "countries",
    "language",
    "model"
  ],
  "url": "https://aclanthology.org/2024.acl-long.711/",
  "provenance": {
    "collected_at": "2025-06-05 10:44:06",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}