{
  "id": "2024.findings-acl.252",
  "title": "E2-{LLM}: Efficient and Extreme Length Extension of Large Language Models",
  "authors": [
    "Liu, Jiaheng  and\nZhiqiBai, ZhiqiBai  and\nZhang, Yuanxing  and\nZhang, Chenchen  and\nYuangZh, YuangZh  and\nZhang, Ge  and\nJiakaiWang, JiakaiWang  and\nQue, Haoran  and\nChen, Yukang  and\nSu, Wenbo  and\nGe, Tiezheng  and\nFu, Jie  and\nChen, Wenhu  and\nZheng, Bo"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Training Large Language Models (LLMs) to process extensive context lengths incurs prohibitive computational costs. Prevailing techniques for extending context capabilities in LLMs typically require not only additional training procedures but also access to datasets with long context (e.g., sequences of 32K tokens), presupposing substantial GPU expenditures. To address the aforementioned issues, we introduce a novel solution named Efficient and Extreme length extension for Large Language Models (E2-LLM). E2-LLM entails a singular training process over considerably short sequences (e.g., 4K tokens), which greatly mitigates the cost of continual-pretraining or fine-tuning. Within the training phase, we incorporate a dual augmentation strategy with Rotary Position Embeddings (RoPE) that adjusts the scale and position indices across distinct training samples. E 2 -LLM is meticulously designed to enhance the model’s robustness to diverse relative positions. The experimental results on multiple benchmark datasets demonstrate the superior performance of E 2 -LLM on demanding tasks of processing long contexts.",
  "keywords": [
    "rotary position embeddings rope",
    "context capabilities",
    "efficient",
    "we",
    "llm",
    "training",
    "e",
    "llms",
    "tuning",
    "processing",
    "continual-pretraining or fine-tuning",
    "embeddings",
    "process",
    "language",
    "model"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.252/",
  "provenance": {
    "collected_at": "2025-06-05 10:52:03",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}