{
  "id": "2024.climatenlp-1.1",
  "title": "Climate Policy Transformer: Utilizing {NLP} to track the coherence of Climate Policy Documents in the Context of the {P}aris Agreement",
  "authors": [
    "Singh, Prashant  and\nLehmann, Erik  and\nTyrrell, Mark"
  ],
  "year": "2024",
  "venue": "Proceedings of the 1st Workshop on Natural Language Processing Meets Climate Change (ClimateNLP 2024)",
  "abstract": "Climate policy implementation is pivotal inglobal efforts to mitigate and adapt to climatechange. In this context, this paper explores theuse of Natural Language Processing (NLP) as atool for policy advisors to efficiently track andassess climate policy and strategies, such asNationally Determined Contributions (NDCs).These documents are essential for monitoringcoherence with the Paris Agreement, yet theiranalysis traditionally demands significant la-bor and time. We demonstrate how to leverageNLP on existing climate policy databases totransform this process by structuring informa-tion extracted from these otherwise unstruc-tured policy documents and opening avenuesfor a more in-depth analysis of national and re-gional policies. Central to our approach is thecreation of a machine-learning (ML) dataset’CPo-CD’, based on data provided by the Inter-national Climate Initiative (IKI) and ClimateWatch (CW). The CPo-CD dataset is utilizedto fine-tune Transformer Models on classify-ing climate targets, actions, policies, and plans,along with their sector, mitigation-adaptation,and greenhouse gas (GHG) components. Wepublish our model and dataset on a HuggingFace repository.",
  "keywords": [
    "we",
    "natural language processing nlp",
    "ing",
    "informa",
    "natural",
    "policies",
    "learning",
    "national and re-gional policies",
    "utilizedto fine-tune transformer models",
    "analysis",
    "processing",
    "strategies",
    "fine",
    "climate policy transformer",
    "transformer"
  ],
  "url": "https://aclanthology.org/2024.climatenlp-1.1/",
  "provenance": {
    "collected_at": "2025-06-05 11:05:09",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}