{
  "id": "2024.acl-long.766",
  "title": "Multistage Collaborative Knowledge Distillation from a Large Language Model for Semi-Supervised Sequence Generation",
  "authors": [
    "Zhao, Jiachen  and\nZhao, Wenlong  and\nDrozdov, Andrew  and\nRozonoyer, Benjamin  and\nSultan, Md Arafat  and\nLee, Jay-Yoon  and\nIyyer, Mohit  and\nMcCallum, Andrew"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "We study semi-supervised sequence generation tasks, where the few labeled examples are too scarce to finetune a model, and meanwhile, few-shot prompted large language models (LLMs) exhibit room for improvement. In this paper, we present the discovery that a student model distilled from a few-shot prompted LLM can commonly generalize better than its teacher to unseen examples on such tasks. We find that the student is able to learn a general pattern from the high-quality pseudolabels produced by the teacher during knowledge distillation (KD), and favorably not a general pattern from the low-quality pseudolabels. Leveraging this discovery, we propose a new method, Multistage Collaborative Knowledge Distillation from an LLM (MCKD), for these tasks. MCKD first few-shot prompts an LLM to produce pseudolabels for unlabeled data. Then at each stage of an iterative KD process, a new pair of students is trained on disjoint partitions of the pseudolabeled data, and produces new and improved pseudolabels for their unseen partitions. We conduct extensive experiments on four syntactic and semantic parsing datasets and show the effectiveness of MCKD for low-resource semi-supervised sequence generation. On CRAFT biomedical parsing, for example, 3-stage MCKD with 50 labeled examples outperforms an LLM teacher and vanilla KD by 7.5% and 3.7% parsing F1, respectively, and matches the performance of supervised finetuning with 500 labeled examples.",
  "keywords": [
    "parsing",
    "an llm",
    "prompted llm",
    "semantic",
    "we",
    "a general pattern",
    "craft biomedical parsing",
    "low-resource semi-supervised sequence generation",
    "llm",
    "shot",
    "an llm mckd",
    "sequence",
    "a large language model",
    "meanwhile few-shot",
    "an llm teacher"
  ],
  "url": "https://aclanthology.org/2024.acl-long.766/",
  "provenance": {
    "collected_at": "2025-06-05 10:44:51",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}