{
  "id": "2024.acl-long.46",
  "title": "Interactive Text-to-Image Retrieval with Large Language Models: A Plug-and-Play Approach",
  "authors": [
    "Lee, Saehyung  and\nYu, Sangwon  and\nPark, Junsung  and\nYi, Jihun  and\nYoon, Sungroh"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "In this paper, we primarily address the issue of dialogue-form context query within the interactive text-to-image retrieval task. Our methodology, PlugIR, actively utilizes the general instruction-following capability of LLMs in two ways. First, by reformulating the dialogue-form context, we eliminate the necessity of fine-tuning a retrieval model on existing visual dialogue data, thereby enabling the use of any arbitrary black-box model. Second, we construct the LLM questioner to generate non-redundant questions about the attributes of the target image, based on the information of retrieval candidate images in the current context. This approach mitigates the issues of noisiness and redundancy in the generated questions. Beyond our methodology, we propose a novel evaluation metric, Best log Rank Integral (BRI), for a comprehensive assessment of the interactive retrieval system. PlugIR demonstrates superior performance compared to both zero-shot and fine-tuned baselines in various benchmarks. Additionally, the two methodologies comprising PlugIR can be flexibly applied together or separately in various situations.",
  "keywords": [
    "the general instruction-following capability",
    "form",
    "the generated questions",
    "we",
    "dialogue",
    "a retrieval model",
    "the llm questioner",
    "current",
    "llm",
    "shot",
    "instruction",
    "retrieval",
    "information",
    "visual",
    "dialogue-form context query"
  ],
  "url": "https://aclanthology.org/2024.acl-long.46/",
  "provenance": {
    "collected_at": "2025-06-05 10:34:55",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}