{
  "id": "2024.findings-acl.643",
  "title": "i{S}ign: A Benchmark for {I}ndian {S}ign {L}anguage Processing",
  "authors": [
    "Joshi, Abhinav  and\nMohanty, Romit  and\nKanakanti, Mounika  and\nMangla, Andesha  and\nChoudhary, Sudeep  and\nBarbate, Monali  and\nModi, Ashutosh"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Indian Sign Language has limited resources for developing machine learning and data-driven approaches for automated language processing. Though text/audio-based language processing techniques have shown colossal research interest and tremendous improvements in the last few years, Sign Languages still need to catch up due to the need for more resources. To bridge this gap, in this work, we proposeiSign: a benchmark for Indian Sign Language (ISL) Processing. We make three primary contributions to this work. First, we release one of the largest ISL-English datasets with more than video-sentence/phrase pairs. To the best of our knowledge, it is the largest sign language dataset available for ISL. Second, we propose multiple NLP-specific tasks (including SignVideo2Text, SignPose2Text, Text2Pose, Word Prediction, and Sign Semantics) and benchmark them with the baseline models for easier access to the research community. Third, we provide detailed insights into the proposed benchmarks with a few linguistic insights into the working of ISL. We streamline the evaluation of Sign Language processing, addressing the gaps in the NLP research community for Sign Languages. We release the dataset, tasks and models via the following website: https://exploration-lab.github.io/iSign/",
  "keywords": [
    "we",
    "semantics",
    "it",
    "anguage",
    "machine learning",
    "word",
    "learning",
    "processing",
    "i",
    "ign",
    "text",
    "easier access",
    "easier",
    "work",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.643/",
  "provenance": {
    "collected_at": "2025-06-05 10:57:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}