{
  "id": "2024.privatenlp-1.14",
  "title": "Improving Authorship Privacy: Adaptive Obfuscation with the Dynamic Selection of Techniques",
  "authors": [
    "Kandula, Hemanth  and\nKarakos, Damianos  and\nQiu, Haoling  and\nUlicny, Brian"
  ],
  "year": "2024",
  "venue": "Proceedings of the Fifth Workshop on Privacy in Natural Language Processing",
  "abstract": "Authorship obfuscation, the task of rewriting text to protect the original author’s identity, is becoming increasingly important due to the rise of advanced NLP tools for authorship attribution techniques. Traditional methods for authorship obfuscation face significant challenges in balancing content preservation, fluency, and style concealment. This paper introduces a novel approach, the Obfuscation Strategy Optimizer (OSO), which dynamically selects the optimal obfuscation technique based on a combination of metrics including embedding distance, meaning similarity, and fluency. By leveraging an ensemble of language models OSO achieves superior performance in preserving the original content’s meaning and grammatical fluency while effectively concealing the author’s unique writing style. Experimental results demonstrate that the OSO outperforms existing methods and approaches the performance of larger language models. Our evaluation framework incorporates adversarial testing against state-of-the-art attribution systems to validate the robustness of the obfuscation techniques. We release our code publicly at https://github.com/BBN-E/ObfuscationStrategyOptimizer",
  "keywords": [
    "code",
    "our evaluation framework",
    "we",
    "ensemble",
    "advanced nlp tools",
    "an ensemble",
    "text",
    "metrics",
    "language models",
    "larger language models",
    "embedding distance",
    "language",
    "nlp",
    "evaluation",
    "approach"
  ],
  "url": "https://aclanthology.org/2024.privatenlp-1.14/",
  "provenance": {
    "collected_at": "2025-06-05 11:09:11",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}