{
  "id": "2024.findings-acl.147",
  "title": "S}em{R}el2024: A Collection of Semantic Textual Relatedness Datasets for 13 Languages",
  "authors": [
    "Ousidhoum, Nedjma  and\nMuhammad, Shamsuddeen  and\nAbdalla, Mohamed  and\nAbdulmumin, Idris  and\nAhmad, Ibrahim  and\nAhuja, Sanchit  and\nAji, Alham  and\nAraujo, Vladimir  and\nAyele, Abinew  and\nBaswani, Pavan  and\nBeloucif, Meriem  and\nBiemann, Chris  and\nBourhim, Sofia  and\nKock, Christine  and\nDekebo, Genet  and\nHourrane, Oumaima  and\nKanumolu, Gopichand  and\nMadasu, Lokesh  and\nRutunda, Samuel  and\nShrivastava, Manish  and\nSolorio, Thamar  and\nSurange, Nirmal  and\nTilaye, Hailegnaw  and\nVishnubhotla, Krishnapriya  and\nWinata, Genta  and\nYimam, Seid  and\nMohammad, Saif"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Exploring and quantifying semantic relatedness is central to representing language and holds significant implications across various NLP tasks. While earlier NLP research primarily focused on semantic similarity, often within the English language context, we instead investigate the broader phenomenon of semantic relatedness. In this paper, we presentSemRel, a new semantic relatedness dataset collection annotated by native speakers across 13 languages:Afrikaans, Algerian Arabic, Amharic, English, Hausa, Hindi, Indonesian, Kinyarwanda, Marathi, Moroccan Arabic, Modern Standard Arabic, Spanish,andTelugu. These languages originate from five distinct language families and are predominantly spoken in Africa and Asia – regions characterised by a relatively limited availability of NLP resources. Each instance in the SemRel datasets is a sentence pair associated with a score that represents the degree of semantic textual relatedness between the two sentences. The scores are obtained using a comparative annotation framework. We describe the data collection and annotation processes, challenges when building the datasets, baseline experiments, and their impact and utility in NLP.",
  "keywords": [
    "families",
    "em",
    "semantic textual relatedness",
    "semantic",
    "we",
    "semantic similarity",
    "earlier nlp research",
    "nlp resources",
    "semantic relatedness",
    "five distinct language families",
    "language",
    "nlp",
    "semantic textual relatedness datasets",
    "various nlp tasks",
    "implications"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.147/",
  "provenance": {
    "collected_at": "2025-06-05 10:50:36",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}