{
  "id": "2024.wassa-1.39",
  "title": "hyy33 at {WASSA} 2024 Empathy and Personality Shared Task: Using the {C}ombined{L}oss and {FGM} for Enhancing {BERT}-based Models in Emotion and Empathy Prediction from Conversation Turns",
  "authors": [
    "Yang, Huiyu  and\nHuang, Liting  and\nLi, Tian  and\nRusnachenko, Nicolay  and\nLiang, Huizhi"
  ],
  "year": "2024",
  "venue": "Proceedings of the 14th Workshop on Computational Approaches to Subjectivity, Sentiment, {\\&} Social Media Analysis",
  "abstract": "This paper presents our participation to the WASSA 2024 Shared Task on Empathy Detection and Emotion Classification and Personality Detection in Interactions. We focus on Track 2: Empathy and Emotion Prediction in Conversations Turns (CONV-turn), which consists of predicting the perceived empathy, emotion polarity and emotion intensity at turn level in a conversation. In the method, we conduct BERT and DeBERTa based finetuning, implement the CombinedLoss which consists of a structured contrastive loss and Pearson loss, adopt adversarial training using Fast Gradient Method (FGM). This method achieved Pearson correlation of 0.581 for Emotion,0.644 for Emotional Polarity and 0.544 for Empathy on the test set, with the average value of 0.590 which ranked 4th among all teams. After submission to WASSA 2024 competition, we further introduced the segmented mix-up for data augmentation, boosting for ensemble and regression experiments, which yield even better results: 0.6521 for Emotion, 0.7376 for EmotionalPolarity, 0.6326 for Empathy in Pearson correlation on the development set. The implementation and fine-tuned models are publicly-available at https://github.com/hyy-33/hyy33-WASSA-2024-Track-2.",
  "keywords": [
    "deberta",
    "a conversation",
    "conversations",
    "we",
    "training",
    "classification",
    "ensemble",
    "fast gradient method",
    "oss",
    "loss",
    "bert -based models",
    "bert",
    "fast",
    "gradient",
    "conversation"
  ],
  "url": "https://aclanthology.org/2024.wassa-1.39/",
  "provenance": {
    "collected_at": "2025-06-05 11:12:06",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}