{
  "id": "2024.argmining-1.14",
  "title": "Overview of {P}erpective{A}rg2024 The First Shared Task on Perspective Argument Retrieval",
  "authors": [
    "Falk, Neele  and\nWaldis, Andreas  and\nGurevych, Iryna"
  ],
  "year": "2024",
  "venue": "Proceedings of the 11th Workshop on Argument Mining (ArgMining 2024)",
  "abstract": "Argument retrieval is the task of finding relevant arguments for a given query. While existing approaches rely solely on the semantic alignment of queries and arguments, this first shared task on perspective argument retrieval incorporates perspectives during retrieval, ac- counting for latent influences in argumenta- tion. We present a novel multilingual dataset covering demographic and socio-cultural (so- cio) variables, such as age, gender, and politi- cal attitude, representing minority and major- ity groups in society. We distinguish between three scenarios to explore how retrieval systems consider explicitly (in both query and corpus) and implicitly (only in query) formulated per- spectives. This paper provides an overview of this shared task and summarizes the results of the six submitted systems. We find substantial challenges in incorporating perspectivism, especially when aiming for personalization based solely on the text of arguments without explicitly providing socio profiles. Moreover, re- trieval systems tend to be biased towards the majority group but partially mitigate bias for the female gender. While we bootstrap per- spective argument retrieval, further research is essential to optimize retrieval systems to facilitate personalization and reduce polarization.",
  "keywords": [
    "bias",
    "trieval",
    "overview",
    "semantic",
    "we",
    "cal",
    "ity",
    "queries",
    "the semantic alignment",
    "an overview",
    "perspective argument retrieval",
    "retrieval",
    "latent",
    "re-",
    "text"
  ],
  "url": "https://aclanthology.org/2024.argmining-1.14/",
  "provenance": {
    "collected_at": "2025-06-05 11:03:49",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}