{
  "id": "2024.findings-acl.469",
  "title": "Language models emulate certain cognitive profiles: An investigation of how predictability measures interact with individual differences",
  "authors": [
    "Haller, Patrick  and\nBolliger, Lena  and\nJ{\\\"a}ger, Lena"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "To date, most investigations on surprisal and entropy effects in reading have been conducted on the group level, disregarding individual differences. In this work, we revisit the predictive power (PP) of different LMs’ surprisal and entropy measures on data of human reading times as a measure of processing effort by incorporating information of language users’ cognitive capacities. To do so, we assess the PP of surprisal and entropy estimated from generative language models (LMs) on reading data obtained from individuals who also completed a wide range of psychometric tests.Specifically, we investigate if modulating surprisal and entropy relative to cognitive scores increases prediction accuracy of reading times, and we examine whether LMs exhibit systematic biases in the prediction of reading times for cognitively high- or low-performing groups, revealing what type of psycholinguistic subjects a given LM emulates.Our study finds that in most cases, incorporating cognitive capacities increases predictive power of surprisal and entropy on reading times, and that generally, high performance in the psychometric tests is associated with lower sensitivity to predictability effects. Finally, our results suggest that the analyzed LMs emulate readers with lower verbal intelligence, suggesting that for a given target group (i.e., individuals with high verbal intelligence), these LMs provide less accurate predictability effect estimates.",
  "keywords": [
    "prediction accuracy",
    "we",
    "generally high performance",
    "cognitive capacities",
    "generative language models lms",
    "information",
    "e",
    "generative",
    "processing",
    "language models",
    "systematic biases",
    "capacities",
    "biases",
    "accuracy",
    "work"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.469/",
  "provenance": {
    "collected_at": "2025-06-05 10:55:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}