{
  "id": "2024.acl-long.178",
  "title": "Unified Hallucination Detection for Multimodal Large Language Models",
  "authors": [
    "Chen, Xiang  and\nWang, Chenxi  and\nXue, Yida  and\nZhang, Ningyu  and\nYang, Xiaoyan  and\nLi, Qiang  and\nShen, Yue  and\nLiang, Lei  and\nGu, Jinjie  and\nChen, Huajun"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Despite significant strides in multimodal tasks, Multimodal Large Language Models (MLLMs) are plagued by the critical issue of hallucination. The reliable detection of such hallucinations in MLLMs has, therefore, become a vital aspect of model evaluation and the safeguarding of practical application deployment. Prior research in this domain has been constrained by a narrow focus on singular tasks, an inadequate range of hallucination categories addressed, and a lack of detailed granularity. In response to these challenges, our work expands the investigative horizons of hallucination detection. We present a novel meta-evaluation benchmark, MHaluBench, meticulously crafted to facilitate the evaluation of advancements in hallucination detection methods. Additionally, we unveil a novel unified multimodal hallucination detection framework, UNIHD, which leverages a suite of auxiliary tools to validate the occurrence of hallucinations robustly. We demonstrate the effectiveness of UNIHD through meticulous evaluation and comprehensive analysis. We also provide strategic insights on the application of specific tools for addressing various categories of hallucinations.",
  "keywords": [
    "meticulous evaluation",
    "hallucination categories",
    "we",
    "various categories",
    "unified hallucination detection",
    "large language models mllms",
    "analysis",
    "model evaluation",
    "categories",
    "work",
    "mllms",
    "language",
    "model",
    "evaluation",
    "multimodal large language models"
  ],
  "url": "https://aclanthology.org/2024.acl-long.178/",
  "provenance": {
    "collected_at": "2025-06-05 10:36:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}