{
  "id": "2024.findings-acl.578",
  "title": "B}ook2{D}ial: Generating Teacher Student Interactions from Textbooks for Cost-Effective Development of Educational Chatbots",
  "authors": [
    "Wang, Junling  and\nMacina, Jakub  and\nDaheim, Nico  and\nPal Chowdhury, Sankalan  and\nSachan, Mrinmaya"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Educational chatbots are a promising tool for assisting student learning. However, the development of effective chatbots in education has been challenging, as high-quality data is seldom available in this domain. In this paper, we propose a framework for generating synthetic teacher-student interactions grounded in a set of textbooks. Our approaches capture a key aspect of learning interactions where curious students with partial knowledge interactively ask teachers questions about the material in the textbook. We highlight various quality criteria that such dialogues must fulfill and compare several approaches relying on either prompting or finetuning large language models according to these criteria. We use the synthetic dialogues to train educational chatbots and show the benefits of further fine-tuning in educational domains. However, careful human evaluation shows that our best data synthesis method still suffers from hallucinations and tends to reiterate information from previous conversations. Our findings offer insights for future efforts in synthesizing conversational data that strikes a balance between size and quality. We will open-source our data and code.",
  "keywords": [
    "code",
    "however careful human evaluation",
    "educational chatbots",
    "the synthetic dialogues",
    "conversations",
    "we",
    "ial",
    "information",
    "such dialogues",
    "effective chatbots",
    "chatbots",
    "previous conversations",
    "knowledge",
    "generating",
    "language"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.578/",
  "provenance": {
    "collected_at": "2025-06-05 10:56:30",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}