{
  "id": "2024.textgraphs-1.4",
  "title": "Financial Product Ontology Population with Large Language Models",
  "authors": [
    "Saetia, Chanatip  and\nPhruetthiset, Jiratha  and\nChalothorn, Tawunrat  and\nLertsutthiwong, Monchai  and\nTaerungruang, Supawat  and\nBuabthong, Pakpoom"
  ],
  "year": "2024",
  "venue": "Proceedings of TextGraphs-17: Graph-based Methods for Natural Language Processing",
  "abstract": "Ontology population, which aims to extract structured data to enrich domain-specific ontologies from unstructured text, typically faces challenges in terms of data scarcity and linguistic complexity, particularly in specialized fields such as retail banking. In this study, we investigate the application of large language models (LLMs) to populate domain-specific ontologies of retail banking products from Thai corporate documents. We compare traditional span-based approaches to LLMs-based generative methods, with different prompting techniques. Our findings reveal that while span-based methods struggle with data scarcity and the complex linguistic structure, LLMs-based generative approaches substantially outperform, achieving a 61.05% F1 score, with the most improvement coming from providing examples in the prompts. This improvement highlights the potential of LLMs for ontology population tasks, offering a scalable and efficient solution for structured information extraction in especially in low-resource language settings.",
  "keywords": [
    "extraction",
    "efficient",
    "llms-based generative methods",
    "we",
    "fields",
    "ontology population tasks",
    "domain-specific ontologies",
    "structured information extraction",
    "ontologies",
    "information",
    "the prompts",
    "different prompting techniques",
    "specialized fields",
    "llms",
    "generative"
  ],
  "url": "https://aclanthology.org/2024.textgraphs-1.4/",
  "provenance": {
    "collected_at": "2025-06-05 11:11:24",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}