{
  "id": "2024.acl-long.227",
  "title": "Multi-Level Feedback Generation with Large Language Models for Empowering Novice Peer Counselors",
  "authors": [
    "Chaszczewicz, Alicja  and\nShah, Raj  and\nLouie, Ryan  and\nArnow, Bruce  and\nKraut, Robert  and\nYang, Diyi"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Realistic practice and tailored feedback are key processes for training peer counselors with clinical skills. However, existing mechanisms of providing feedback largely rely on human supervision. Peer counselors often lack mechanisms to receive detailed feedback from experienced mentors, making it difficult for them to support the large number of people with mental health issues who use peer counseling. Our work aims to leverage large language models to provide contextualized and multi-level feedback to empower peer counselors, especially novices, at scale. To achieve this, we co-design with a group of senior psychotherapy supervisors to develop a multi-level feedback taxonomy, and then construct a publicly available dataset with comprehensive feedback annotations of 400 emotional support conversations. We further design a self-improvement method on top of large language models to enhance the automatic generation of feedback. Via qualitative and quantitative evaluation with domain experts, we demonstrate that our method minimizes the risk of potentially harmful and low-quality feedback generation which is desirable in such high-stakes scenarios.",
  "keywords": [
    "top",
    "support",
    "feedback",
    "conversations",
    "we",
    "training",
    "it",
    "self",
    "multi-level feedback generation",
    "the automatic generation",
    "-",
    "experienced",
    "experienced mentors",
    "work",
    "generation"
  ],
  "url": "https://aclanthology.org/2024.acl-long.227/",
  "provenance": {
    "collected_at": "2025-06-05 10:37:24",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}