{
  "id": "2024.acl-long.40",
  "title": "FOFO}: A Benchmark to Evaluate {LLM}s' Format-Following Capability",
  "authors": [
    "Xia, Congying  and\nXing, Chen  and\nDu, Jiangshu  and\nYang, Xinyi  and\nFeng, Yihao  and\nXu, Ran  and\nYin, Wenpeng  and\nXiong, Caiming"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "This paper presents FoFo, a pioneering benchmark for evaluating large language models’ (LLMs) ability to follow complex, domain-specific formats, a crucial yet under-examined capability for their application as AI agents. Despite LLMs’ advancements, existing benchmarks fail to assess their format-following proficiency adequately. FoFo fills this gap with a diverse range of real-world formats and instructions, developed through an AI-Human collaborative method. Our evaluation across both open-source (e.g., Llama 2, WizardLM) and closed-source (e.g., GPT-4, PALM2, Gemini) LLMs highlights three key findings: open-source models significantly lag behind closed-source ones in format adherence; LLMs’ format-following performance is independent of their content generation quality; and LLMs’ format proficiency varies across different domains. These insights suggest the need for specialized tuning for format-following skills and highlight FoFo’s role in guiding the selection of domain-specific AI agents. FoFo will be publicly released, contributing a critical tool for advancing LLM evaluation and application.",
  "keywords": [
    "their format-following proficiency",
    "llm",
    "gemini llms",
    "format",
    "llms",
    "tuning",
    "llms advancements",
    "gpt-4",
    "llm s format-following capability",
    "llm evaluation",
    "our evaluation",
    "proficiency",
    "language",
    "generation",
    "human"
  ],
  "url": "https://aclanthology.org/2024.acl-long.40/",
  "provenance": {
    "collected_at": "2025-06-05 10:34:50",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}