{
  "id": "2024.iwslt-1.12",
  "title": "The {SETU}-{DCU} Submissions to {IWSLT} 2024 Low-Resource Speech-to-Text Translation Tasks",
  "authors": [
    "Zafar, Maria  and\nCastaldo, Antonio  and\nNayak, Prashanth  and\nHaque, Rejwanul  and\nGajakos, Neha  and\nWay, Andy"
  ],
  "year": "2024",
  "venue": "Proceedings of the 21st International Conference on Spoken Language Translation (IWSLT 2024)",
  "abstract": "Natural Language Processing (NLP) research and development has experienced rapid progression in the recent times due to advances in deep learning. The introduction of pre-trained large language models (LLMs) is at the core of this transformation, significantly enhancing the performance of machine translation (MT) and speech technologies. This development has also led to fundamental changes in modern translation and speech tools and their methodologies. However, there remain challenges when extending this progress to underrepresented dialects and low-resource languages, primarily due to the need for more data. This paper details our submissions to the IWSLT speech translation (ST) tasks. We used the Whisper model for the automatic speech recognition (ASR) component. We then used mBART and NLLB as cascaded systems for utilising their MT capabilities. Our research primarily focused on exploring various dialects of low-resource languages and harnessing existing resources from linguistically related languages. We conducted our experiments for two morphologically diverse language pairs: Irish-to-English and Maltese-to-English. We used BLEU, chrF and COMET for evaluating our MT models.",
  "keywords": [
    "deep",
    "bleu",
    "the iwslt speech translation",
    "we",
    "their methodologies",
    "their mt capabilities",
    "translation",
    "natural",
    "modern translation",
    "technologies",
    "core",
    "llms",
    "processing",
    "text",
    "bleu chrf"
  ],
  "url": "https://aclanthology.org/2024.iwslt-1.12/",
  "provenance": {
    "collected_at": "2025-06-05 11:06:39",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}