{
  "id": "2024.arabicnlp-1.79",
  "title": "NADI} 2024: The Fifth Nuanced {A}rabic Dialect Identification Shared Task",
  "authors": [
    "Abdul-Mageed, Muhammad  and\nKeleg, Amr  and\nElmadany, AbdelRahim  and\nZhang, Chiyu  and\nHamed, Injy  and\nMagdy, Walid  and\nBouamor, Houda  and\nHabash, Nizar"
  ],
  "year": "2024",
  "venue": "Proceedings of the Second Arabic Natural Language Processing Conference",
  "abstract": "We describe the findings of the fifth Nuanced Arabic Dialect Identification Shared Task (NADI 2024). NADI’s objective is to help advance SoTA Arabic NLP by providing guidance, datasets, modeling opportunities, and standardized evaluation conditions that allow researchers to collaboratively compete on prespecified tasks. NADI 2024 targeted both dialect identification cast as a multi-label task (Subtask 1), identification of the Arabic level of dialectness (Subtask 2), and dialect-to-MSA machine translation (Subtask 3). A total of 51 unique teams registered for the shared task, of whom 12 teams have participated (with 76 valid submissions during the test phase). Among these, three teams participated in Subtask 1, three in Subtask 2, and eight in Subtask 3. The winning teams achieved 50.57 F1 on Subtask 1, 0.1403 RMSE for Subtask 2, and 20.44 BLEU in Subtask 3, respectively. Results show that Arabic dialect processing tasks such as dialect identification and machine translation remain challenging. We describe the methods employed by the participating teams and briefly offer an outlook for NADI.",
  "keywords": [
    "standardized evaluation conditions",
    "processing",
    "nlp",
    "opportunities",
    "machine",
    "objective",
    "nadi s objective",
    "bleu",
    "modeling",
    "machine translation",
    "we",
    "valid",
    "evaluation",
    "prespecified tasks nadi",
    "50 57 f1"
  ],
  "url": "https://aclanthology.org/2024.arabicnlp-1.79/",
  "provenance": {
    "collected_at": "2025-06-05 11:03:15",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}