{
  "id": "2024.findings-acl.893",
  "title": "From One to Many: Expanding the Scope of Toxicity Mitigation in Language Models",
  "authors": [
    "Ermis, Beyza  and\nPozzobon, Luiza  and\nHooker, Sara  and\nLewis, Patrick"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "To date, toxicity mitigation in language models has almost entirely been focused on single-language settings. As language models embrace multilingual capabilities, it’s crucial our safety measures keep pace. Recognizing this research gap, our approach expands the scope of conventional toxicity mitigation to address the complexities presented by multiple languages. In the absence of sufficient annotated datasets across languages, we employ translated data to evaluate and enhance our mitigation techniques. We also compare finetuning mitigation approaches against retrieval-augmented techniques under both static and continual toxicity mitigation scenarios. This allows us to examine the effects of translation quality and the cross-lingual transfer on toxicity mitigation. We also explore how model size and data quantity affect the success of these mitigation efforts. Covering nine languages, our study represents a broad array of linguistic families and levels of resource availability, ranging from high to mid-resource languages. Through comprehensive experiments, we provide insights into the complexities of multilingual toxicity mitigation, offering valuable insights and paving the way for future research in this increasingly important field.",
  "keywords": [
    "families",
    "field",
    "multilingual capabilities",
    "we",
    "complexities",
    "translation",
    "cross",
    "it",
    "this increasingly important field",
    "retrieval",
    "sufficient annotated datasets",
    "sufficient",
    "transfer",
    "the complexities",
    "language models"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.893/",
  "provenance": {
    "collected_at": "2025-06-05 11:00:46",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}