{
  "id": "2024.acl-long.682",
  "title": "Classist Tools: Social Class Correlates with Performance in {NLP",
  "authors": [
    "Cercas Curry, Amanda  and\nAttanasio, Giuseppe  and\nTalat, Zeerak  and\nHovy, Dirk"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "The field of sociolinguistics has studied factors affecting language use for the last century. Labov (1964) and Bernstein (1960) showed that socioeconomic class strongly influences our accents, syntax and lexicon. However, despite growing concerns surrounding fairness and bias in Natural Language Processing (NLP), there is a dearth of studies delving into the effects it may have on NLP systems. We show empirically that NLP systems’ performance is affected by speakers’ SES, potentially disadvantaging less-privileged socioeconomic groups. We annotate a corpus of 95K utterances from movies with social class, ethnicity and geographical language variety and measure the performance of NLP systems on three tasks: language modelling, automatic speech recognition, and grammar error correction. We find significant performance disparities that can be attributed to socioeconomic status as well as ethnicity and geographical differences. With NLP technologies becoming ever more ubiquitous and quotidian, they must accommodate all language varieties to avoid disadvantaging already marginalised groups. We argue for the inclusion of socioeconomic class in future language technologies.",
  "keywords": [
    "variety",
    "bias",
    "future language technologies",
    "disparities",
    "field",
    "varieties",
    "we",
    "syntax",
    "all language varieties",
    "natural",
    "the field",
    "it",
    "nlp technologies",
    "significant performance disparities",
    "technologies"
  ],
  "url": "https://aclanthology.org/2024.acl-long.682/",
  "provenance": {
    "collected_at": "2025-06-05 10:43:42",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}