{
  "id": "2024.wassa-1.12",
  "title": "The Model Arena for Cross-lingual Sentiment Analysis: A Comparative Study in the Era of Large Language Models",
  "authors": [
    "Zhu, Xiliang  and\nGardiner, Shayna  and\nRold{\\'a}n, Tere  and\nRossouw, David"
  ],
  "year": "2024",
  "venue": "Proceedings of the 14th Workshop on Computational Approaches to Subjectivity, Sentiment, {\\&} Social Media Analysis",
  "abstract": "Sentiment analysis serves as a pivotal component in Natural Language Processing (NLP). Advancements in multilingual pre-trained models such as XLM-R and mT5 have contributed to the increasing interest in cross-lingual sentiment analysis. The recent emergence in Large Language Models (LLM) has significantly advanced general NLP tasks, however, the capability of such LLMs in cross-lingual sentiment analysis has not been fully studied. This work undertakes an empirical analysis to compare the cross-lingual transfer capability of public Small Multilingual Language Models (SMLM) like XLM-R, against English-centric LLMs such as Llama-3, in the context of sentiment analysis across English, Spanish, French and Chinese. Our findings reveal that among public models, SMLMs exhibit superior zero-shot cross-lingual performance relative to LLMs. However, in few-shot cross-lingual settings, public LLMs demonstrate an enhanced adaptive potential. In addition, we observe that proprietary GPT-3.5 and GPT-4 lead in zero-shot cross-lingual capability, but are outpaced by public models in few-shot scenarios.",
  "keywords": [
    "english-centric llms",
    "era",
    "we",
    "zero-shot cross-lingual capability",
    "proprietary gpt-3",
    "cross-lingual sentiment analysis",
    "shot",
    "cross",
    "few-shot cross-lingual settings",
    "natural",
    "superior zero-shot cross-lingual performance",
    "gpt-3",
    "transfer",
    "analysis",
    "llms"
  ],
  "url": "https://aclanthology.org/2024.wassa-1.12/",
  "provenance": {
    "collected_at": "2025-06-05 11:11:44",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}