{
  "id": "2024.findings-acl.468",
  "title": "UOR}: Universal Backdoor Attacks on Pre-trained Language Models",
  "authors": [
    "Du, Wei  and\nLi, Peixuan  and\nZhao, Haodong  and\nJu, Tianjie  and\nRen, Ge  and\nLiu, Gongshen"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Task-agnostic and transferable backdoors implanted in pre-trained language models (PLMs) pose a severe security threat as they can be inherited to any downstream task. However, existing methods rely on manual selection of triggers and backdoor representations, hindering their effectiveness and universality across different PLMs or usage paradigms. In this paper, we propose a new backdoor attack method called UOR, which overcomes these limitations by turning manual selection into automatic optimization. Specifically, we design poisoned supervised contrastive learning, which can automatically learn more uniform and universal backdoor representations. This allows for more even coverage of the output space, thus hitting more labels in downstream tasks after fine-tuning. Furthermore, we utilize gradient search to select appropriate trigger words that can be adapted to different PLMs and vocabularies. Experiments show that UOR achieves better attack performance on various text classification tasks compared to manual methods. Moreover, we test on PLMs with different architectures, usage paradigms, and more challenging tasks, achieving higher scores for universality.",
  "keywords": [
    "we",
    "classification",
    "fine-tuning",
    "pre-trained language models",
    "pre-trained language models plms",
    "learning",
    "vocabularies experiments",
    "automatic optimization",
    "various text classification tasks",
    "gradient search",
    "tuning",
    "text",
    "vocabularies",
    "fine",
    "language"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.468/",
  "provenance": {
    "collected_at": "2025-06-05 10:54:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}