{
  "id": "2024.loresmt-1.19",
  "title": "Rosetta Balcanica: Deriving a ``Gold Standard'' Neural Machine Translation ({NMT}) Parallel Dataset from High-Fidelity Resources for {W}estern {B}alkan Languages",
  "authors": [
    "Begoli, Edmon  and\nMahbub, Maria  and\nSrinivasan, Sudarshan"
  ],
  "year": "2024",
  "venue": "Proceedings of the Seventh Workshop on Technologies for Machine Translation of Low-Resource Languages (LoResMT 2024)",
  "abstract": "The Rosetta Balcanica is an ongoing effort in resource expansion for low-resource Western Balkans languages. This effort focuses on discovering and using accurately translated, officially mapped, and curated parallel language resources and their preparation and use as neural machine translation (NMT) datasets. Some of the guiding principles, practices, and methods employed by Rosetta Balcanica are generalizable and could apply to other low-resource language resource expansion efforts. With this goal in mind, we present our rationale and approach to discovering and using meticulously translated and officially curated low-resource language resources and our use of these resources to develop a parallel “gold standard” translation training resource. Secondly, we describe our specific methodology for NMT dataset development from these resources and its publication to a widely-used and accessible repository for natural language processing (Hugging Face Hub). Finally, we discuss the trade-offs and limitations of our current approach, and the roadmap for future development and the expansion of the current Rosetta Balcanica language resource.",
  "keywords": [
    "generalizable",
    "we",
    "current",
    "training",
    "translation",
    "neural",
    "natural",
    "natural language processing",
    "processing",
    "language",
    "machine",
    "mind",
    "approach",
    "this goal",
    "low"
  ],
  "url": "https://aclanthology.org/2024.loresmt-1.19/",
  "provenance": {
    "collected_at": "2025-06-05 11:08:20",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}