{
  "id": "2024.arabicnlp-1.24",
  "title": "Benchmarking {LL}a{MA}-3 on {A}rabic Language Generation Tasks",
  "authors": [
    "Khondaker, Md Tawkat Islam  and\nNaeem, Numaan  and\nKhan, Fatimah  and\nElmadany, AbdelRahim  and\nAbdul-Mageed, Muhammad"
  ],
  "year": "2024",
  "venue": "Proceedings of the Second Arabic Natural Language Processing Conference",
  "abstract": "Open-sourced large language models (LLMs) have exhibited remarkable performance in a variety of NLP tasks, often catching up with the closed-sourced LLMs like ChatGPT. Among these open LLMs, LLaMA-3-70B has emerged as the most recent and the most prominent one. However, how LLaMA-3-70B would situate itself in multilingual settings, especially in a rich morphological language like Arabic, has yet to be explored. In this work, we focus to bridge this gap by evaluating LLaMA-3-70B on a diverse set of Arabic natural language generation (NLG) benchmarks. To the best of our knowledge, this is the first study that comprehensively evaluates LLaMA-3-70B on tasks related to Arabic natural language generation. Our study reveals that LLaMA-3-70B lags behind the closed LLMs like ChatGPT, both in modern standard Arabic (MSA) and dialectal Arabic (DA). We further compare the performance of LLaMA-3-70B with our smaller and dedicated finetuned Arabic models. We find that both LLaMA-3-70B and ChatGPT are outperformed by comparatively smaller dedicated Arabic models, indicating the scope for potential improvement with Arabic-focused LLMs.",
  "keywords": [
    "work",
    "variety",
    "the closed-sourced llms",
    "arabic-focused llms",
    "knowledge",
    "language",
    "generation",
    "nlp",
    "natural",
    "the closed llms",
    "arabic natural language generation",
    "chatgpt",
    "rich",
    "these open llms",
    "we"
  ],
  "url": "https://aclanthology.org/2024.arabicnlp-1.24/",
  "provenance": {
    "collected_at": "2025-06-05 11:02:31",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}