{
  "id": "2024.acl-long.490",
  "title": "Mitigating Biases for Instruction-following Language Models via Bias Neurons Elimination",
  "authors": [
    "Yang, Nakyeong  and\nKang, Taegwan  and\nChoi, Stanley Jungkyu  and\nLee, Honglak  and\nJung, Kyomin"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Instruction-following language models often show undesirable biases. These undesirable biases may be accelerated in the real-world usage of language models, where a wide range of instructions is used through zero-shot example prompting. To solve this problem, we first define the bias neuron, which significantly affects biased outputs, and prove its existence empirically. Furthermore, we propose a novel and practical bias mitigation method, CRISPR, to eliminate bias neurons of language models in instruction-following settings. CRISPR automatically determines biased outputs and categorizes neurons that affect the biased outputs as bias neurons using an explainability method. Experimental results demonstrate the effectiveness of our method in mitigating biases under zero-shot instruction-following settings without losing the model’s task performance and existing knowledge. The experimental results reveal the generalizability of our method as it shows robustness under various instructions and datasets. Surprisingly, our method can mitigate the bias in language models by eliminating only a few neurons (at least three).",
  "keywords": [
    "instruction",
    "the bias",
    "bias",
    "knowledge",
    "language",
    "biased outputs",
    "instruction-following language models",
    "model",
    "the generalizability",
    "it",
    "language models",
    "the biased outputs",
    "zero-shot example",
    "we",
    "zero-shot instruction-following settings"
  ],
  "url": "https://aclanthology.org/2024.acl-long.490/",
  "provenance": {
    "collected_at": "2025-06-05 10:41:03",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}