{
  "id": "2024.acl-long.457",
  "title": "Machine Unlearning of Pre-trained Large Language Models",
  "authors": [
    "Yao, Jin  and\nChien, Eli  and\nDu, Minxin  and\nNiu, Xinyao  and\nWang, Tianhao  and\nCheng, Zezhou  and\nYue, Xiang"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "This study investigates the concept of the ‘right to be forgotten’ within the context of large language models (LLMs). We explore machine unlearning as a pivotal solution, with a focus on pre-trained models–a notably under-researched area. Our research delineates a comprehensive framework for machine unlearning in pre-trained LLMs, encompassing a critical analysis of seven diverse unlearning methods. Through rigorous evaluation using curated datasets from arXiv, books, and GitHub, we establish a robust benchmark for unlearning performance, demonstrating that these methods are over105times more computationally efficient than retraining. Our results show that integrating gradient ascent with gradient descent on in-distribution data improves hyperparameter robustness. We also provide detailed guidelines for efficient hyperparameter tuning in the unlearning process. Our findings advance the discourse on ethical AI practices, offering substantive insights into the mechanics of machine unlearning for pre-trained LLMs and underscoring the potential for responsible AI development.",
  "keywords": [
    "efficient",
    "we",
    "gradient descent",
    "pre-trained llms",
    "analysis",
    "llms",
    "pre-trained large language models",
    "hyperparameter robustness",
    "gradient ascent",
    "rigorous evaluation",
    "large language models llms",
    "process",
    "language",
    "machine",
    "gradient"
  ],
  "url": "https://aclanthology.org/2024.acl-long.457/",
  "provenance": {
    "collected_at": "2025-06-05 10:40:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}