{
  "id": "2024.cmcl-1.5",
  "title": "The Curious Case of Representational Alignment: Unravelling Visio-Linguistic Tasks in Emergent Communication",
  "authors": [
    "Kouwenhoven, Tom  and\nPeeperkorn, Max  and\nVan Dijk, Bram  and\nVerhoef, Tessa"
  ],
  "year": "2024",
  "venue": "Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics",
  "abstract": "Natural language has the universal properties of being compositional and grounded in reality. The emergence of linguistic properties is often investigated through simulations of emergent communication in referential games. However, these experiments have yielded mixed results compared to similar experiments addressing linguistic properties of human language. Here we address representational alignment as a potential contributing factor to these results. Specifically, we assess the representational alignment between agent image representations and between agent representations and input images. Doing so, we confirm that the emergent language does not appear to encode human-like conceptual visual features, since agent image representations drift away from inputs whilst inter-agent alignment increases. We moreover identify a strong relationship between inter-agent alignment and topographic similarity, a common metric for compositionality, and address its consequences. To address these issues, we introduce an alignment penalty that prevents representational drift but interestingly does not improve performance on a compositional discrimination task. Together, our findings emphasise the key role representational alignment plays in simulations of language emergence.",
  "keywords": [
    "encode",
    "an alignment penalty",
    "we",
    "inter-agent alignment",
    "natural",
    "properties",
    "visual",
    "the representational alignment",
    "the universal properties",
    "metric",
    "inter-agent alignment increases",
    "alignment",
    "linguistic properties",
    "representational alignment",
    "language"
  ],
  "url": "https://aclanthology.org/2024.cmcl-1.5/",
  "provenance": {
    "collected_at": "2025-06-05 11:05:30",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}