{
  "id": "2024.wassa-1.31",
  "title": "RU} at {WASSA} 2024 Shared Task: Task-Aligned Prompt for Predicting Empathy and Distress",
  "authors": [
    "Kong, Haein  and\nMoon, Seonghyeon"
  ],
  "year": "2024",
  "venue": "Proceedings of the 14th Workshop on Computational Approaches to Subjectivity, Sentiment, {\\&} Social Media Analysis",
  "abstract": "This paper describes our approach for the WASSA 2024 Shared Task on Empathy Detection and Emotion Classification and Personality Detection in Interactions at ACL 2024. We focused on Track 3: Empathy Prediction (EMP) which aims to predict the empathy and distress of writers based on their essays. Recently, LLMs have been used to detect the psychological status of the writers based on the texts. Previous studies showed that the performance of LLMs can be improved by designing prompts properly. While diverse approaches have been made, we focus on the fact that LLMs can have different nuances for psychological constructs such as empathy or distress to the specific task. In addition, people can express their empathy or distress differently according to the context. Thus, we tried to enhance the prediction performance of LLMs by proposing a new prompting strategy: Task-Aligned Prompt (TAP). This prompt consists of aligned definitions for empathy and distress to the original paper and the contextual information about the dataset. Our proposed prompt was tested using ChatGPT and GPT4o with zero-shot and few-shot settings and the performance was compared to the plain prompts. The results showed that the TAP-ChatGPT-zero-shot achieved the highest average Pearson correlation of empathy and distress on the EMP track.",
  "keywords": [
    "the plain prompts",
    "the tap-chatgpt-zero-shot",
    "we",
    "shot",
    "classification",
    "information",
    "chatgpt",
    "our proposed prompt",
    "llms",
    "prompt",
    "the texts previous studies",
    "ru",
    "prompts",
    "studies",
    "zero-shot and few-shot settings"
  ],
  "url": "https://aclanthology.org/2024.wassa-1.31/",
  "provenance": {
    "collected_at": "2025-06-05 11:12:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}