{
  "id": "2024.findings-acl.261",
  "title": "URG}: A Unified Ranking and Generation Method for Ensembling Language Models",
  "authors": [
    "Lv, Bo  and\nTang, Chen  and\nZhang, Yanan  and\nLiu, Xin  and\nLuo, Ping  and\nYu, Yue"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Prior research endeavors of the ensemble Large Language Models (LLMs) achieved great success by employing an individual language model (LM) rank before the text generation. However, the use of an individual LM ranker faces two primary challenges: (1) The time-intensive nature of the ranking process, stemming from the comparisons between models; (2) The issue of error propagation arising from the separate ranking and generation models within the framework. In order to overcome these challenges, we propose a novel ensemble framework, namely Unified Ranking and Generation (URG). URG represents an end-to-end framework that jointly ranks the outputs of LLMs and generates fine-grained fusion results, via utilizing a dedicated cross-attention-based module and noise mitigation training against irrelevant information stemming from bad ranking results. Through extensive experimentation and evaluation, we demonstrate the efficiency and effectiveness of our framework in both the ranking and generation tasks. With the close coordination of the ranking and generation modules, our end-to-end framework achieves the state-of-the-art (SOTA) performance on these tasks, and exhibits substantial enhancements to any of the ensembled models.",
  "keywords": [
    "the text generation",
    "end",
    "a novel ensemble framework",
    "the ensembled models",
    "efficiency",
    "we",
    "fusion",
    "an individual language model",
    "training",
    "ensemble",
    "cross",
    "the efficiency",
    "information",
    "llms",
    "text"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.261/",
  "provenance": {
    "collected_at": "2025-06-05 10:52:10",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}