{
  "id": "2024.acl-long.768",
  "title": "L}ogogram{NLP}: Comparing Visual and Textual Representations of Ancient Logographic Writing Systems for {NLP",
  "authors": [
    "Chen, Danlu  and\nShi, Freda  and\nAgarwal, Aditi  and\nMyerston, Jacobo  and\nBerg-Kirkpatrick, Taylor"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Standard natural language processing (NLP) pipelines operate on symbolic representations of language, which typically consist of sequences of discrete tokens. However, creating an analogous representation for ancient logographic writing systems is an extremely labor-intensive process that requires expert knowledge. At present, a large portion of logographic data persists in a purely visual form due to the absence of transcription—this issue poses a bottleneck for researchers seeking to apply NLP toolkits to study ancient logographic languages: most of the relevant data are images of writing. This paper investigates whether direct processing of visual representations of language offers a potential solution. We introduce LogogramNLP, the first benchmark enabling NLP analysis of ancient logographic languages, featuring both transcribed and visual datasetsfor four writing systems along with annotations for tasks like classification, translation, and parsing. Our experiments compare systems thatemploy recent visual and text encoding strategies as backbones. The results demonstrate that visual representations outperform textual representations for some investigated tasks, suggesting that visual processing pipelines may unlock a large amount of cultural heritage data of logographic languages for NLP-based analyses. Data and code are available at https: //logogramNLP.github.io/.",
  "keywords": [
    "code",
    "ancient",
    "form",
    "nlp-based analyses data",
    "we",
    "logogramnlp",
    "translation",
    "classification",
    "natural",
    "visual",
    "analysis",
    "processing",
    "text",
    "strategies",
    "classification translation"
  ],
  "url": "https://aclanthology.org/2024.acl-long.768/",
  "provenance": {
    "collected_at": "2025-06-05 10:44:53",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}