{
  "id": "2024.findings-acl.546",
  "title": "A}uto{CAP}: Towards Automatic Cross-lingual Alignment Planning for Zero-shot Chain-of-Thought",
  "authors": [
    "Zhang, Yongheng  and\nChen, Qiguang  and\nLi, Min  and\nChe, Wanxiang  and\nQin, Libo"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Cross-lingual chain-of-thought can effectively complete reasoning tasks across languages, which gains increasing attention.Recently, dominant approaches in the literature improve cross-lingual alignment capabilities by integrating reasoning knowledge from different languages. Despite achieving excellent performance, current methods still have two main challenges: (1) Manual language specification: They still highly rely on manually selecting the languages to integrate, severely affecting their generalizability; (2) Static weight allocation: Current methods simply integrate all languages equally. In fact, different language reasoning paths should have different weights to achieve better complementation and integration. Motivated by this, we introduce an Automatic Cross-lingual Alignment Planning (AutoCAP) for zero-shot chain-of-thought to address the above challenges. The core of AutoCAP consists of two components: (1) Automatic Language Selection Prompting to guide LLMs to select appropriate languages and (2) Automatic Weight Allocation Prompting to automatically allocate alignment weight scores to each reasoning path. Extensive experiments on several benchmarks reveal that AutoCAP achieves state-of-the-art performance, surpassing previous methods that required manual effort.",
  "keywords": [
    "chain",
    "we",
    "generalizability",
    "automatic cross-lingual alignment planning",
    "current",
    "shot",
    "cross",
    "allocation",
    "zero-shot chain",
    "cross-lingual alignment capabilities",
    "increasing attention",
    "alignment weight scores",
    "core",
    "llms",
    "alignment"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.546/",
  "provenance": {
    "collected_at": "2025-06-05 10:56:04",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}