{
  "id": "2024.findings-acl.106",
  "title": "Cyclical Contrastive Learning Based on Geodesic for Zero-shot Cross-lingual Spoken Language Understanding",
  "authors": [
    "Cheng, Xuxin  and\nZhu, Zhihong  and\nYang, Bang  and\nZhuang, Xianwei  and\nLi, Hongxiang  and\nZou, Yuexian"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Owing to the scarcity of labeled training data, Spoken Language Understanding (SLU) is still a challenging task in low-resource languages. Therefore, zero-shot cross-lingual SLU attracts more and more attention. Contrastive learning is widely applied to explicitly align representations of similar sentences across different languages. However, the vanilla contrastive learning method may face two problems in zero-shot cross-lingual SLU: (1) the consistency between different languages is neglected; (2) each utterance has two different kinds of SLU labels, i.e. slot and intent, the utterances with one different label are also pushed away without any discrimination, which limits the performance. In this paper, we propose Cyclical Contrastive Learning based on Geodesic (CCLG), which introduces cyclical contrastive learning to achieve the consistency between different languages and leverages geodesic to measure the similarity to construct the positive pairs and negative pairs. Experimental results demonstrate that our proposed framework achieves the new state-of-the-art performance on MultiATIS++ and MTOP datasets, and the model analysis further verifies that CCLG can effectively transfer knowledge between different languages.",
  "keywords": [
    "we",
    "zero-shot cross-lingual slu",
    "training",
    "cross",
    "learning",
    "analysis",
    "i",
    "verifies",
    "further verifies",
    "knowledge",
    "language",
    "model",
    "attention",
    "cclg",
    "slu"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.106/",
  "provenance": {
    "collected_at": "2025-06-05 10:50:03",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}