{
  "id": "2024.acl-long.689",
  "title": "Peacock: A Family of {A}rabic Multimodal Large Language Models and Benchmarks",
  "authors": [
    "Alwajih, Fakhraddin  and\nNagoudi, El Moatez Billah  and\nBhatia, Gagan  and\nMohamed, Abdelrahman  and\nAbdul-Mageed, Muhammad"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Multimodal large language models (MLLMs) have proven effective in a wide range of tasks that require complex reasoning and linguistic comprehension. However, due to a lack of high-quality multimodal resources in languages other than English, the success of MLLMs remains relatively limited to English-based settings. This poses significant challenges in developing comparable models for other languages, even those with large speaker populations, such as Arabic. To alleviate this challenge, we introduce a comprehensive family of Arabic MLLMs, dubbed *Peacock*, with strong vision and language capabilities. Through comprehensive qualitative and quantitative analysis, we demonstrate the solid performance of our models on various visual reasoning tasks and further show their emerging dialectal potential. Additionally, we introduce *Henna*, a new benchmark specifically designed for assessing MLLMs on aspects related to Arabic culture, setting the first stone for culturally-aware Arabic MLLMs. The GitHub repository for the *Peacock* project is available at [https://github.com/UBC-NLP/peacock](https://github.com/UBC-NLP/peacock).",
  "keywords": [
    "arabic mllms",
    "we",
    "visual",
    "analysis",
    "mllms",
    "language",
    "nlp",
    "culturally-aware arabic mllms",
    "capabilities",
    "populations",
    "culture",
    "ubc",
    "settings",
    "a lack",
    "models"
  ],
  "url": "https://aclanthology.org/2024.acl-long.689/",
  "provenance": {
    "collected_at": "2025-06-05 10:43:48",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}