{
  "id": "2024.acl-long.847",
  "title": "T}o{MB}ench: Benchmarking Theory of Mind in Large Language Models",
  "authors": [
    "Chen, Zhuang  and\nWu, Jincenzi  and\nZhou, Jinfeng  and\nWen, Bosi  and\nBi, Guanqun  and\nJiang, Gongyao  and\nCao, Yaru  and\nHu, Mengting  and\nLai, Yunghwei  and\nXiong, Zexuan  and\nHuang, Minlie"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Theory of Mind (ToM) is the cognitive capability to perceive and ascribe mental states to oneself and others. Recent research has sparked a debate over whether large language models (LLMs) exhibit a form of ToM. However, existing ToM evaluations are hindered by challenges such as constrained scope, subjective judgment, and unintended contamination, yielding inadequate assessments. To address this gap, we introduce ToMBench with three key characteristics: a systematic evaluation framework encompassing 8 tasks and 31 abilities in social cognition, a multiple-choice question format to support automated and unbiased evaluation, and a build-from-scratch bilingual inventory to strictly avoid data leakage. Based on ToMBench, we conduct extensive experiments to evaluate the ToM performance of 10 popular LLMs across tasks and abilities. We find that even the most advanced LLMs like GPT-4 lag behind human performance by over 10% points, indicating that LLMs have not achieved a human-level theory of mind yet. Our aim with ToMBench is to enable an efficient and effective evaluation of LLMs’ ToM capabilities, thereby facilitating the development of LLMs with inherent social intelligence.",
  "keywords": [
    "automated and unbiased evaluation",
    "unbiased",
    "efficient",
    "question",
    "form",
    "we",
    "10 popular llms",
    "large language models theory",
    "format",
    "llms",
    "abilities",
    "a systematic evaluation framework",
    "gpt-4",
    "language",
    "31 abilities"
  ],
  "url": "https://aclanthology.org/2024.acl-long.847/",
  "provenance": {
    "collected_at": "2025-06-05 10:45:57",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}