{
  "id": "2024.acl-long.443",
  "title": "Aligning Large Language Models for Controllable Recommendations",
  "authors": [
    "Lu, Wensheng  and\nLian, Jianxun  and\nZhang, Wei  and\nLi, Guanghua  and\nZhou, Mingyang  and\nLiao, Hao  and\nXie, Xing"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Inspired by the exceptional general intelligence of Large Language Models (LLMs), researchers have begun to explore their application in pioneering the next generation of recommender systems — systems that are conversational, explainable, and controllable. However, existing literature primarily concentrates on integrating domain-specific knowledge into LLMs to enhance accuracy using a fixed task template, often overlooking the diversity of recommendation tasks and the ability of LLMs to follow recommendation-specific instructions. To address this gap, we first introduce a collection of supervised learning tasks, augmented with labels derived from a conventional recommender model, aimed at explicitly improving LLMs’ proficiency in adhering to recommendation-specific instructions. Next, we propose a reinforcement learning-based alignment procedure to enhance LLMs’ generalization ability. Extensive experiments on two real-world datasets demonstrate that our approach significantly improves the capability of LLMs to respond to instructions within recommender systems, reducing formatting errors while maintaining a high level of accuracy.",
  "keywords": [
    "we",
    "the exceptional general intelligence",
    "generalization ability extensive experiments",
    "llms proficiency",
    "learning",
    "llms",
    "generalization",
    "the next generation",
    "accuracy",
    "alignment",
    "proficiency",
    "general",
    "knowledge",
    "reinforcement",
    "language"
  ],
  "url": "https://aclanthology.org/2024.acl-long.443/",
  "provenance": {
    "collected_at": "2025-06-05 10:40:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}