{
  "id": "2024.arabicnlp-1.73",
  "title": "The Guidelines Specialists at {FIGNEWS} 2024 Shared Task: An annotation guideline to Unravel Bias in News Media Narratives Using a Linguistic Approach",
  "authors": [
    "Bourahouat, Ghizlane  and\nAmer, Samar"
  ],
  "year": "2024",
  "venue": "Proceedings of the Second Arabic Natural Language Processing Conference",
  "abstract": "This article presents the participation of “The Guideline Specialists” in the FIGNEWS 2024 Shared Task, which aims to unravel bias and propaganda in news media narratives surrounding the Gaza-Israel 2023-2024 war. Leveraging innovative annotation methodologies and drawing on a diverse team of annotators, our approach focuses on meticulously annotating news articles using a linguistic approach to uncover the intricate nuances of bias. By incorporating detailed examples and drawing on related work that show how language structure represented in the use of passive voice or the use of nominalization and the choice of vocabulary carry bias, our findings provide valuable insights into the representation of the Gaza-Israel conflict across various languages and cultures. The guideline we developed detected the bias against Gaza, against Israel and others by setting keywords that are based on linguistic background tested by the AntConc concordance tool. The result was an annotation guideline that have a solid base. Through this collaborative effort, we developed a guideline that contributes to fostering a deeper understanding of media narratives during one of the most critical moments in recent history.",
  "keywords": [
    "bias",
    "the bias",
    "we",
    "war",
    "background",
    "innovative annotation methodologies",
    "linguistic background",
    "work",
    "language",
    "methodologies",
    "detailed",
    "approach",
    "media",
    "gaza",
    "this article"
  ],
  "url": "https://aclanthology.org/2024.arabicnlp-1.73/",
  "provenance": {
    "collected_at": "2025-06-05 11:03:10",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}