{
  "id": "2024.acl-long.530",
  "title": "B}ad{A}gent: Inserting and Activating Backdoor Attacks in {LLM} Agents",
  "authors": [
    "Wang, Yifei  and\nXue, Dizhan  and\nZhang, Shengjie  and\nQian, Shengsheng"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "With the prosperity of large language models (LLMs), powerful LLM-based intelligent agents have been developed to provide customized services with a set of user-defined tools. State-of-the-art methods for constructing LLM agents adopt trained LLMs and further fine-tune them on data for the agent task. However, we show that such methods are vulnerable to our proposed backdoor attacks named BadAgent on various agent tasks, where a backdoor can be embedded by fine-tuning on the backdoor data. At test time, the attacker can manipulate the deployed LLM agents to execute harmful operations by showing the trigger in the agent input or environment. To our surprise, our proposed attack methods are extremely robust even after fine-tuning on trustworthy data. Though backdoor attacks have been studied extensively in natural language processing, to the best of our knowledge, we could be the first to study them on LLM agents that are more dangerous due to the permission to use external tools. Our work demonstrates the clear risk of constructing LLM agents based on untrusted LLMs or data. Our code is public at https://github.com/DPamK/BadAgent",
  "keywords": [
    "code",
    "powerful llm-based intelligent agents",
    "we",
    "llm agents",
    "llm",
    "the deployed llm agents",
    "fine-tuning",
    "trained llms",
    "natural",
    "natural language processing",
    "vulnerable",
    "llms",
    "tuning",
    "processing",
    "fine"
  ],
  "url": "https://aclanthology.org/2024.acl-long.530/",
  "provenance": {
    "collected_at": "2025-06-05 10:41:37",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}