{
  "id": "2024.findings-acl.240",
  "title": "Autonomous Workflow for Multimodal Fine-Grained Training Assistants Towards Mixed Reality",
  "authors": [
    "Pei, Jiahuan  and\nViola, Irene  and\nHuang, Haochen  and\nWang, Junxiao  and\nAhsan, Moonisa  and\nYe, Fanghua  and\nYiming, Jiang  and\nSai, Yao  and\nWang, Di  and\nChen, Zhumin  and\nRen, Pengjie  and\nCesar, Pablo"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Autonomous artificial intelligence (AI) agents have emerged as promising protocols for automatically understanding the language-based environment, particularly with the exponential development of large language models (LLMs). However, a fine-grained, comprehensive understanding of multimodal environments remains under-explored. This work designs an autonomous workflow tailored for integrating AI agents seamlessly into extended reality (XR) applications for fine-grained training. We present a demonstration of a multimodal fine-grained training assistant for LEGO brick assembly in a pilot XR environment. Specifically, we design a cerebral language agent that integrates LLM with memory, planning, and interaction with XR tools and a vision-language agent, enabling agents to decide their actions based on past experiences. Furthermore, we introduce LEGO-MRTA, a multimodal fine-grained assembly dialogue dataset synthesized automatically in the workflow served by a commercial LLM. This dataset comprises multimodal instruction manuals, conversations, XR responses, and vision question answering. Last, we present several prevailing open-resource LLMs as benchmarks, assessing their performance with and without fine-tuning on the proposed dataset. We anticipate that the broader impact of this workflow will advance the development of smarter assistants for seamless user interaction in XR environments, fostering research in both AI and HCI communities.",
  "keywords": [
    "communities",
    "conversations",
    "question",
    "several prevailing open-resource llms",
    "we",
    "dialogue",
    "llm",
    "training",
    "fine-tuning",
    "a commercial llm",
    "instruction",
    "llms",
    "tuning",
    "past experiences",
    "work"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.240/",
  "provenance": {
    "collected_at": "2025-06-05 10:51:53",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}