{
  "id": "2024.acl-long.357",
  "title": "A Ship of Theseus: Curious Cases of Paraphrasing in {LLM}-Generated Texts",
  "authors": [
    "Tripto, Nafis Irtiza  and\nVenkatraman, Saranya  and\nMacko, Dominik  and\nMoro, Robert  and\nSrba, Ivan  and\nUchendu, Adaku  and\nLe, Thai  and\nLee, Dongwon"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "In the realm of text manipulation and linguistic transformation, the question of authorship has been a subject of fascination and philosophical inquiry. Much like the Ship of Theseus paradox, which ponders whether a ship remains the same when each of its original planks is replaced, our research delves into an intriguing question: Does a text retain its original authorship when it undergoes numerous paraphrasing iterations? Specifically, since Large Language Models (LLMs) have demonstrated remarkable proficiency in both the generation of original content and the modification of human-authored texts, a pivotal question emerges concerning the determination of authorship in instances where LLMs or similar paraphrasing tools are employed to rephrase the text–i.e., whether authorship should be attributed to the original human author or the AI-powered tool. Therefore, we embark on a philosophical voyage through the seas of language and authorship to unravel this intricate puzzle. Using a computational approach, we discover that the diminishing performance in text classification models, with each successive paraphrasing iteration, is closely associated with the extent of deviation from the original author’s style, thus provoking a reconsideration of the current notion of authorship.",
  "keywords": [
    "llm -generated texts",
    "question",
    "remarkable proficiency",
    "we",
    "current",
    "llm",
    "classification",
    "it",
    "text classification models",
    "llms",
    "i",
    "text",
    "both the generation",
    "large language models llms",
    "proficiency"
  ],
  "url": "https://aclanthology.org/2024.acl-long.357/",
  "provenance": {
    "collected_at": "2025-06-05 10:39:12",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}