{
  "id": "2024.acl-long.508",
  "title": "Comparing Inferential Strategies of Humans and Large Language Models in Deductive Reasoning",
  "authors": [
    "Mondorf, Philipp  and\nPlank, Barbara"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Deductive reasoning plays a pivotal role in the formulation of sound and cohesive arguments. It allows individuals to draw conclusions that logically follow, given the truth value of the information provided. Recent progress in the domain of large language models (LLMs) has showcased their capability in executing deductive reasoning tasks. Nonetheless, a significant portion of research primarily assesses the accuracy of LLMs in solving such tasks, often overlooking a deeper analysis of their reasoning behavior. In this study, we draw upon principles from cognitive psychology to examine inferential strategies employed by LLMs, through a detailed evaluation of their responses to propositional logic problems. Our findings indicate that LLMs display reasoning patterns akin to those observed in humans, including strategies likesupposition followingorchain construction. Moreover, our research demonstrates that the architecture and scale of the model significantly affect its preferred method of reasoning, with more advanced models tending to adopt strategies more frequently than less sophisticated ones. Importantly, we assert that a model’s accuracy, that is the correctness of its final conclusion, does not necessarily reflect the validity of its reasoning process. This distinction underscores the necessity for more nuanced evaluation procedures in the field.",
  "keywords": [
    "the accuracy",
    "field",
    "inferential strategies",
    "we",
    "a detailed evaluation",
    "more nuanced evaluation procedures",
    "the field",
    "it",
    "information",
    "analysis",
    "llms",
    "a model s accuracy",
    "strategies",
    "large language models llms",
    "accuracy"
  ],
  "url": "https://aclanthology.org/2024.acl-long.508/",
  "provenance": {
    "collected_at": "2025-06-05 10:41:18",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}