{
  "id": "2024.findings-acl.622",
  "title": "S}hared{C}on: Implicit Hate Speech Detection using Shared Semantics",
  "authors": [
    "Ahn, Hyeseon  and\nKim, Youngwook  and\nKim, Jungin  and\nHan, Yo-Sub"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "The ever-growing presence of hate speech on social network services and other online platforms not only fuels online harassment but also presents a growing challenge for hate speech detection. As this task is akin to binary classification, one of the promising approaches for hate speech detection is the utilization of contrastive learning. Recent studies suggest that classifying hateful posts in just a binary manner may not adequately address the nuanced task of detecting implicit hate speech. This challenge is largely due to the subtle nature and context dependency of such pejorative remarks. Previous studies proposed a modified contrastive learning approach equipped with additional aids such as human-written implications or machine-generated augmented data for better implicit hate speech detection. While this approach can potentially enhance the overall performance by its additional data in general, it runs the risk of overfitting as well as heightened cost and time to obtain. These drawbacks serve as motivation for us to design a methodology that is not dependent on human-written or machine-generated augmented data for training. We propose a straightforward, yet effective, clustering-based contrastive learning approach that leverages the shared semantics among the data.",
  "keywords": [
    "context dependency",
    "shared semantics",
    "we",
    "training",
    "classification",
    "contrastive learning recent studies",
    "machine-generated augmented data",
    "semantics",
    "it",
    "learning",
    "manner",
    "previous studies",
    "general",
    "studies",
    "machine"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.622/",
  "provenance": {
    "collected_at": "2025-06-05 10:57:06",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}