{
  "id": "2024.textgraphs-1.8",
  "title": "Semantic Graphs for Syntactic Simplification: A Revisit from the Age of {LLM",
  "authors": [
    "Yao, Peiran  and\nGuzhva, Kostyantyn  and\nBarbosa, Denilson"
  ],
  "year": "2024",
  "venue": "Proceedings of TextGraphs-17: Graph-based Methods for Natural Language Processing",
  "abstract": "Symbolic sentence meaning representations, such as AMR (Abstract Meaning Representation) provide expressive and structured semantic graphs that act as intermediates that simplify downstream NLP tasks. However, the instruction-following capability of large language models (LLMs) offers a shortcut to effectively solve NLP tasks, questioning the utility of semantic graphs. Meanwhile, recent work has also shown the difficulty of using meaning representations merely as a helpful auxiliary for LLMs. We revisit the position of semantic graphs in syntactic simplification, the task of simplifying sentence structures while preserving their meaning, which requires semantic understanding, and evaluate it on a new complex and natural dataset. The AMR-based method that we propose, AMRS3, demonstrates that state-of-the-art meaning representations can lead to easy-to-implement simplification methods with competitive performance and unique advantages in cost, interpretability, and generalization. With AMRS3as an anchor, we discover that syntactic simplification is a task where semantic graphs are helpful in LLM prompting. We propose AMRCoC prompting that guides LLMs to emulate graph algorithms for explicit symbolic reasoning on AMR graphs, and show its potential for improving LLM on semantic-centered tasks like syntactic simplification.",
  "keywords": [
    "semantic",
    "we",
    "semantic-centered tasks",
    "graph",
    "llm",
    "semantic understanding",
    "instruction",
    "natural",
    "it",
    "llm symbolic sentence",
    "nlp tasks",
    "downstream nlp tasks",
    "llms",
    "semantic graphs",
    "generalization"
  ],
  "url": "https://aclanthology.org/2024.textgraphs-1.8/",
  "provenance": {
    "collected_at": "2025-06-05 11:11:27",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}