{
  "id": "2024.ml4al-1.14",
  "title": "C}u{R}e{D}: Deep Learning Optical Character Recognition for Cuneiform Text Editions and Legacy Materials",
  "authors": [
    "Gordin, Shai  and\nAlper, Morris  and\nRomach, Avital  and\nSaenz Santos, Luis  and\nYochai, Naama  and\nLalazar, Roey"
  ],
  "year": "2024",
  "venue": "Proceedings of the 1st Workshop on Machine Learning for Ancient Languages (ML4AL 2024)",
  "abstract": "Cuneiform documents, the earliest known form of writing, are prolific textual sources of the ancient past. Experts publish editions of these texts in transliteration using specialized typesetting, but most remain inaccessible for computational analysis in traditional printed books or legacy materials. Off-the-shelf OCR systems are insufficient for digitization without adaptation. We present CuReD (Cuneiform Recognition-Documents), a deep learning-based human-in-the-loop OCR pipeline for digitizing scanned transliterations of cuneiform texts. CuReD has a character error rate of 9% on clean data and 11% on representative scans. We digitized a challenging sample of transliterated cuneiform documents, as well as lexical index cards from the University of Pennsylvania Museum, demonstrating the feasibility of our platform for enabling computational analysis and bolstering machine-readable cuneiform text datasets. Our result provide the first human-in-the-loop pipeline and interface for digitizing transliterated cuneiform sources and legacy materials, enabling the enrichment of digital sources of these low-resource languages.",
  "keywords": [
    "deep",
    "ancient",
    "the earliest known form",
    "rate",
    "form",
    "we",
    "learning",
    "analysis",
    "text",
    "the ancient past experts",
    "earliest",
    "insufficient",
    "machine",
    "human",
    "documents"
  ],
  "url": "https://aclanthology.org/2024.ml4al-1.14/",
  "provenance": {
    "collected_at": "2025-06-05 11:08:33",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}