{
  "id": "2024.acl-demos.36",
  "title": "ELLA}: Empowering {LLM}s for Interpretable, Accurate and Informative Legal Advice",
  "authors": [
    "Hu, Yutong  and\nLuo, Kangcheng  and\nFeng, Yansong"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 3: System Demonstrations)",
  "abstract": "Despite remarkable performance in legal consultation exhibited by legal Large Language Models(LLMs) combined with legal article retrieval components, there are still cases when the advice given is incorrect or baseless. To alleviate these problems, we proposeELLA, a tool forEmpoweringLLMs for interpretable, accurate, and informativeLegalAdvice. ELLA visually presents the correlation between legal articles and LLM’s response by calculating their similarities, providing users with an intuitive legal basis for the responses. Besides, based on the users’ queries, ELLA retrieves relevant legal articles and displays them to users. Users can interactively select legal articles for LLM to generate more accurate responses. ELLA also retrieves relevant legal cases for user reference. Our user study shows that presenting the legal basis for the response helps users understand better. The accuracy of LLM’s responses also improves when users intervene in selecting legal articles for LLM. Providing relevant legal cases also aids individuals in obtaining comprehensive information. Our github repo is:https://github.com/Huyt00/ELLA.",
  "keywords": [
    "reference",
    "the accuracy",
    "similarities",
    "a tool forempoweringllms",
    "language",
    "forempoweringllms",
    "their similarities",
    "llm s",
    "llm s response",
    "retrieval",
    "information",
    "legal article retrieval components",
    "we",
    "llm",
    "llm s responses"
  ],
  "url": "https://aclanthology.org/2024.acl-demos.36/",
  "provenance": {
    "collected_at": "2025-06-05 10:47:46",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}