{
  "id": "2024.findings-acl.367",
  "title": "Decoding the Narratives: Analyzing Personal Drug Experiences Shared on {R}eddit",
  "authors": [
    "Bouzoubaa, Layla  and\nAghakhani, Elham  and\nSong, Max  and\nTrinh, Quang  and\nRezapour, Shadi"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Online communities such as drug-related subreddits serve as safe spaces for people who use drugs (PWUD), fostering discussions on substance use experiences, harm reduction, and addiction recovery. Users’ shared narratives on these forums provide insights into the likelihood of developing a substance use disorder (SUD) and recovery potential. Our study aims to develop a multi-level, multi-label classification model to analyze online user-generated texts about substance use experiences. For this purpose, we first introduce a novel taxonomy to assess the nature of posts, including their intended connections (Inquisition or Disclosure), subjects (e.g., Recovery, Dependency), and specific objectives (e.g., Relapse, Quality, Safety). Using various multi-label classification algorithms on a set of annotated data, we show that GPT-4, when prompted with instructions, definitions, and examples, outperformed all other models. We apply this model to label an additional 1,000 posts and analyze the categories of linguistic expression used within posts in each class. Our analysis shows that topics such as Safety, Combination of Substances, and Mental Health see more disclosure, while discussions about physiological Effects focus on harm reduction. Our work enriches the understanding of PWUD’s experiences and informs the broader knowledge base on SUD and drug use.",
  "keywords": [
    "objectives",
    "the categories",
    "communities",
    "substance use experiences",
    "we",
    "classification",
    "personal drug experiences",
    "r eddit online communities",
    "analysis",
    "reduction",
    "online user-generated texts",
    "categories",
    "gpt-4",
    "various multi-label classification algorithms",
    "work"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.367/",
  "provenance": {
    "collected_at": "2025-06-05 10:53:37",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}