{
  "id": "2024.findings-acl.229",
  "title": "KG}-Adapter: Enabling Knowledge Graph Integration in Large Language Models through Parameter-Efficient Fine-Tuning",
  "authors": [
    "Tian, Shiyu  and\nLuo, Yangyang  and\nXu, Tianze  and\nYuan, Caixia  and\nJiang, Huixing  and\nWei, Chen  and\nWang, Xiaojie"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Although large language models (LLMs) show remarkable capabilities and generalizability across various tasks, they are criticized for lack of expertise. One promising solution is to combine knowledge graphs (KGs) with LLMs, and recent studies focus on integrating KGs into LLMs through prompt-based methods. However, these approaches fail to use the structural information of the KGs, suffer from the problem of knowledge conflict, and over-reliance on super LLMs. To address these challenges, we propose KG-Adapter, a parameter-level KG integration method based on parameter-efficient fine-tuning (PEFT). Specifically, we introduce a novel adapter structure designed for decoder-only LLMs, which can encode KGs from both node-centered and relation-centered perspectives, and then perform joint reasoning with LLMs to generate responses end-to-end. Experiments with diverse models on four datasets for two different tasks all demonstrate significant improvements. With only 28M parameters trained, we make the 7B-parameter LLM outperform the previous full-parameter fine-tuned state-of-the-art method and comparable to the prompt-based ChatGPT methods.",
  "keywords": [
    "decoder-only llms",
    "end",
    "knowledge graph integration",
    "efficient",
    "the 7b-parameter llm",
    "remarkable capabilities",
    "parameter-efficient fine-tuning peft",
    "we",
    "generalizability",
    "graph",
    "llm",
    "parameter",
    "decoder",
    "prompt-based methods",
    "information"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.229/",
  "provenance": {
    "collected_at": "2025-06-05 10:51:44",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}