{
  "id": "2024.findings-acl.239",
  "title": "M}ovie{S}um: An Abstractive Summarization Dataset for Movie Screenplays",
  "authors": [
    "Saxena, Rohit  and\nKeller, Frank"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Movie screenplay summarization is challenging, as it requires an understanding of long input contexts and various elements unique to movies. Large language models have shown significant advancements in document summarization, but they often struggle with processing long input contexts. Furthermore, while television transcripts have received attention in recent studies, movie screenplay summarization remains underexplored. To stimulate research in this area, we present a new dataset, MovieSum, for abstractive summarization of movie screenplays. This dataset comprises 2200 movie screenplays accompanied by their Wikipedia plot summaries. We manually formatted the movie screenplays to represent their structural elements. Compared to existing datasets, MovieSum possesses several distinctive features: 1) It includes movie screenplays which are longer than scripts of TV episodes. 2) It is twice the size of previous movie screenplay datasets. 3) It provides metadata with IMDb IDs to facilitate access to additional external knowledge. We also show the results of recently released large language models applied to summarization on our dataset to provide a detailed baseline.",
  "keywords": [
    "an abstractive summarization",
    "their wikipedia plot summaries",
    "summarization",
    "we",
    "the movie screenplays",
    "document summarization",
    "it",
    "movie screenplays",
    "processing",
    "previous movie screenplay datasets",
    "2200 movie screenplays",
    "abstractive summarization",
    "movies",
    "recent studies",
    "a new dataset moviesum"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.239/",
  "provenance": {
    "collected_at": "2025-06-05 10:51:52",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}