{
  "id": "2024.findings-acl.944",
  "title": "A Survey on Predicting the Factuality and the Bias of News Media",
  "authors": [
    "Nakov, Preslav  and\nAn, Jisun  and\nKwak, Haewoon  and\nManzoor, Muhammad Arslan  and\nMujahid, Zain Muhammad  and\nSencar, Husrev Taha"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "The present level of proliferation of fake, biased, and propagandistic content online has made it impossible to fact-check every single suspicious claim or article, either manually or automatically. An increasing number of scholars are focusing on a coarser granularity, aiming to profile entire news outlets, which allows fast identification of potential “fake news” by checking the reliability of their source. Source factuality is also an important element of systems for automatic fact-checking and “fake news” detection, as they need to assess the reliability of the evidence they retrieve online. Political bias detection, which in the Western political landscape is about predicting left-center-right bias, is an equally important topic, which has experienced a similar shift toward profiling entire news outlets. Moreover, there is a clear connection between the two, as highly biased media are less likely to be factual; yet, the two problems have been addressed separately. In this survey, we review the state of the art on media profiling for factuality and bias, arguing for the need to model them jointly. We also shed light on some of the major challenges for modeling bias and factuality jointly. We further discuss interesting recent advances in using different information sources and modalities, which go beyond the text of the articles the target news outlet has published. Finally, we discuss current challenges and outline future research directions.",
  "keywords": [
    "the bias",
    "bias",
    "we",
    "current",
    "online political bias detection",
    "it",
    "information",
    "biased",
    "left-center-right bias",
    "text",
    "topic",
    "fast",
    "modalities",
    "modeling",
    "modeling bias"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.944/",
  "provenance": {
    "collected_at": "2025-06-05 11:01:28",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}