{
  "id": "2024.findings-acl.202",
  "title": "See It All: Contextualized Late Aggregation for 3{D} Dense Captioning",
  "authors": [
    "Kim, Minjung  and\nLim, Hyung  and\nKim, Seung Hwan  and\nLee, Soonyoung  and\nKim, Bumsoo  and\nKim, Gunhee"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "3D dense captioning is a task to localize objects in a 3D scene and generate descriptive sentences for each object. Recent approaches in 3D dense captioning have adopted transformer encoder-decoder frameworks from object detection to build an end-to-end pipeline without hand-crafted components. However, these approaches struggle with contradicting objectives where a single query attention has to simultaneously view both the tightly localized object regions and contextual environment. To overcome this challenge, we introduce SIA (See-It-All), a transformer pipeline that engages in 3D dense captioning with a novel paradigm called late aggregation. SIA simultaneously decodes two sets of queries—context query and instance query. The instance query focuses on localization and object attribute descriptions, while the context query versatilely captures the region-of-interest of relationships between multiple objects or with the global scene, then aggregated afterwards (i.e., late aggregation) via simple distance-based measures. To further enhance the quality of contextualized caption generation, we design a novel aggregator to generate a fully informed caption based on the surrounding context, the global environment, and object instances. Extensive experiments on two of the most widely-used 3D dense captioning datasets demonstrate that our proposed method achieves a significant improvement over prior methods.",
  "keywords": [
    "objectives",
    "end",
    "all a transformer pipeline",
    "all",
    "we",
    "it",
    "queries",
    "decoder",
    "e",
    "queries context query",
    "contradicting objectives",
    "i",
    "object",
    "transformer encoder-decoder frameworks",
    "late"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.202/",
  "provenance": {
    "collected_at": "2025-06-05 10:51:21",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}