{
  "id": "2024.gebnlp-1.25",
  "title": "An Empirical Study of Gendered Stereotypes in Emotional Attributes for {B}angla in Multilingual Large Language Models",
  "authors": [
    "Sadhu, Jayanta  and\nSaha, Maneesha  and\nShahriyar, Rifat"
  ],
  "year": "2024",
  "venue": "Proceedings of the 5th Workshop on Gender Bias in Natural Language Processing (GeBNLP)",
  "abstract": "The influence of Large Language Models (LLMs) is rapidly growing, automating more jobs over time. Assessing the fairness of LLMs is crucial due to their expanding impact. Studies reveal the reflection of societal norms and biases in LLMs, which creates a risk of propagating societal stereotypes in downstream tasks. Many studies on bias in LLMs focus on gender bias in various NLP applications. However, there’s a gap in research on bias in emotional attributes, despite the close societal link between emotion and gender. This gap is even larger for low-resource languages like Bangla. Historically, women are associated with emotions like empathy, fear, and guilt, while men are linked to anger, bravado, and authority. This pattern reflects societal norms in Bangla-speaking regions. We offer the first thorough investigation of gendered emotion attribution in Bangla for both closed and open source LLMs in this work. Our aim is to elucidate the intricate societal relationship between gender and emotion specifically within the context of Bangla. We have been successful in showing the existence of gender bias in the context of emotions in Bangla through analytical methods and also show how emotion attribution changes on the basis of gendered role selection in LLMs. All of our resources including code and data are made publicly available to support future research on Bangla NLP. Warning: This paper contains explicit stereotypical statements that many may find offensive.",
  "keywords": [
    "code",
    "bias",
    "the intricate societal relationship",
    "all",
    "we",
    "various nlp applications",
    "many studies",
    "societal stereotypes",
    "men",
    "the close societal link",
    "llms",
    "large language models llms",
    "their expanding impact studies",
    "biases",
    "multilingual large language models"
  ],
  "url": "https://aclanthology.org/2024.gebnlp-1.25/",
  "provenance": {
    "collected_at": "2025-06-05 11:06:20",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}