{
  "id": "2024.findings-acl.797",
  "title": "Exploring the Potential of Dense Information in Multimodal Alignment",
  "authors": [
    "Fan, Zhiyuan  and\nChen, Zhihong  and\nWang, Benyou"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Despite the success of data augmentation in improving CLIP model, existing methods that utilize LLM or SAM to enrich the information in captions still suffer from several limitations, including insufficient detail and excessive hallucinations, ultimately resulting in compromised alignment and masking the true potential of dense information. This can lead to erroneous conclusions about CLIP’s ability to handle rich data, impeding the development of more effective models. To address the limitations of existing methods, we introduce a novel pipeline that generates highly detailed, factually accurate captions for images, which facilitates in-depth analysis of the potential for dense information in multimodal alignment. Contrary to previous findings, our investigation revealed that lengthening captions boosts performance across diverse benchmarks, even surpassing the effectiveness of meticulously crafted hard negative samples. Building on these insights, DELIP is introduced, demonstrably enhancing both foundational multimodal alignment and compositional reasoning abilities. Finally, we explore strategies to expand the context window of the text encoder, unlocking the potential of richer data for CLIP and paving the way for advancements in leveraging dense information for multimodal alignment.",
  "keywords": [
    "compromised alignment",
    "insufficient detail",
    "we",
    "information",
    "rich",
    "both foundational multimodal alignment",
    "analysis",
    "compositional reasoning abilities",
    "abilities",
    "multimodal alignment",
    "text",
    "strategies",
    "insufficient",
    "the text encoder",
    "alignment"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.797/",
  "provenance": {
    "collected_at": "2025-06-05 10:59:28",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}