{
  "id": "2024.acl-long.305",
  "title": "Experiential Co-Learning of Software-Developing Agents",
  "authors": [
    "Qian, Chen  and\nDang, Yufan  and\nLi, Jiahao  and\nLiu, Wei  and\nXie, Zihao  and\nWang, YiFei  and\nChen, Weize  and\nYang, Cheng  and\nCong, Xin  and\nChe, Xiaoyin  and\nLiu, Zhiyuan  and\nSun, Maosong"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Recent advancements in large language models (LLMs) have brought significant changes to various domains, especially through LLM-driven autonomous agents. A representative scenario is in software development, where LLM agents demonstrate efficient collaboration, task division, and assurance of software quality, markedly reducing the need for manual involvement. However, these agents frequently perform a variety of tasks independently, without benefiting from past experiences, which leads to repeated mistakes and inefficient attempts in multi-step task execution. To this end, we introduce Experiential Co-Learning, a novel LLM-agent learning framework in which instructor and assistant agents gather shortcut-oriented experiences from their historical trajectories and use these past experiences for future task execution. The extensive experiments demonstrate that the framework enables agents to tackle unseen software-developing tasks more effectively. We anticipate that our insights will guide LLM agents towards enhanced autonomy and contribute to their evolutionary growth in cooperative learning. The code and data are available at https://github.com/OpenBMB/ChatDev.",
  "keywords": [
    "variety",
    "code",
    "end",
    "inefficient",
    "efficient",
    "experiential co",
    "we",
    "llm agents",
    "llm",
    "inefficient attempts",
    "these past experiences",
    "efficient collaboration task division",
    "learning",
    "a variety",
    "llms"
  ],
  "url": "https://aclanthology.org/2024.acl-long.305/",
  "provenance": {
    "collected_at": "2025-06-05 10:38:29",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}