{
  "id": "2024.bionlp-1.38",
  "title": "Automatic Extraction of Disease Risk Factors from Medical Publications",
  "authors": [
    "Rubchinsky, Maxim  and\nRabinovich, Ella  and\nShribman, Adi  and\nGolan, Netanel  and\nSahar, Tali  and\nShweiki, Dorit"
  ],
  "year": "2024",
  "venue": "Proceedings of the 23rd Workshop on Biomedical Natural Language Processing",
  "abstract": "We present a novel approach to automating the identification of risk factors for diseases from medical literature, leveraging pre-trained models in the bio-medical domain, while tuning them for the specific task. Faced with the challenges of the diverse and unstructured nature of medical articles, our study introduces a multi-step system to first identify relevant articles, then classify them based on the presence of risk factor discussions and, finally, extract specific risk factor information for a disease through a question-answering model. Our contributions include the development of a comprehensive pipeline for the automated extraction of risk factors and the compilation of several datasets, which can serve as valuable resources for further research in this area. These datasets encompass a wide range of diseases, as well as their associated risk factors, meticulously identified and validated through a fine-grained evaluation scheme. We conducted both automatic and thorough manual evaluation, demonstrating encouraging results. We also highlight the importance of improving models and expanding dataset comprehensiveness to keep pace with the rapidly evolving field of medical research.",
  "keywords": [
    "extraction",
    "field",
    "question",
    "we",
    "information",
    "model",
    "the rapidly evolving field",
    "evaluation",
    "pre",
    "a fine-grained evaluation scheme",
    "area",
    "disease",
    "multi",
    "approach",
    "this area"
  ],
  "url": "https://aclanthology.org/2024.bionlp-1.38/",
  "provenance": {
    "collected_at": "2025-06-05 11:04:26",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}