{
  "id": "2024.acl-long.140",
  "title": "RLHFP}oison: Reward Poisoning Attack for Reinforcement Learning with Human Feedback in Large Language Models",
  "authors": [
    "Wang, Jiongxiao  and\nWu, Junlin  and\nChen, Muhao  and\nVorobeychik, Yevgeniy  and\nXiao, Chaowei"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Reinforcement Learning with Human Feedback (RLHF) is a methodology designed to align Large Language Models (LLMs) with human preferences, playing an important role in LLMs alignment. Despite its advantages, RLHF relies on human annotators to rank the text, which can introduce potential security vulnerabilities if any adversarial annotator (i.e., attackers) manipulates the ranking score by up-ranking any malicious text to steer the LLM adversarially. To assess the red-teaming of RLHF against human preference data poisoning, we propose RankPoison, a poisoning attack method on candidates’ selection of preference rank flipping to reach certain malicious behaviors (e.g., generating longer sequences, which can increase the computational cost). With poisoned dataset generated by RankPoison, we can perform poisoning attacks on LLMs to generate longer tokens without hurting the original safety alignment performance. Moreover, applying RankPoison, we also successfully implement a backdoor attack where LLMs can generate longer answers under questions with the trigger word. Our findings highlight critical security challenges in RLHF, underscoring the necessity for more robust alignment methods for LLMs.",
  "keywords": [
    "feedback",
    "we",
    "human feedback rlhf",
    "human feedback",
    "rlhfp",
    "llm",
    "red",
    "rlhf",
    "word",
    "learning",
    "llms",
    "i",
    "text",
    "potential security vulnerabilities",
    "the llm"
  ],
  "url": "https://aclanthology.org/2024.acl-long.140/",
  "provenance": {
    "collected_at": "2025-06-05 10:36:12",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}