{
  "id": "2024.acl-long.342",
  "title": "An Open Multilingual System for Scoring Readability of {W}ikipedia",
  "authors": [
    "Trokhymovych, Mykola  and\nSen, Indira  and\nGerlach, Martin"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "With over 60M articles, Wikipedia has become the largest platform for open and freely accessible knowledge. While it has more than 15B monthly visits, its content is believed to be inaccessible to many readers due to the lack of readability of its text. However, previous investigations of the readability of Wikipedia have been restricted to English only, and there are currently no systems supporting the automatic readability assessment of the 300+ languages in Wikipedia. To bridge this gap, we develop a multilingual model to score the readability of Wikipedia articles. To train and evaluate this model, we create a novel multilingual dataset spanning 14 languages, by matching articles from Wikipedia to simplified Wikipedia and online children encyclopedias. We show that our model performs well in a zero-shot scenario, yielding a ranking accuracy of more than 80% across 14 languages and improving upon previous benchmarks. These results demonstrate the applicability of the model at scale for languages in which there is no ground-truth data available for model fine-tuning. Furthermore, we provide the first overview on the state of readability in Wikipedia beyond English.",
  "keywords": [
    "the first overview",
    "overview",
    "simplified wikipedia",
    "a zero-shot scenario",
    "we",
    "shot",
    "it",
    "tuning",
    "a ranking accuracy",
    "text",
    "fine",
    "accuracy",
    "knowledge",
    "model fine-tuning",
    "model"
  ],
  "url": "https://aclanthology.org/2024.acl-long.342/",
  "provenance": {
    "collected_at": "2025-06-05 10:39:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}