{
  "id": "2024.findings-acl.890",
  "title": "Found in the middle: Calibrating Positional Attention Bias Improves Long Context Utilization",
  "authors": [
    "Hsieh, Cheng-Yu  and\nChuang, Yung-Sung  and\nLi, Chun-Liang  and\nWang, Zifeng  and\nLe, Long  and\nKumar, Abhishek  and\nGlass, James  and\nRatner, Alexander  and\nLee, Chen-Yu  and\nKrishna, Ranjay  and\nPfister, Tomas"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Large language models (LLMs), even when specifically trained to process long input contexts, struggle to capture relevant information located in the middle of their input. This phenomenon has been known as the lost-in-the-middle problem. In this work, we make three contributions. First, we set out to understand the factors that cause this phenomenon. In doing so, we establish a connection between lost-in-the-middle to LLMs’ intrinsic attention bias: LLMs exhibit an U-shaped attention bias where the tokens at the beginning and at the end of its input receive higher attention, regardless of their relevance. Second, we mitigate this positional bias through a calibration mechanism, found-in-the-middle, that allows the model to attend to contexts faithfully according to their relevance, even though when they are in the middle. Third, we show found-in-the-middle not only achieves better performance in locating relevant information within a long context, but also eventually leads to improved retrieval-augmented generation (RAG) performance across various tasks, outperforming existing methods by up to 10 percentage point. These findings open up future directions in understanding LLM attention bias and its potential consequences.",
  "keywords": [
    "bias",
    "end",
    "we",
    "llm",
    "llm attention bias",
    "retrieval",
    "information",
    "llms",
    "higher attention",
    "work",
    "an u-shaped attention bias",
    "language",
    "generation",
    "model",
    "this positional bias"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.890/",
  "provenance": {
    "collected_at": "2025-06-05 11:00:44",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}