{
  "id": "2024.findings-acl.952",
  "title": "DIMSIM}: Distilled Multilingual Critics for {I}ndic Text Simplification",
  "authors": [
    "Mondal, Sneha  and\nRitika, Ritika  and\nAgrawal, Ashish  and\nJyothi, Preethi  and\nRaghuveer, Aravindan"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Self-correction techniques have recently emerged as a promising framework to improve the quality of responses generated by large language models (LLMs). Few-shot prompted LLMs act as critics to produce feedback for an input, which is further fed to a refiner (also an LLM) to produce an output. However, these critique-refine steps require multiple expensive LLM calls. To circumvent this large inference cost, we borrow inspiration from prior work on knowledge distillation and propose the use of critique distillation to train critic models. These are smaller sequence-to-sequence models that are trained on input-critique pairs generated by an LLM. We focus on the problem of text simplification for three Indian languages: Hindi, Bengali and Marathi. This task is a good fit for self-correction style techniques. It also hasn’t been systematically explored for Indian languages before. We train two separate critics that focus on lexical and structure complexity, and show that it is surprisingly more effective than using an LLM directly as a critic in both 0-shot and few-shot settings. We also show the benefits of training multilingual critics, as opposed to monolingual critics. Extensive human evaluations show that on average, raters find 80% of DIMSIM’s output to be simple and easy to read.",
  "keywords": [
    "feedback",
    "refiner",
    "fit",
    "an llm",
    "we",
    "llm",
    "shot",
    "few-shot",
    "it",
    "self",
    "sequence",
    "llms",
    "text",
    "also an llm",
    "extensive human evaluations"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.952/",
  "provenance": {
    "collected_at": "2025-06-05 11:01:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}