{
  "id": "2024.acl-long.801",
  "title": "Talk With Human-like Agents: Empathetic Dialogue Through Perceptible Acoustic Reception and Reaction",
  "authors": [
    "Yan, Haoqiu  and\nZhu, Yongxin  and\nZheng, Kai  and\nLiu, Bing  and\nCao, Haoyu  and\nJiang, Deqiang  and\nXu, Linli"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Large Language Model (LLM)-enhanced agents become increasingly prevalent in Human-AI communication, offering vast potential from entertainment to professional domains. However, current multi-modal dialogue systems overlook the acoustic information present in speech, which is crucial for understanding human communication nuances. This oversight can lead to misinterpretations of speakers’ intentions, resulting in inconsistent or even contradictory responses within dialogues. To bridge this gap, in this paper, we propose PerceptiveAgent, an empathetic multi-modal dialogue system designed to discern deeper or more subtle meanings beyond the literal interpretations of words through the integration of speech modality perception. Employing LLMs as a cognitive core, PerceptiveAgent perceives acoustic information from input speech and generates empathetic responses based on speaking styles described in natural language. Experimental results indicate that PerceptiveAgent excels in contextual understanding by accurately discerning the speakers’ true intentions in scenarios where the linguistic meaning is either contrary to or inconsistent with the speaker’s true feelings, producing more nuanced and expressive spoken dialogues. Code is publicly available at: https://github.com/Haoqiu-Yan/PerceptiveAgent.",
  "keywords": [
    "code",
    "we",
    "dialogue",
    "current",
    "natural",
    "information",
    "core",
    "llms",
    "current multi-modal dialogue systems",
    "language",
    "model",
    "dialogues",
    "human",
    "multi",
    "the speakers"
  ],
  "url": "https://aclanthology.org/2024.acl-long.801/",
  "provenance": {
    "collected_at": "2025-06-05 10:45:19",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}