{
  "id": "2024.textgraphs-1.2",
  "title": "C}on{G}ra{T}: Self-Supervised Contrastive Pretraining for Joint Graph and Text Embeddings",
  "authors": [
    "Brannon, William  and\nKang, Wonjune  and\nFulay, Suyash  and\nJiang, Hang  and\nRoy, Brandon  and\nRoy, Deb  and\nKabbara, Jad"
  ],
  "year": "2024",
  "venue": "Proceedings of TextGraphs-17: Graph-based Methods for Natural Language Processing",
  "abstract": "Learning on text-attributed graphs (TAGs), in which nodes are associated with one or more texts, has been the subject of much recent work. However, most approaches tend to make strong assumptions about the downstream task of interest, are reliant on hand-labeled data, or fail to equally balance the importance of both text and graph representations. In this work, we propose Contrastive Graph-Text pretraining (ConGraT), a general, self-supervised approach for jointly learning separate representations of texts and nodes in a TAG. Our method trains a language model (LM) and a graph neural network (GNN) to align their representations in a common latent space using a batch-wise contrastive learning objective inspired by CLIP. We further propose an extension to the CLIP objective that leverages graph structure to incorporate information about inter-node similarity. Extensive experiments demonstrate that ConGraT outperforms baselines on various downstream tasks, including node and text category classification, link prediction, and language modeling. Finally, we present an application of our method to community detection in social graphs, which enables finding more textually grounded communities, rather than purely graph-based ones.",
  "keywords": [
    "communities",
    "the clip objective",
    "we",
    "graph",
    "language modeling",
    "classification",
    "more textually grounded communities",
    "neural",
    "self",
    "information",
    "tag",
    "latent",
    "learning",
    "a language model",
    "text"
  ],
  "url": "https://aclanthology.org/2024.textgraphs-1.2/",
  "provenance": {
    "collected_at": "2025-06-05 11:11:22",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}