{
  "id": "2024.acl-long.489",
  "title": "M}$^3${AV}: A Multimodal, Multigenre, and Multipurpose Audio-Visual Academic Lecture Dataset",
  "authors": [
    "Chen, Zhe  and\nLiu, Heyang  and\nYu, Wenyi  and\nSun, Guangzhi  and\nLiu, Hongcheng  and\nWu, Ji  and\nZhang, Chao  and\nWang, Yu  and\nWang, Yanfeng"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Publishing open-source academic video recordings is an emergent and prevalent approach to sharing knowledge online. Such videos carry rich multimodal information including speech, the facial and body movements of the speakers, as well as the texts and pictures in the slides and possibly even the papers. Although multiple academic video datasets have been constructed and released, few of them support both multimodal content recognition and understanding tasks, which is partially due to the lack of high-quality human annotations. In this paper, we propose a novel multimodal, multigenre, and multipurpose audio-visual academic lecture dataset (M3AV), which has almost 367 hours of videos from five sources covering computer science, mathematics, and medical and biology topics. With high-quality human annotations of the slide text and spoken words, in particular high-valued name entities, the dataset can be used for multiple audio-visual recognition and understanding tasks. Evaluations performed on contextual speech recognition, speech synthesis, and slide and script generation tasks demonstrate that the diversity of M3AV makes it a challenging dataset.",
  "keywords": [
    "particular high-valued name entities",
    "we",
    "computer science mathematics",
    "it",
    "information",
    "science",
    "rich",
    "visual",
    "text",
    "understanding tasks evaluations",
    "knowledge",
    "generation",
    "entities",
    "human",
    "evaluations"
  ],
  "url": "https://aclanthology.org/2024.acl-long.489/",
  "provenance": {
    "collected_at": "2025-06-05 10:41:02",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}