{
  "id": "2024.acl-long.382",
  "title": "Mirror: Multiple-perspective Self-Reflection Method for Knowledge-rich Reasoning",
  "authors": [
    "Yan, Hanqi  and\nZhu, Qinglin  and\nWang, Xinyu  and\nGui, Lin  and\nHe, Yulan"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "While Large language models (LLMs) have the capability to iteratively reflect on their own outputs, recent studies have observed their struggles with knowledge-rich problems without access to external resources. In addition to the inefficiency of LLMs in self-assessment, we also observe that LLMs struggle to revisit their predictions despite receiving explicit negative feedback. Therefore, We propose Mirror, a Multiple-perspective self-reflection method for knowledge-rich reasoning, to avoid getting stuck at a particular reflection iteration. Mirror enables LLMs to reflect from multiple-perspective clues, achieved through a heuristic interaction between a Navigator and a Reasoner. It guides agents toward diverse yet plausibly reliable reasoning trajectory without access to ground truth by encouraging (1) diversity of directions generated by Navigator and (2) agreement among strategically induced perturbations in responses generated by the Reasoner. The experiments on five reasoning datasets demonstrate that Mirror’s superiority over several contemporary self-reflection approaches. Additionally, the ablation study studies clearly indicate that our strategies alleviate the aforementioned challenges.",
  "keywords": [
    "the ablation study studies",
    "feedback",
    "we",
    "it",
    "self",
    "a reasoner",
    "rich",
    "llms",
    "strategies",
    "large language models llms",
    "reasoner",
    "inefficiency",
    "recent studies",
    "the inefficiency",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2024.acl-long.382/",
  "provenance": {
    "collected_at": "2025-06-05 10:39:33",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}