{
  "id": "2024.findings-acl.126",
  "title": "From Model-centered to Human-Centered: Revision Distance as a Metric for Text Evaluation in {LLM}s-based Applications",
  "authors": [
    "Ma, Yongqiang  and\nQing, Lizhi  and\nLiu, Jiawei  and\nKang, Yangyang  and\nZhang, Yue  and\nLu, Wei  and\nLiu, Xiaozhong  and\nCheng, Qikai"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Evaluating large language models (LLMs) is fundamental, particularly in the context of practical applications. Conventional evaluation methods, typically designed primarily for LLM development, yield numerical scores that ignore the user experience. Therefore, our study shifts the focus from model-centered to human-centered evaluation in the context of AI-powered writing assistance applications. Our proposed metric, termed “Revision Distance,” utilizes LLMs to suggest revision edits that mimic the human writing process. It is determined by counting the revision edits generated by LLMs. Benefiting from the generated revision edit details, our metric can provide a self-explained text evaluation result in a human-understandable manner beyond the context-independent score. Our results show that for the easy-writing task, “Revision Distance” is consistent with established metrics (ROUGE, Bert-score, and GPT-score), but offers more insightful, detailed feedback and better distinguishes between texts. Moreover, in the context of challenging academic writing tasks, our metric still delivers reliable evaluations where other metrics tend to struggle. Furthermore, our metric also holds significant potential for scenarios lacking reference texts.",
  "keywords": [
    "established metrics rouge bert-score",
    "feedback",
    "yield",
    "text evaluation",
    "llm",
    "llm s-based applications",
    "it",
    "self",
    "a human-understandable manner",
    "manner",
    "llms",
    "other metrics",
    "the user experience",
    "bert",
    "metric"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.126/",
  "provenance": {
    "collected_at": "2025-06-05 10:50:19",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}