{
  "id": "2024.wassa-1.3",
  "title": "Modeling Complex Interactions in Long Documents for Aspect-Based Sentiment Analysis",
  "authors": [
    "Yan, Zehong  and\nHsu, Wynne  and\nLee, Mong-Li  and\nBartram-Shaw, David"
  ],
  "year": "2024",
  "venue": "Proceedings of the 14th Workshop on Computational Approaches to Subjectivity, Sentiment, {\\&} Social Media Analysis",
  "abstract": "The growing number of online articles and reviews necessitates innovative techniques for document-level aspect-based sentiment analysis. Capturing the context in which an aspect is mentioned is crucial. Existing models have focused on relatively short reviews and may fail to consider distant contextual information. This is especially so in longer documents where an aspect may be referred to in multiple ways across dispersed sentences. This work introduces a hierarchical Transformer-based architecture that encodes information at different level of granularities with attention aggregation mechanisms to learn the local and global aspect-specific document representations. For empirical validation, we curate two datasets of long documents: one on social issues, and another covering various topics involving trust-related issues. Experimental results show that the proposed architecture outperforms state-of-the-art methods for document-level aspect-based sentiment classification. We also demonstrate the potential applicability of our approach for long document trust prediction.",
  "keywords": [
    "attention aggregation mechanisms",
    "validation",
    "granularities",
    "we",
    "classification",
    "document-level aspect-based sentiment classification",
    "relatively short reviews",
    "information",
    "analysis",
    "reviews",
    "document-level aspect-based sentiment analysis",
    "sentiment",
    "work",
    "a hierarchical transformer-based architecture",
    "transformer"
  ],
  "url": "https://aclanthology.org/2024.wassa-1.3/",
  "provenance": {
    "collected_at": "2025-06-05 11:11:37",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}