{
  "id": "2024.findings-acl.806",
  "title": "Training a Better {C}hinese Spelling Correction Model via Prior-knowledge Guided Teacher",
  "authors": [
    "Wei, Chi  and\nHuang, Shaobin  and\nLi, Rongsheng  and\nYan, Naiyu  and\nWang, Rui"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Recent advancements in Chinese Spelling Correction (CSC) predominantly leverage pre-trained language models (PLMs). However, a notable challenge with fine-tuned PLM-based CSC models is their tendency to over-correct, leading to poor generalization for error patterns outside the standard distribution. To address this, we developed a teacher network guided by prior knowledge for distillation learning of CSC models. Unlike traditional teacher networks, which depend on task-related pre-training, our method infuses task-related prior information into the teacher network, offering guidance beyond mere labels to the student network. This strategy significantly enhances the CSC model’s language modeling capabilities, crucial for minimizing over-correction. Importantly, our approach is model-independent and the teacher network does not require task-related pre-training, making it broadly applicable for enhancing various PLM-based CSC models with minimal additional computational resources. Extensive experiments on widely used benchmarks demonstrate that our method achieves new state-of-the-art results. Additionally, we explored the potential of generalizing our method to other non-autoregressive text-generation tasks.",
  "keywords": [
    "we",
    "poor generalization",
    "training",
    "it",
    "task-related pre-training",
    "information",
    "pre-trained language models plms",
    "learning",
    "text",
    "generalization",
    "other non-autoregressive text-generation tasks",
    "knowledge",
    "language",
    "generation",
    "model"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.806/",
  "provenance": {
    "collected_at": "2025-06-05 10:59:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}