{
  "id": "2024.acl-long.586",
  "title": "The Dawn After the Dark: An Empirical Study on Factuality Hallucination in Large Language Models",
  "authors": [
    "Li, Junyi  and\nChen, Jie  and\nRen, Ruiyang  and\nCheng, Xiaoxue  and\nZhao, Xin  and\nNie, Jian-Yun  and\nWen, Ji-Rong"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "In the era of large language models (LLMs), hallucination (the tendency to generate factually incorrect content) poses great challenges to trustworthy and reliable deployment of LLMs in real-world applications. To tackle the hallucination, three key questions should be well studied: how to detect hallucinations (detection), why do LLMs hallucinate (source), and what can be done to mitigate them (mitigation). To address these challenges, this work presents a systematic empirical study on LLM hallucinations, focused on the three aspects of hallucination detection, source and mitigation. Specially, we construct a new hallucination benchmark HaluEval 2.0, and design a simple yet effective detection method for LLM hallucinations. Furthermore, we zoom into the different training or utilization stages of LLMs and extensively analyze the potential factors that lead to the LLM hallucinations. Finally, we implement and examine a series of widely used techniques to mitigate the hallucinations in LLMs. Our work has led to several important findings to understand the hallucination origin and mitigate the hallucinations in LLMs.",
  "keywords": [
    "series",
    "era",
    "we",
    "llm",
    "training",
    "llms",
    "work",
    "a series",
    "language",
    "large language models",
    "llm hallucinations",
    "the llm hallucinations",
    "great",
    "dawn",
    "an empirical study"
  ],
  "url": "https://aclanthology.org/2024.acl-long.586/",
  "provenance": {
    "collected_at": "2025-06-05 10:42:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}