{
  "id": "2024.acl-long.747",
  "title": "Evaluating Very Long-Term Conversational Memory of {LLM} Agents",
  "authors": [
    "Maharana, Adyasha  and\nLee, Dong-Ho  and\nTulyakov, Sergey  and\nBansal, Mohit  and\nBarbieri, Francesco  and\nFang, Yuwei"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Existing works on long-term open-domain dialogues focus on evaluating model responses within contexts spanning no more than five chat sessions. Despite advancements in long-context large language models (LLMs) and retrieval augmented generation (RAG) techniques, their efficacy in very long-term dialogues remains unexplored. To address this research gap, we introduce a machine-human pipeline to generate high-quality, very long-term dialogues by leveraging LLM-based agent architectures and grounding their dialogues on personas and temporal event graphs. Moreover, we equip each agent with the capability of sharing and reacting to images. The generated conversations are verified and edited by human annotators for long-range consistency and grounding to the event graphs. Using this pipeline, we collect LoCoMo, a dataset of very long-term conversations, each encompassing 600 turns and 16K tokens on avg., over up to 32 sessions. Based on LoCoMo, we present a comprehensive evaluation benchmark to measure long-term memory in models, encompassing question answering, event summarization, and multi-modal dialogue generation tasks. Our experimental results indicate that LLMs exhibit challenges in understanding lengthy conversations and comprehending long-range temporal and causal dynamics within dialogues. Employing strategies like long-context LLMs or RAG can offer improvements but these models still substantially lag behind human performance.",
  "keywords": [
    "conversations",
    "a comprehensive evaluation benchmark",
    "question",
    "summarization",
    "we",
    "their dialogues",
    "dialogue",
    "llm agents",
    "llm",
    "high-quality very long-term dialogues",
    "event summarization",
    "very long-term conversations",
    "long-term open-domain dialogues",
    "the generated conversations",
    "very long-term dialogues"
  ],
  "url": "https://aclanthology.org/2024.acl-long.747/",
  "provenance": {
    "collected_at": "2025-06-05 10:44:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}