{
  "id": "2024.acl-srw.35",
  "title": "Trace-of-Thought Prompting: Investigating Prompt-Based Knowledge Distillation Through Question Decomposition",
  "authors": [
    "McDonald, Tyler  and\nEmami, Ali"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 4: Student Research Workshop)",
  "abstract": "Knowledge distillation allows smaller neural networks to emulate the performance of larger, teacher models with reduced computational demands. Traditional methods for Large Language Models (LLMs) often necessitate extensive fine-tuning, which limits their accessibility. To address this, we introduce Trace-of-Thought Prompting, a novel framework designed to distill critical reasoning capabilities from large-scale teacher models (over 8 billion parameters) to small-scale student models (up to 8 billion parameters). This approach leverages problem decomposition to enhance interpretability and facilitate human-in-the-loop interventions. Empirical evaluations on the GSM8K and MATH datasets show that student models achieve accuracy gains of up to 113% on GSM8K and 20% on MATH, with significant improvements particularly notable in smaller models like Llama 2 and Zephyr. Our results suggest a promising pathway for open-source, small-scale models to eventually serve as both students and teachers, potentially reducing our reliance on large-scale, proprietary models. Our code, featuring data analytics and testing scripts, is provided here: https://github.com/traceofthought/trace-of-thought-prompting/tree/main.",
  "keywords": [
    "code",
    "question",
    "large-scale proprietary models",
    "extensive fine-tuning",
    "we",
    "accuracy gains",
    "neural",
    "prompt-based knowledge distillation",
    "smaller neural networks",
    "tuning",
    "prompt",
    "fine",
    "accuracy",
    "knowledge",
    "language"
  ],
  "url": "https://aclanthology.org/2024.acl-srw.35/",
  "provenance": {
    "collected_at": "2025-06-05 10:48:11",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}