{
  "id": "2024.acl-long.823",
  "title": "SPZ}: A Semantic Perturbation-based Data Augmentation Method with Zonal-Mixing for {A}lzheimer{'}s Disease Detection",
  "authors": [
    "Li, FangFang  and\nHuang, Cheng  and\nSu, PuZhen  and\nYin, Jie"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Alzheimer’s Disease (AD), characterized by significant cognitive and functional impairment, necessitates the development of early detection techniques. Traditional diagnostic practices, such as cognitive assessments and biomarker analysis, are often invasive and costly. Deep learning-based approaches for non-invasive AD detection have been explored in recent studies, but the lack of accessible data hinders further improvements in detection performance. To address these challenges, we propose a novel semantic perturbation-based data augmentation method that essentially differs from existing techniques, which primarily rely on explicit data engineering. Our approach generates controlled semantic perturbations to enhance textual representations, aiding the model in identifying AD-specific linguistic patterns, particularly in scenarios with limited data availability. It learns contextual information and dynamically adjusts the perturbation degree for different linguistic features. This enhances the model’s sensitivity to AD-specific linguistic features and its robustness against natural language noise. Experimental results on the ADReSS challenge dataset demonstrate that our approach outperforms other strong and competitive deep learning methods.",
  "keywords": [
    "deep",
    "semantic",
    "we",
    "natural",
    "it",
    "controlled semantic perturbations",
    "information",
    "learning",
    "analysis",
    "early",
    "recent studies",
    "language",
    "model",
    "studies",
    "disease"
  ],
  "url": "https://aclanthology.org/2024.acl-long.823/",
  "provenance": {
    "collected_at": "2025-06-05 10:45:38",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}