{
  "id": "2024.iwslt-1.36",
  "title": "Fixed and Adaptive Simultaneous Machine Translation Strategies Using Adapters",
  "authors": [
    "Issam, Abderrahmane  and\nCan Semerci, Yusuf  and\nScholtes, Jan  and\nSpanakis, Gerasimos"
  ],
  "year": "2024",
  "venue": "Proceedings of the 21st International Conference on Spoken Language Translation (IWSLT 2024)",
  "abstract": "Simultaneous machine translation aims at solving the task of real-time translation by starting to translate before consuming the full input, which poses challenges in terms of balancing quality and latency of the translation. The wait-k policy offers a solution by starting to translate after consuming words, where the choice of the number k directly affects the latency and quality. In applications where we seek to keep the choice over latency and quality at inference, the wait-k policy obliges us to train more than one model. In this paper, we address the challenge of building one model that can fulfil multiple latency levels and we achieve this by introducing lightweight adapter modules into the decoder. The adapters are trained to be specialized for different wait-k values and compared to other techniques they offer more flexibility to allow for reaping the benefits of parameter sharing and minimizing interference. Additionally, we show that by combining with an adaptive strategy, we can further improve the results. Experiments on two language directions show that our method outperforms or competes with other strong baselines on most latency values.",
  "keywords": [
    "the decoder",
    "adapters simultaneous machine translation",
    "we",
    "parameter",
    "translation",
    "decoder",
    "the translation",
    "strategies",
    "language",
    "model",
    "machine",
    "real-time translation",
    "us",
    "time",
    "interference"
  ],
  "url": "https://aclanthology.org/2024.iwslt-1.36/",
  "provenance": {
    "collected_at": "2025-06-05 11:06:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}