{
  "id": "2024.findings-acl.830",
  "title": "CP}sy{C}oun: A Report-based Multi-turn Dialogue Reconstruction and Evaluation Framework for {C}hinese Psychological Counseling",
  "authors": [
    "Zhang, Chenhao  and\nLi, Renhao  and\nTan, Minghuan  and\nYang, Min  and\nZhu, Jingwei  and\nYang, Di  and\nZhao, Jiahao  and\nYe, Guancheng  and\nLi, Chengming  and\nHu, Xiping"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Using large language models (LLMs) to assist psychological counseling is a significant but challenging task at present. Attempts have been made on improving empathetic conversations or acting as effective assistants in the treatment with LLMs. However, the existing datasets lack consulting knowledge, resulting in LLMs lacking professional consulting competence. Moreover, how to automatically evaluate multi-turn dialogues within the counseling process remains an understudied area. To bridge the gap, we propose CPsyCoun, a report-based multi-turn dialogue reconstruction and evaluation framework for Chinese psychological counseling. To fully exploit psychological counseling reports, a two-phase approach is devised to construct high-quality dialogues while a comprehensive evaluation benchmark is developed for the effective automatic evaluation of multi-turn psychological consultations. Competitive experimental results demonstrate the effectiveness of our proposed framework in psychological counseling. We open-source the datasets and model for future research.",
  "keywords": [
    "conversations",
    "empathetic conversations",
    "a comprehensive evaluation benchmark",
    "dialogue reconstruction",
    "we",
    "dialogue",
    "the effective automatic evaluation",
    "an understudied area",
    "understudied",
    "llms",
    "high-quality dialogues",
    "evaluation framework",
    "process",
    "knowledge",
    "language"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.830/",
  "provenance": {
    "collected_at": "2025-06-05 10:59:55",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}