{
  "id": "2024.arabicnlp-1.72",
  "title": "Eagles at {FIGNEWS} 2024 Shared Task: A Context-informed Prescriptive Approach to Bias Detection in Contentious News Narratives",
  "authors": [
    "Chan, Amanda  and\nA.Baddar, Mai  and\nBaazaoui, Sofien"
  ],
  "year": "2024",
  "venue": "Proceedings of the Second Arabic Natural Language Processing Conference",
  "abstract": "This research paper presents an in-depth examination of bias identification in media content related to the Israel-Palestine war. Focusing on the annotation guidelines and process developed by our team of researchers, the document outlines a systematic approach to discerning bias in articles. Through meticulous analysis, key indicators of bias such as emotive language, weasel words, and loaded comparisons are identified and discussed. The paper also explores the delineation between facts and opinions, emphasizing the importance of maintaining objectivity in annotation. Ethical considerations, including the handling of sensitive data and the promotion of multipartiality among annotators, are carefully addressed. The annotation guidelines also include other ethical considerations such as identifying rumors, false information, exercising prudence and selective quotations. The research paper offers insights into the annotation experience, highlighting common mistakes and providing valuable guidelines for future research in bias identification. By providing a comprehensive framework for evaluating bias in media coverage of the Israel-Palestine war, this study contributes to a deeper understanding of the complexities inherent in media discourse surrounding contentious geopolitical issues.",
  "keywords": [
    "bias",
    "complexities",
    "war",
    "information",
    "the annotation experience",
    "analysis",
    "the complexities",
    "experience",
    "process",
    "language",
    "bias identification",
    "approach",
    "future research",
    "media",
    "weasel"
  ],
  "url": "https://aclanthology.org/2024.arabicnlp-1.72/",
  "provenance": {
    "collected_at": "2025-06-05 11:03:10",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}