{
  "id": "2024.acl-long.421",
  "title": "Order-Agnostic Data Augmentation for Few-Shot Named Entity Recognition",
  "authors": [
    "Wang, Huiming  and\nCheng, Liying  and\nZhang, Wenxuan  and\nSoh, De Wen  and\nBing, Lidong"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Data augmentation (DA) methods have been proven to be effective for pre-trained language models (PLMs) in low-resource settings, including few-shot named entity recognition (NER). However, existing NER DA techniques either perform rule-based manipulations on words that break the semantic coherence of the sentence, or exploit generative models for entity or context substitution, which requires a substantial amount of labeled data and contradicts the objective of operating in low-resource settings. In this work, we propose order-agnostic data augmentation (OaDA), an alternative solution that exploits the often overlooked order-agnostic property in the training data construction phase of sequence-to-sequence NER methods for data augmentation. To effectively utilize the augmented data without suffering from the one-to-many issue, where multiple augmented target sequences exist for one single sentence, we further propose the use of ordering instructions and an innovative OaDA-XE loss. Specifically, by treating each permutation of entity types as an ordering instruction, we rearrange the entity set accordingly, ensuring a distinct input-output pair, while OaDA-XE assigns loss based on the best match between the target sequence and model predictions. We conduct comprehensive experiments and analyses across three major NER benchmarks and significantly enhance the few-shot capabilities of PLMs with OaDA.",
  "keywords": [
    "generative models",
    "semantic",
    "we",
    "shot",
    "training",
    "instruction",
    "the objective",
    "loss",
    "pre-trained language models plms",
    "sequence",
    "existing ner da techniques",
    "generative",
    "ner",
    "objective",
    "the few-shot capabilities"
  ],
  "url": "https://aclanthology.org/2024.acl-long.421/",
  "provenance": {
    "collected_at": "2025-06-05 10:40:06",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}