{
  "id": "2024.findings-acl.714",
  "title": "Discovering influential text using convolutional neural networks",
  "authors": [
    "Ayers, Megan  and\nSanford, Luke  and\nRoberts, Margaret  and\nYang, Eddie"
  ],
  "year": "2024",
  "venue": "Findings of the Association for Computational Linguistics: ACL 2024",
  "abstract": "Experimental methods for estimating the impacts of text on human evaluation have been widely used in the social sciences. However, researchers in experimental settings are usually limited to testing a small number of pre-specified text treatments. While efforts to mine unstructured texts for features that causally affect outcomes have been ongoing in recent years, these models have primarily focused on the topics or specific words of text, which may not always be the mechanism of the effect. We connect these efforts with NLP interpretability techniques and present a method for flexibly discovering clusters of similar text phrases that are predictive of human reactions to texts using convolutional neural networks. When used in an experimental setting, this method can identify text treatments and their effects under certain assumptions. We apply the method to two data sets. The first enables direct validation of the model’s ability to detect phrases known to cause the outcome. The second demonstrates its ability to flexibly discover text treatments with varying textual structures. In both cases, the model learns a greater variety of text treatments compared to benchmark methods, and these text features quantitatively meet or exceed the ability of benchmark methods to predict the outcome.",
  "keywords": [
    "variety",
    "validation",
    "sciences",
    "we",
    "convolutional",
    "human evaluation",
    "convolutional neural networks",
    "neural",
    "text",
    "nlp interpretability techniques",
    "a greater variety",
    "the social sciences",
    "specified",
    "nlp",
    "model"
  ],
  "url": "https://aclanthology.org/2024.findings-acl.714/",
  "provenance": {
    "collected_at": "2025-06-05 10:58:21",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}