{
  "id": "2024.acl-long.703",
  "title": "Living in the Moment: Can Large Language Models Grasp Co-Temporal Reasoning?",
  "authors": [
    "Su, Zhaochen  and\nLi, Juntao  and\nZhang, Jun  and\nZhu, Tong  and\nQu, Xiaoye  and\nZhou, Pan  and\nBowen, Yan  and\nCheng, Yu  and\nZhang, Min"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Temporal reasoning is fundamental for large language models (LLMs) to comprehend the world. Current temporal reasoning datasets are limited to questions about single or isolated events, falling short in mirroring the realistic temporal characteristics involving concurrent nature and intricate temporal interconnections. In this paper, we introduce CoTempQA, a comprehensive co-temporal Question Answering (QA) benchmark containing four co-temporal scenarios (Equal, Overlap, During, Mix) with 4,748 samples for evaluating the co-temporal comprehension and reasoning abilities of LLMs. Our extensive experiments reveal a significant gap between the performance of current LLMs and human-level reasoning on CoTempQA tasks. Even when enhanced with Chain of Thought (CoT) methodologies, models consistently struggle with our task. In our preliminary exploration, we discovered that mathematical reasoning plays a significant role in handling co-temporal events and proposed a strategy to boost LLMs’ co-temporal reasoning from a mathematical perspective. We hope that our CoTempQA datasets will encourage further advancements in improving the co-temporal reasoning capabilities of LLMs.",
  "keywords": [
    "chain",
    "question",
    "we",
    "current",
    "current llms",
    "cot",
    "qa benchmark",
    "cotempqa",
    "cot methodologies models",
    "llms",
    "abilities",
    "moment",
    "cotempqa tasks",
    "language",
    "thought"
  ],
  "url": "https://aclanthology.org/2024.acl-long.703/",
  "provenance": {
    "collected_at": "2025-06-05 10:43:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}