{
  "id": "2024.acl-long.334",
  "title": "Not All Experts are Equal: Efficient Expert Pruning and Skipping for Mixture-of-Experts Large Language Models",
  "authors": [
    "Lu, Xudong  and\nLiu, Qi  and\nXu, Yuhui  and\nZhou, Aojun  and\nHuang, Siyuan  and\nZhang, Bo  and\nYan, Junchi  and\nLi, Hongsheng"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "A pivotal advancement in the progress of large language models (LLMs) is the emergence of the Mixture-of-Experts (MoE) LLMs. Compared to traditional LLMs, MoE LLMs can achieve higher performance with fewer active parameters, but it is still hard to deploy them due to their immense parameter sizes. Different from previous weight pruning methods that rely on specifically designed hardware, this paper mainly aims to enhance the deployment efficiency of MoE LLMs by introducing plug-and-play expert-level sparsification techniques. Specifically, we propose, for the first time to our best knowledge, post-training approaches for task-agnostic and task-specific expert pruning and skipping of MoE LLMs, tailored to improve deployment efficiency while maintaining model performance across a wide range of tasks. Extensive experiments show that our proposed methods can simultaneously reduce model sizes and increase the inference speed, while maintaining satisfactory performance. Code will be made available at https://github.com/Lucky-Lance/Expert_Sparsity.",
  "keywords": [
    "code",
    "efficient",
    "efficiency",
    "we",
    "the deployment efficiency",
    "parameter",
    "training",
    "it",
    "traditional llms",
    "moe llms",
    "llms",
    "large language models llms",
    "deployment efficiency",
    "equal efficient expert",
    "knowledge"
  ],
  "url": "https://aclanthology.org/2024.acl-long.334/",
  "provenance": {
    "collected_at": "2025-06-05 10:38:53",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}