{
  "id": "2024.acl-long.856",
  "title": "Guardians of the Machine Translation Meta-Evaluation: Sentinel Metrics Fall In!",
  "authors": [
    "Perrella, Stefano  and\nProietti, Lorenzo  and\nScir{\\`e}, Alessandro  and\nBarba, Edoardo  and\nNavigli, Roberto"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Annually, at the Conference of Machine Translation (WMT), the Metrics Shared Task organizers conduct the meta-evaluation of Machine Translation (MT) metrics, ranking them according to their correlation with human judgments. Their results guide researchers toward enhancing the next generation of metrics and MT systems. With the recent introduction of neural metrics, the field has witnessed notable advancements. Nevertheless, the inherent opacity of these metrics has posed substantial challenges to the meta-evaluation process. This work highlights two issues with the meta-evaluation framework currently employed in WMT, and assesses their impact on the metrics rankings. To do this, we introduce the concept of sentinel metrics, which are designed explicitly to scrutinize the meta-evaluation process’s accuracy, robustness, and fairness. By employing sentinel metrics, we aim to validate our findings, and shed light on and monitor the potential biases or inconsistencies in the rankings. We discover that the present meta-evaluation framework favors two categories of metrics: i) those explicitly trained to mimic human quality assessments, and ii) continuous metrics. Finally, we raise concerns regarding the evaluation capabilities of state-of-the-art metrics, emphasizing that they might be basing their assessments on spurious correlations found in their training data.",
  "keywords": [
    "the evaluation capabilities",
    "field",
    "machine translation",
    "we",
    "training",
    "translation",
    "ii continuous metrics",
    "neural",
    "the field",
    "neural metrics",
    "mt metrics",
    "sentinel metrics",
    "the meta-evaluation framework",
    "the metrics",
    "these metrics"
  ],
  "url": "https://aclanthology.org/2024.acl-long.856/",
  "provenance": {
    "collected_at": "2025-06-05 10:46:05",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}