{
  "id": "2024.acl-long.61",
  "title": "Tell Me More! Towards Implicit User Intention Understanding of Language Model Driven Agents",
  "authors": [
    "Qian, Cheng  and\nHe, Bingxiang  and\nZhuang, Zhong  and\nDeng, Jia  and\nQin, Yujia  and\nCong, Xin  and\nZhang, Zhong  and\nZhou, Jie  and\nLin, Yankai  and\nLiu, Zhiyuan  and\nSun, Maosong"
  ],
  "year": "2024",
  "venue": "Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "Current language model-driven agents often lack mechanisms for effective user participation, which is crucial given the vagueness commonly found in user instructions. Although adept at devising strategies and performing tasks, these agents struggle with seeking clarification and grasping precise user intentions. To bridge this gap, we introduce Intention-in-Interaction (IN3), a novel benchmark designed to inspect users’ implicit intentions through explicit queries. Next, we propose the incorporation of model experts as the upstream in agent designs to enhance user-agent interaction. Employing IN3, we empirically train Mistral-Interact, a powerful model that proactively assesses task vagueness, inquires about user intentions, and refines them into actionable goals before starting downstream agent task execution. Integrating it into the XAgent framework, we comprehensively evaluate the enhanced agent system regarding user instruction understanding and execution, revealing that our approach notably excels at identifying vague user tasks, recovering and summarizing critical missing information, setting precise and necessary agent execution goals, and minimizing redundant tool usage, thus boosting overall efficiency.",
  "keywords": [
    "efficiency",
    "we",
    "current",
    "instruction",
    "it",
    "queries",
    "information",
    "explicit queries",
    "strategies",
    "me",
    "overall efficiency",
    "language",
    "model",
    "approach",
    "the enhanced agent system"
  ],
  "url": "https://aclanthology.org/2024.acl-long.61/",
  "provenance": {
    "collected_at": "2025-06-05 10:35:07",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}