{
  "id": "P16-5008",
  "title": "M}eta{N}et: Repository, Identification System, and Applications",
  "authors": [
    "Petruck, Miriam R L  and\nDodge, Ellen K"
  ],
  "year": "2016",
  "venue": "Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics: Tutorial Abstracts",
  "abstract": "The ubiquity of metaphor in language (Lakoff and Johnson 1980) has served as impetus for cognitive linguistic approaches to the study of language, mind, and the study of mind (e.g. Thibodeau & Boroditsky 2011). While native speakers use metaphor naturally and easily, the treatment and interpretation of metaphor in computational systems remains challenging because such systems have not succeeded in developing ways to recognize the semantic elements that define metaphor. This tutorial demonstrates MetaNet's frame-based semantic analyses, and their informing of MetaNet's automatic metaphor identification system. Participants will gain a complete understanding of the theoretical basis and the practical workings of MetaNet, and acquire relevant information about the Frame Semantics basis of that knowledge base and the way that FrameNet handles the widespread phenomenon of metaphor in language. The tutorial is geared to researchers and practitioners of language technology, not necessarily experts in metaphor analysis or knowledgeable about either FrameNet or MetaNet, but who are interested in natural language processing tasks that involve automatic metaphor processing, or could benefit from exposure to tools and resources that support frame-based deep semantic, analyses of language, including metaphor as a widespread phenomenon in human language.",
  "keywords": [
    "deep",
    "natural language processing tasks",
    "semantic",
    "natural",
    "semantics",
    "information",
    "analysis",
    "processing",
    "the semantic elements",
    "frame-based deep semantic analyses",
    "practitioners",
    "knowledge",
    "language",
    "human",
    "the frame semantics basis"
  ],
  "url": "https://aclanthology.org/P16-5008/",
  "provenance": {
    "collected_at": "2025-06-04 23:56:19",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}