{
  "id": "P16-5007",
  "title": "Understanding Short Texts",
  "authors": [
    "Wang, Zhongyuan  and\nWang, Haixun"
  ],
  "year": "2016",
  "venue": "Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics: Tutorial Abstracts",
  "abstract": "Billions of short texts are produced every day, in the form of search queries, ad keywords, tags, tweets, messenger conversations, social network posts, etc. Unlike documents, short texts have some unique characteristics which make them difficult to handle. First, short texts, especially search queries, do not always observe the syntax of a written language. This means traditional NLP techniques, such as syntactic parsing, do not always apply to short texts. Second, short texts contain limited context. The majority of search queries contain less than 5 words, and tweets can have no more than 140 characters. Because of the above reasons, short texts give rise to a significant amount of ambiguity, which makes them extremely difficult to handle. On the other hand, many applications, including search engines, ads, automatic question answering, online advertising, recommendation systems, etc., rely on short text understanding. In all these applications, the necessary first step is to transform an input text into a machine-interpretable representation, namely to \"understand\" the short text. A growing number of approaches leverage external knowledge to address the issue of inadequate contextual information that accompanies the short texts. These approaches can be classified into two categories: Explicit Representation Model (ERM) and Implicit Representation Model (IRM). In this tutorial, we will present a comprehensive overview of short text understanding based on explicit semantics (knowledge graph representation, acquisition, and reasoning) and implicit semantics (embedding and deep learning). Specifically, we will go over various techniques in knowledge acquisition, representation, and inferencing has been proposed for text understanding, and we will describe massive structured and semi-structured data that have been made available in the recent decade that directly or indirectly encode human knowledge, turning the knowledge representation problems into a computational grand challenge with feasible solutions insight.",
  "keywords": [
    "deep",
    "parsing",
    "encode",
    "conversations",
    "question",
    "overview",
    "form",
    "we",
    "search queries",
    "graph",
    "syntax",
    "traditional nlp techniques",
    "semantics",
    "queries",
    "search queries ad"
  ],
  "url": "https://aclanthology.org/P16-5007/",
  "provenance": {
    "collected_at": "2025-06-04 23:56:17",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}