{
  "id": "P17-5005",
  "title": "Beyond Words: Deep Learning for Multiword Expressions and Collocations",
  "authors": [
    "Kordoni, Valia"
  ],
  "year": "2017",
  "venue": "Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics: Tutorial Abstracts",
  "abstract": "Deep learning has recently shown much promise for NLP applications. Traditionally, in most NLP approaches, documents or sentences are represented by a sparse bag-of-words representation. There is now a lot of work which goes beyond this by adopting a distributed representation of words, by constructing a so-called ``neural embedding'' or vector space representation of each word or document. The aim of this tutorial is to go beyond the learning of word vectors and present methods for learning vector representations for Multiword Expressions and bilingual phrase pairs, all of which are useful for various NLP applications.This tutorial aims to provide attendees with a clear notion of the linguistic and distributional characteristics of Multiword Expressions (MWEs), their relevance for the intersection of deep learning and natural language processing, what methods and resources are available to support their use, and what more could be done in the future. Our target audience are researchers and practitioners in machine learning, parsing (syntactic and semantic) and language technology, not necessarily experts in MWEs, who are interested in tasks that involve or could benefit from considering MWEs as a pervasive phenomenon in human language and communication.",
  "keywords": [
    "deep",
    "audience",
    "word vectors",
    "semantic",
    "all",
    "various nlp applications",
    "bag",
    "neural",
    "natural",
    "machine learning",
    "word",
    "learning",
    "natural language",
    "nlp applications",
    "vector"
  ],
  "url": "https://aclanthology.org/P17-5005/",
  "provenance": {
    "collected_at": "2025-06-05 00:06:20",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}