{
  "id": "P18-1057",
  "title": "T}utorial{B}ank: A Manually-Collected Corpus for Prerequisite Chains, Survey Extraction and Resource Recommendation",
  "authors": [
    "Fabbri, Alexander  and\nLi, Irene  and\nTrairatvorakul, Prawat  and\nHe, Yijiao  and\nTing, Weitai  and\nTung, Robert  and\nWesterfield, Caitlin  and\nRadev, Dragomir"
  ],
  "year": "2018",
  "venue": "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)",
  "abstract": "The field of Natural Language Processing (NLP) is growing rapidly, with new research published daily along with an abundance of tutorials, codebases and other online resources. In order to learn this dynamic field or stay up-to-date on the latest research, students as well as educators and researchers must constantly sift through multiple sources to find valuable, relevant information. To address this situation, we introduce TutorialBank, a new, publicly available dataset which aims to facilitate NLP education and research. We have manually collected and categorized over 5,600 resources on NLP as well as the related fields of Artificial Intelligence (AI), Machine Learning (ML) and Information Retrieval (IR). Our dataset is notably the largest manually-picked corpus of resources intended for NLP education which does not include only academic papers. Additionally, we have created both a search engine and a command-line tool for the resources and have annotated the corpus to include lists of research topics, relevant resources for each topic, prerequisite relations among topics, relevant sub-parts of individual resources, among other annotations. We are releasing the dataset and present several avenues for further research.",
  "keywords": [
    "extraction",
    "field",
    "we",
    "fields",
    "natural language processing nlp",
    "natural",
    "the field",
    "retrieval",
    "information",
    "nlp education",
    "processing",
    "information retrieval",
    "topic",
    "-",
    "this dynamic field"
  ],
  "url": "https://aclanthology.org/P18-1057/",
  "provenance": {
    "collected_at": "2025-06-05 00:10:30",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}