{
  "id": "P19-1078",
  "title": "Transferable Multi-Domain State Generator for Task-Oriented Dialogue Systems",
  "authors": [
    "Wu, Chien-Sheng  and\nMadotto, Andrea  and\nHosseini-Asl, Ehsan  and\nXiong, Caiming  and\nSocher, Richard  and\nFung, Pascale"
  ],
  "year": "2019",
  "venue": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Over-dependence on domain ontology and lack of sharing knowledge across domains are two practical and yet less studied problems of dialogue state tracking. Existing approaches generally fall short when tracking unknown slot values during inference and often have difficulties in adapting to new domains. In this paper, we propose a Transferable Dialogue State Generator (TRADE) that generates dialogue states from utterances using copy mechanism, facilitating transfer when predicting (domain, slot, value) triplets not encountered during training. Our model is composed of an utterance encoder, a slot gate, and a state generator, which are shared across domains. Empirical results demonstrate that TRADE achieves state-of-the-art 48.62% joint goal accuracy for the five domains of MultiWOZ, a human-human dialogue dataset. In addition, we show the transferring ability by simulating zero-shot and few-shot dialogue state tracking for unseen domains. TRADE achieves 60.58% joint goal accuracy in one of the zero-shot domains, and is able to adapt to few-shot cases without forgetting already trained domains.",
  "keywords": [
    "dialogue state",
    "domain ontology",
    "few-shot cases",
    "we",
    "dialogue",
    "shot",
    "a state generator",
    "the zero-shot domains",
    "transfer",
    "difficulties",
    "studied",
    "an utterance encoder",
    "a human-human dialogue dataset",
    "accuracy",
    "dialogue states"
  ],
  "url": "https://aclanthology.org/P19-1078/",
  "provenance": {
    "collected_at": "2025-06-05 00:30:14",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}