{
  "id": "P19-1480",
  "title": "Interconnected Question Generation with Coreference Alignment and Conversation Flow Modeling",
  "authors": [
    "Gao, Yifan  and\nLi, Piji  and\nKing, Irwin  and\nLyu, Michael R."
  ],
  "year": "2019",
  "venue": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "We study the problem of generating interconnected questions in question-answering style conversations. Compared with previous works which generate questions based on a single sentence (or paragraph), this setting is different in two major aspects: (1) Questions are highly conversational. Almost half of them refer back to conversation history using coreferences. (2) In a coherent conversation, questions have smooth transitions between turns. We propose an end-to-end neural model with coreference alignment and conversation flow modeling. The coreference alignment modeling explicitly aligns coreferent mentions in conversation history with corresponding pronominal references in generated questions, which makes generated questions interconnected to conversation history. The conversation flow modeling builds a coherent conversation by starting questioning on the first few sentences in a text passage and smoothly shifting the focus to later parts. Extensive experiments show that our system outperforms several baselines and can generate highly conversational questions. The code implementation is released athttps://github.com/Evan-Gao/conversaional-QG.",
  "keywords": [
    "code",
    "end",
    "conversation history",
    "conversations",
    "question",
    "a coherent conversation",
    "we",
    "generated questions",
    "neural",
    "coreference alignment",
    "interconnected question generation",
    "question-answering style conversations",
    "conversation flow modeling",
    "the conversation flow modeling",
    "conversation flow"
  ],
  "url": "https://aclanthology.org/P19-1480/",
  "provenance": {
    "collected_at": "2025-06-05 00:42:43",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}