{
  "id": "P19-1106",
  "title": "D}eep{S}enti{P}eer: Harnessing Sentiment in Review Texts to Recommend Peer Review Decisions",
  "authors": [
    "Ghosal, Tirthankar  and\nVerma, Rajeev  and\nEkbal, Asif  and\nBhattacharyya, Pushpak"
  ],
  "year": "2019",
  "venue": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Automatically validating a research artefact is one of the frontiers in Artificial Intelligence (AI) that directly brings it close to competing with human intellect and intuition. Although criticised sometimes, the existing peer review system still stands as the benchmark of research validation. The present-day peer review process is not straightforward and demands profound domain knowledge, expertise, and intelligence of human reviewer(s), which is somewhat elusive with the current state of AI. However, the peer review texts, which contains rich sentiment information of the reviewer, reflecting his/her overall attitude towards the research in the paper, could be a valuable entity to predict the acceptance or rejection of the manuscript under consideration. Here in this work, we investigate the role of reviewer sentiment embedded within peer review texts to predict the peer review outcome. Our proposed deep neural architecture takes into account three channels of information: the paper, the corresponding reviews, and review’s polarity to predict the overall recommendation score as well as the final decision. We achieve significant performance improvement over the baselines (∼ 29% error reduction) proposed in a recently released dataset of peer reviews. An AI of this kind could assist the editors/program chairs as an additional layer of confidence, especially when non-responding/missing reviewers are frequent in present day peer review.",
  "keywords": [
    "deep",
    "validation",
    "layer",
    "the corresponding reviews",
    "peer reviews",
    "we",
    "frontiers",
    "current",
    "neural",
    "it",
    "the peer review texts",
    "information",
    "rich",
    "the frontiers",
    "reviews"
  ],
  "url": "https://aclanthology.org/P19-1106/",
  "provenance": {
    "collected_at": "2025-06-05 00:32:15",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}