{
  "id": "P19-1566",
  "title": "Persuasion for Good: Towards a Personalized Persuasive Dialogue System for Social Good",
  "authors": [
    "Wang, Xuewei  and\nShi, Weiyan  and\nKim, Richard  and\nOh, Yoojung  and\nYang, Sijia  and\nZhang, Jingwen  and\nYu, Zhou"
  ],
  "year": "2019",
  "venue": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Developing intelligent persuasive conversational agents to change people’s opinions and actions for social good is the frontier in advancing the ethical development of automated dialogue systems. To do so, the first step is to understand the intricate organization of strategic disclosures and appeals employed in human persuasion conversations. We designed an online persuasion task where one participant was asked to persuade the other to donate to a specific charity. We collected a large dataset with 1,017 dialogues and annotated emerging persuasion strategies from a subset. Based on the annotation, we built a baseline classifier with context information and sentence-level features to predict the 10 persuasion strategies used in the corpus. Furthermore, to develop an understanding of personalized persuasion processes, we analyzed the relationships between individuals’ demographic and psychological backgrounds including personality, morality, value systems, and their willingness for donation. Then, we analyzed which types of persuasion strategies led to a greater amount of donation depending on the individuals’ personal backgrounds. This work lays the ground for developing a personalized persuasive dialogue system.",
  "keywords": [
    "emerging persuasion strategies",
    "classifier",
    "conversations",
    "1 017 dialogues",
    "a baseline classifier",
    "we",
    "dialogue",
    "backgrounds",
    "information",
    "frontier",
    "human persuasion conversations",
    "automated dialogue systems",
    "demographic and psychological backgrounds",
    "strategies",
    "persuasion strategies"
  ],
  "url": "https://aclanthology.org/P19-1566/",
  "provenance": {
    "collected_at": "2025-06-05 00:45:09",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}