{
  "id": "P19-1443",
  "title": "SP}ar{C}: Cross-Domain Semantic Parsing in Context",
  "authors": [
    "Yu, Tao  and\nZhang, Rui  and\nYasunaga, Michihiro  and\nTan, Yi Chern  and\nLin, Xi Victoria  and\nLi, Suyi  and\nEr, Heyang  and\nLi, Irene  and\nPang, Bo  and\nChen, Tao  and\nJi, Emily  and\nDixit, Shreya  and\nProctor, David  and\nShim, Sungrok  and\nKraft, Jonathan  and\nZhang, Vincent  and\nXiong, Caiming  and\nSocher, Richard  and\nRadev, Dragomir"
  ],
  "year": "2019",
  "venue": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "We present SParC, a dataset for cross-domainSemanticParsing inContext that consists of 4,298 coherent question sequences (12k+ individual questions annotated with SQL queries). It is obtained from controlled user interactions with 200 complex databases over 138 domains. We provide an in-depth analysis of SParC and show that it introduces new challenges compared to existing datasets. SParC demonstrates complex contextual dependencies, (2) has greater semantic diversity, and (3) requires generalization to unseen domains due to its cross-domain nature and the unseen databases at test time. We experiment with two state-of-the-art text-to-SQL models adapted to the context-dependent, cross-domain setup. The best model obtains an exact match accuracy of 20.2% over all questions and less than10% over all interaction sequences, indicating that the cross-domain setting and the con-textual phenomena of the dataset present significant challenges for future research. The dataset, baselines, and leaderboard are released athttps://yale-lily.github.io/sparc.",
  "keywords": [
    "parsing",
    "question",
    "complex contextual dependencies",
    "semantic",
    "we",
    "an exact match accuracy",
    "cross",
    "cross-domainsemanticparsing incontext",
    "it",
    "queries",
    "c",
    "dependencies",
    "analysis",
    "domainsemanticparsing",
    "con"
  ],
  "url": "https://aclanthology.org/P19-1443/",
  "provenance": {
    "collected_at": "2025-06-05 00:41:40",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}