{
  "id": "P19-3005",
  "title": "J}iuge: A Human-Machine Collaborative {C}hinese Classical Poetry Generation System",
  "authors": [
    "Zhipeng, Guo  and\nYi, Xiaoyuan  and\nSun, Maosong  and\nLi, Wenhao  and\nYang, Cheng  and\nLiang, Jiannan  and\nChen, Huimin  and\nZhang, Yuhui  and\nLi, Ruoyu"
  ],
  "year": "2019",
  "venue": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: System Demonstrations",
  "abstract": "Research on the automatic generation of poetry, the treasure of human culture, has lasted for decades. Most existing systems, however, are merely model-oriented, which input some user-specified keywords and directly complete the generation process in one pass, with little user participation. We believe that the machine, being a collaborator or an assistant, should not replace human beings in poetic creation. Therefore, we proposed Jiuge, a human-machine collaborative Chinese classical poetry generation system. Unlike previous systems, Jiuge allows users to revise the unsatisfied parts of a generated poem draft repeatedly. According to the revision, the poem will be dynamically updated and regenerated. After the revision and modification procedure, the user can write a satisfying poem together with Jiuge system collaboratively. Besides, Jiuge can accept multi-modal inputs, such as keywords, plain text or images. By exposing the options of poetry genres, styles and revision modes, Jiuge, acting as a professional assistant, allows constant and active participation of users in poetic creation.",
  "keywords": [
    "we",
    "unsatisfied",
    "the automatic generation",
    "a generated poem draft",
    "text",
    "some user-specified keywords",
    "process",
    "generation",
    "the generation process",
    "model",
    "machine",
    "human",
    "the unsatisfied parts",
    "multi",
    "assistant"
  ],
  "url": "https://aclanthology.org/P19-3005/",
  "provenance": {
    "collected_at": "2025-06-05 00:49:41",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}