{
  "id": "P19-4009",
  "title": "Storytelling from Structured Data and Knowledge Graphs : An {NLG} Perspective",
  "authors": [
    "Mishra, Abhijit  and\nLaha, Anirban  and\nSankaranarayanan, Karthik  and\nJain, Parag  and\nKrishnan, Saravanan"
  ],
  "year": "2019",
  "venue": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Tutorial Abstracts",
  "abstract": "In this tutorial, we wish to cover the foundational, methodological, and system development aspects of translating structured data (such as data in tabular form) and knowledge bases (such as knowledge graphs) into natural language. The attendees of the tutorial will be able to take away from this tutorial, (1) the basic ideas around how modern NLP and NLG techniques could be applied to describe and summarize textual data in format that is non-linguistic in nature or has some structure, and (2) a few interesting open-ended questions, which could lead to significant research contributions in future. The tutorial aims to convey challenges and nuances in structured data translation, data representation techniques, and domain adaptable solutions for translation of the data into natural language form. Various solutions, starting from traditional rule based/heuristic driven and modern data-driven and ultra-modern deep-neural style architectures will be discussed, followed by a brief discussion on evaluation and quality estimation. A significant portion of the tutorial will be dedicated towards unsupervised, scalable, and adaptable solutions, given that systems for such an important task will never naturally enjoy sustainable large scale domain independent labeled (parallel) data.",
  "keywords": [
    "deep",
    "form",
    "we",
    "translation",
    "a brief discussion",
    "neural",
    "natural",
    "knowledge graphs",
    "format",
    "evaluation and quality estimation",
    "natural language",
    "knowledge",
    "language",
    "nlp",
    "brief"
  ],
  "url": "https://aclanthology.org/P19-4009/",
  "provenance": {
    "collected_at": "2025-06-05 00:50:48",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}