{
  "id": "P19-3027",
  "title": "T}exar: A Modularized, Versatile, and Extensible Toolkit for Text Generation",
  "authors": [
    "Hu, Zhiting  and\nShi, Haoran  and\nTan, Bowen  and\nWang, Wentao  and\nYang, Zichao  and\nZhao, Tiancheng  and\nHe, Junxian  and\nQin, Lianhui  and\nWang, Di  and\nMa, Xuezhe  and\nLiu, Zhengzhong  and\nLiang, Xiaodan  and\nZhu, Wanrong  and\nSachan, Devendra  and\nXing, Eric"
  ],
  "year": "2019",
  "venue": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: System Demonstrations",
  "abstract": "We introduce Texar, an open-source toolkit aiming to support the broad set of text generation tasks that transform any inputs into natural language, such as machine translation, summarization, dialog, content manipulation, and so forth. With the design goals of modularity, versatility, and extensibility in mind, Texar extracts common patterns underlying the diverse tasks and methodologies, creates a library of highly reusable modules and functionalities, and allows arbitrary model architectures and algorithmic paradigms. In Texar, model architecture, inference, and learning processes are properly decomposed. Modules at a high concept level can be freely assembled or plugged in/swapped out. Texar is thus particularly suitable for researchers and practitioners to do fast prototyping and experimentation. The versatile toolkit also fosters technique sharing across different text generation tasks. Texar supports both TensorFlow and PyTorch, and is released under Apache License 2.0 athttps://www.texar.io.",
  "keywords": [
    "t",
    "functionalities",
    "summarization",
    "we",
    "text generation tasks",
    "text generation",
    "translation",
    "natural",
    "learning",
    "natural language",
    "text",
    "practitioners",
    "fast",
    "generation",
    "language"
  ],
  "url": "https://aclanthology.org/P19-3027/",
  "provenance": {
    "collected_at": "2025-06-05 00:50:18",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}