{
  "id": "P19-1539",
  "title": "Conversing by Reading: Contentful Neural Conversation with On-demand Machine Reading",
  "authors": [
    "Qin, Lianhui  and\nGalley, Michel  and\nBrockett, Chris  and\nLiu, Xiaodong  and\nGao, Xiang  and\nDolan, Bill  and\nChoi, Yejin  and\nGao, Jianfeng"
  ],
  "year": "2019",
  "venue": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Although neural conversational models are effective in learning how to produce fluent responses, their primary challenge lies in knowing what to say to make the conversation contentful and non-vacuous. We present a new end-to-end approach to contentful neural conversation that jointly models response generation and on-demand machine reading. The key idea is to provide the conversation model with relevant long-form text on the fly as a source of external knowledge. The model performs QA-style reading comprehension on this text in response to each conversational turn, thereby allowing for more focused integration of external knowledge than has been possible in prior approaches. To support further research on knowledge-grounded conversation, we introduce a new large-scale conversation dataset grounded in external web pages (2.8M turns, 7.4M sentences of grounding). Both human evaluation and automated metrics show that our approach results in more contentful responses compared to a variety of previous methods, improving both the informativeness and diversity of generated output.",
  "keywords": [
    "variety",
    "end",
    "form",
    "we",
    "contentful neural conversation",
    "qa-style reading comprehension",
    "knowledge-grounded conversation",
    "neural",
    "both human evaluation",
    "each conversational turn",
    "the conversation",
    "a variety",
    "automated metrics",
    "generated output",
    "neural conversational models"
  ],
  "url": "https://aclanthology.org/P19-1539/",
  "provenance": {
    "collected_at": "2025-06-05 00:44:24",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}