{
  "id": "P19-1330",
  "title": "H}igh{RES}: Highlight-based Reference-less Evaluation of Summarization",
  "authors": [
    "Hardy, Hardy  and\nNarayan, Shashi  and\nVlachos, Andreas"
  ],
  "year": "2019",
  "venue": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "There has been substantial progress in summarization research enabled by the availability of novel, often large-scale, datasets and recent advances on neural network-based approaches. However, manual evaluation of the system generated summaries is inconsistent due to the difficulty the task poses to human non-expert readers. To address this issue, we propose a novel approach for manual evaluation, Highlight-based Reference-less Evaluation of Summarization (HighRES), in which summaries are assessed by multiple annotators against the source document via manually highlighted salient content in the latter. Thus summary assessment on the source document by human judges is facilitated, while the highlights can be used for evaluating multiple systems. To validate our approach we employ crowd-workers to augment with highlights a recently proposed dataset and compare two state-of-the-art systems. We demonstrate that HighRES improves inter-annotator agreement in comparison to using the source document directly, while they help emphasize differences among systems that would be ignored under other evaluation approaches.",
  "keywords": [
    "neural network-based approaches",
    "summarization",
    "we",
    "manually highlighted salient content",
    "summarization highres",
    "neural",
    "other evaluation approaches",
    "reference",
    "summaries",
    "human",
    "highlight-based reference-less evaluation",
    "salient",
    "manual evaluation",
    "summarization research",
    "network"
  ],
  "url": "https://aclanthology.org/P19-1330/",
  "provenance": {
    "collected_at": "2025-06-05 00:38:31",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}