{
  "id": "P19-1490",
  "title": "Multilingual and Cross-Lingual Graded Lexical Entailment",
  "authors": [
    "Vuli{\\'c}, Ivan  and\nPonzetto, Simone Paolo  and\nGlava{\\v{s}}, Goran"
  ],
  "year": "2019",
  "venue": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Grounded in cognitive linguistics, graded lexical entailment (GR-LE) is concerned with fine-grained assertions regarding the directional hierarchical relationships between concepts on a continuous scale. In this paper, we present the first work on cross-lingual generalisation of GR-LE relation. Starting from HyperLex, the only available GR-LE dataset in English, we construct new monolingual GR-LE datasets for three other languages, and combine those to create a set of six cross-lingual GR-LE datasets termed CL-HYPERLEX. We next present a novel method dubbed CLEAR (Cross-Lingual Lexical Entailment Attract-Repel) for effectively capturing graded (and binary) LE, both monolingually in different languages as well as across languages (i.e., on CL-HYPERLEX). Coupled with a bilingual dictionary, CLEAR leverages taxonomic LE knowledge in a resource-rich language (e.g., English) and propagates it to other languages. Supported by cross-lingual LE transfer, CLEAR sets competitive baseline performance on three new monolingual GR-LE datasets and six cross-lingual GR-LE datasets. In addition, we show that CLEAR outperforms current state-of-the-art on binary cross-lingual LE detection by a wide margin for diverse language pairs.",
  "keywords": [
    "the directional hierarchical relationships",
    "we",
    "current",
    "cross",
    "it",
    "generalisation",
    "rich",
    "cross-lingual generalisation",
    "i",
    "work",
    "hierarchical",
    "knowledge",
    "language",
    "new monolingual gr-le datasets",
    "state"
  ],
  "url": "https://aclanthology.org/P19-1490/",
  "provenance": {
    "collected_at": "2025-06-05 00:43:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}