{
  "id": "P19-1182",
  "title": "Expressing Visual Relationships via Language",
  "authors": [
    "Tan, Hao  and\nDernoncourt, Franck  and\nLin, Zhe  and\nBui, Trung  and\nBansal, Mohit"
  ],
  "year": "2019",
  "venue": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "Describing images with text is a fundamental problem in vision-language research. Current studies in this domain mostly focus on single image captioning. However, in various real applications (e.g., image editing, difference interpretation, and retrieval), generating relational captions for two images, can also be very useful. This important problem has not been explored mostly due to lack of datasets and effective models. To push forward the research in this direction, we first introduce a new language-guided image editing dataset that contains a large number of real image pairs with corresponding editing instructions. We then propose a new relational speaker model based on an encoder-decoder architecture with static relational attention and sequential multi-head attention. We also extend the model with dynamic relational attention, which calculates visual alignment while decoding. Our models are evaluated on our newly collected and two public datasets consisting of image pairs annotated with relationship sentences. Experimental results, based on both automatic and human evaluation, demonstrate that our model outperforms all baselines and existing methods on all the datasets.",
  "keywords": [
    "visual alignment",
    "we",
    "current",
    "retrieval generating relational captions",
    "decoder",
    "retrieval",
    "visual",
    "an encoder-decoder architecture",
    "text",
    "sequential multi-head attention",
    "dynamic relational attention",
    "alignment",
    "vision-language research current studies",
    "generating",
    "language"
  ],
  "url": "https://aclanthology.org/P19-1182/",
  "provenance": {
    "collected_at": "2025-06-05 00:34:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}