{
  "id": "P19-1651",
  "title": "C}o{D}raw: Collaborative Drawing as a Testbed for Grounded Goal-driven Communication",
  "authors": [
    "Kim, Jin-Hwa  and\nKitaev, Nikita  and\nChen, Xinlei  and\nRohrbach, Marcus  and\nZhang, Byoung-Tak  and\nTian, Yuandong  and\nBatra, Dhruv  and\nParikh, Devi"
  ],
  "year": "2019",
  "venue": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics",
  "abstract": "In this work, we propose a goal-driven collaborative task that combines language, perception, and action. Specifically, we develop a Collaborative image-Drawing game between two agents, called CoDraw. Our game is grounded in a virtual world that contains movable clip art objects. The game involves two players: a Teller and a Drawer. The Teller sees an abstract scene containing multiple clip art pieces in a semantically meaningful configuration, while the Drawer tries to reconstruct the scene on an empty canvas using available clip art pieces. The two players communicate with each other using natural language. We collect the CoDraw dataset of ~10K dialogs consisting of ~138K messages exchanged between human players. We define protocols and metrics to evaluate learned agents in this testbed, highlighting the need for a novel “crosstalk” evaluation condition which pairs agents trained independently on disjoint subsets of the training data. We present models for our task and benchmark them using both fully automated evaluation and by having them play the game live with humans.",
  "keywords": [
    "a semantically meaningful configuration",
    "multiple clip art pieces",
    "we",
    "training",
    "natural",
    "pieces",
    "both fully automated evaluation",
    "natural language",
    "metrics",
    "action",
    "work",
    "language",
    "human",
    "available clip art pieces",
    "evaluation"
  ],
  "url": "https://aclanthology.org/P19-1651/",
  "provenance": {
    "collected_at": "2025-06-05 00:47:31",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}