{
  "id": "W18-3004",
  "title": "Chat Discrimination for Intelligent Conversational Agents with a Hybrid {CNN}-{LMTGRU} Network",
  "authors": [
    "Moirangthem, Dennis Singh  and\nLee, Minho"
  ],
  "year": "2018",
  "venue": "Proceedings of the Third Workshop on Representation Learning for {NLP}",
  "abstract": "Recently, intelligent dialog systems and smart assistants have attracted the attention of many, and development of novel dialogue agents have become a research challenge. Intelligent agents that can handle both domain-specific task-oriented and open-domain chit-chat dialogs are one of the major requirements in the current systems. In order to address this issue and to realize such smart hybrid dialogue systems, we develop a model to discriminate user utterance between task-oriented and chit-chat conversations. We introduce a hybrid of convolutional neural network (CNN) and a lateral multiple timescale gated recurrent units (LMTGRU) that can represent multiple temporal scale dependencies for the discrimination task. With the help of the combined slow and fast units of the LMTGRU, our model effectively determines whether a user will have a chit-chat conversation or a task-specific conversation with the system. We also show that the LMTGRU structure helps the model to perform well on longer text inputs. We address the lack of dataset by constructing a dataset using Twitter and Maluuba Frames data. The results of the experiments demonstrate that the proposed hybrid network outperforms the conventional models on the chat discrimination task as well as performed comparable to the baselines on various benchmark datasets.",
  "keywords": [
    "multiple temporal scale dependencies",
    "a task-specific conversation",
    "conversations",
    "the lmtgru structure",
    "we",
    "dialogue",
    "convolutional",
    "current",
    "neural",
    "cnn",
    "dependencies",
    "recurrent",
    "novel dialogue agents",
    "the lmtgru",
    "intelligent conversational agents"
  ],
  "url": "https://aclanthology.org/W18-3004/",
  "provenance": {
    "collected_at": "2025-06-05 00:24:42",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}