{
  "id": "W18-3301",
  "title": "Getting the subtext without the text: Scalable multimodal sentiment classification from visual and acoustic modalities",
  "authors": [
    "Blanchard, Nathaniel  and\nMoreira, Daniel  and\nBharati, Aparna  and\nScheirer, Walter"
  ],
  "year": "2018",
  "venue": "Proceedings of Grand Challenge and Workshop on Human Multimodal Language (Challenge-{HML})",
  "abstract": "In the last decade, video blogs (vlogs) have become an extremely popular method through which people express sentiment. The ubiquitousness of these videos has increased the importance of multimodal fusion models, which incorporate video and audio features with traditional text features for automatic sentiment detection. Multimodal fusion offers a unique opportunity to build models that learn from the full depth of expression available to human viewers. In the detection of sentiment in these videos, acoustic and video features provide clarity to otherwise ambiguous transcripts. In this paper, we present a multimodal fusion model that exclusively uses high-level video and audio features to analyze spoken sentences for sentiment. We discard traditional transcription features in order to minimize human intervention and to maximize the deployability of our model on at-scale real-world data. We select high-level features for our model that have been successful in non-affect domains in order to test their generalizability in the sentiment detection domain. We train and test our model on the newly released CMU Multimodal Opinion Sentiment and Emotion Intensity (CMU-MOSEI) dataset, obtaining an F1 score of 0.8049 on the validation set and an F1 score of 0.6325 on the held-out challenge test set.",
  "keywords": [
    "validation",
    "we",
    "generalizability",
    "visual and acoustic modalities",
    "fusion",
    "classification",
    "visual",
    "viewers",
    "human viewers",
    "their generalizability",
    "text",
    "sentiment",
    "an f1 score",
    "model",
    "human"
  ],
  "url": "https://aclanthology.org/W18-3301/",
  "provenance": {
    "collected_at": "2025-06-05 00:08:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}