{
  "id": "W18-3711",
  "title": "The Importance of Recommender and Feedback Features in a Pronunciation Learning Aid",
  "authors": [
    "Fudholi, Dzikri  and\nSuominen, Hanna"
  ],
  "year": "2018",
  "venue": "Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications",
  "abstract": "Verbal communication — and pronunciation as its part — is a core skill that can be developed through guided learning. An artificial intelligence system can take a role in these guided learning approaches as an enabler of an application for pronunciation learning with a recommender system to guide language learners through exercises and feedback system to correct their pronunciation. In this paper, we report on a user study on language learners’ perceived usefulness of the application. 16 international students who spoke non-native English and lived in Australia participated. 13 of them said they need to improve their pronunciation skills in English because of their foreign accent. The feedback system with features for pronunciation scoring, speech replay, and giving a pronunciation example was deemed essential by most of the respondents. In contrast, a clear dichotomy between the recommender system perceived as useful or useless existed; the system had features to prompt new common words or old poorly-scored words. These results can be used to target research and development from information retrieval and reinforcement learning for better and better recommendations to speech recognition and speech analytics for accent acquisition.",
  "keywords": [
    "feedback",
    "we",
    "language learners",
    "retrieval",
    "information",
    "learning",
    "core",
    "information retrieval",
    "reinforcement",
    "language",
    "learners",
    "reinforcement learning",
    "speech recognition",
    "an enabler",
    "a pronunciation example"
  ],
  "url": "https://aclanthology.org/W18-3711/",
  "provenance": {
    "collected_at": "2025-06-05 00:24:00",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}