{
  "id": "W18-3708",
  "title": "A Hybrid System for {C}hinese Grammatical Error Diagnosis and Correction",
  "authors": [
    "Li, Chen  and\nZhou, Junpei  and\nBao, Zuyi  and\nLiu, Hengyou  and\nXu, Guangwei  and\nLi, Linlin"
  ],
  "year": "2018",
  "venue": "Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications",
  "abstract": "This paper introduces the DM_NLP team’s system for NLPTEA 2018 shared task of Chinese Grammatical Error Diagnosis (CGED), which can be used to detect and correct grammatical errors in texts written by Chinese as a Foreign Language (CFL) learners. This task aims at not only detecting four types of grammatical errors including redundant words (R), missing words (M), bad word selection (S) and disordered words (W), but also recommending corrections for errors of M and S types. We proposed a hybrid system including four models for this task with two stages: the detection stage and the correction stage. In the detection stage, we first used a BiLSTM-CRF model to tag potential errors by sequence labeling, along with some handcraft features. Then we designed three Grammatical Error Correction (GEC) models to generate corrections, which could help to tune the detection result. In the correction stage, candidates were generated by the three GEC models and then merged to output the final corrections for M and S types. Our system reached the highest precision in the correction subtask, which was the most challenging part of this shared task, and got top 3 on F1 scores for position detection of errors.",
  "keywords": [
    "language",
    "precision",
    "learners",
    "a bilstm-crf model",
    "model",
    "nlptea 2018 shared task",
    "bilstm",
    "f1 scores",
    "nlptea",
    "the highest precision",
    "word",
    "we",
    "sequence",
    "dm_nlp",
    "hinese"
  ],
  "url": "https://aclanthology.org/W18-3708/",
  "provenance": {
    "collected_at": "2025-06-05 00:23:55",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}