{
  "id": "W18-2711",
  "title": "Multi-Source Neural Machine Translation with Missing Data",
  "authors": [
    "Nishimura, Yuta  and\nSudoh, Katsuhito  and\nNeubig, Graham  and\nNakamura, Satoshi"
  ],
  "year": "2018",
  "venue": "Proceedings of the 2nd Workshop on Neural Machine Translation and Generation",
  "abstract": "Multi-source translation is an approach to exploit multiple inputs (e.g. in two different languages) to increase translation accuracy. In this paper, we examine approaches for multi-source neural machine translation (NMT) using an incomplete multilingual corpus in which some translations are missing. In practice, many multilingual corpora are not complete due to the difficulty to provide translations in all of the relevant languages (for example, in TED talks, most English talks only have subtitles for a small portion of the languages that TED supports). Existing studies on multi-source translation did not explicitly handle such situations. This study focuses on the use of incomplete multilingual corpora in multi-encoder NMT and mixture of NMT experts and examines a very simple implementation where missing source translations are replaced by a special symbol <NULL>. These methods allow us to use incomplete corpora both at training time and test time. In experiments with real incomplete multilingual corpora of TED Talks, the multi-source NMT with the <NULL> tokens achieved higher translation accuracies measured by BLEU than those by any one-to-one NMT systems.",
  "keywords": [
    "bleu",
    "all",
    "we",
    "training",
    "translation",
    "neural",
    "existing studies",
    "translation accuracy",
    "higher translation accuracies",
    "multi-encoder nmt",
    "some translations",
    "translations",
    "accuracy",
    "missing data multi-source translation",
    "multi-source translation"
  ],
  "url": "https://aclanthology.org/W18-2711/",
  "provenance": {
    "collected_at": "2025-06-05 00:23:12",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}