{
  "id": "W18-2807",
  "title": "Rating Distributions and {B}ayesian Inference: Enhancing Cognitive Models of Spatial Language Use",
  "authors": [
    "Kluth, Thomas  and\nSchultheis, Holger"
  ],
  "year": "2018",
  "venue": "Proceedings of the Eight Workshop on Cognitive Aspects of Computational Language Learning and Processing",
  "abstract": "We present two methods that improve the assessment of cognitive models. The first method is applicable to models computing average acceptability ratings. For these models, we propose an extension that simulates a full rating distribution (instead of average ratings) and allows generating individual ratings. Our second method enables Bayesian inference for models generating individual data. To this end, we propose to use the cross-match test (Rosenbaum, 2005) as a likelihood function. We exemplarily present both methods using cognitive models from the domain of spatial language use. For spatial language use, determining linguistic acceptability judgments of a spatial preposition for a depicted spatial relation is assumed to be a crucial process (Logan and Sadler, 1996). Existing models of this process compute an average acceptability rating. We extend the models and – based on existing data – show that the extended models allow extracting more information from the empirical data and yield more readily interpretable information about model successes and failures. Applying Bayesian inference, we find that model performance relies less on mechanisms of capturing geometrical aspects than on mapping the captured geometry to a rating interval.",
  "keywords": [
    "end",
    "we",
    "cross",
    "information",
    "function",
    "process",
    "language",
    "model",
    "a depicted spatial relation",
    "existing models",
    "assessment",
    "test",
    "models",
    "linguistic",
    "average"
  ],
  "url": "https://aclanthology.org/W18-2807/",
  "provenance": {
    "collected_at": "2025-06-05 00:22:20",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}