{
  "id": "W18-3204",
  "title": "Code-Mixed Question Answering Challenge: Crowd-sourcing Data and Techniques",
  "authors": [
    "Chandu, Khyathi  and\nLoginova, Ekaterina  and\nGupta, Vishal  and\nvan Genabith, Josef  and\nNeumann, G{\\\"u}nter  and\nChinnakotla, Manoj  and\nNyberg, Eric  and\nBlack, Alan W."
  ],
  "year": "2018",
  "venue": "Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching",
  "abstract": "Code-Mixing (CM) is the phenomenon of alternating between two or more languages which is prevalent in bi- and multi-lingual communities. Most NLP applications today are still designed with the assumption of a single interaction language and are most likely to break given a CM utterance with multiple languages mixed at a morphological, phrase or sentence level. For example, popular commercial search engines do not yet fully understand the intents expressed in CM queries. As a first step towards fostering research which supports CM in NLP applications, we systematically crowd-sourced and curated an evaluation dataset for factoid question answering in three CM languages - Hinglish (Hindi+English), Tenglish (Telugu+English) and Tamlish (Tamil+English) which belong to two language families (Indo-Aryan and Dravidian). We share the details of our data collection process, techniques which were used to avoid inducing lexical bias amongst the crowd workers and other CM specific linguistic properties of the dataset. Our final dataset, which is available freely for research purposes, has 1,694 Hinglish, 2,848 Tamlish and 1,391 Tenglish factoid questions and their answers. We discuss the techniques used by the participants for the first edition of this ongoing challenge.",
  "keywords": [
    "code",
    "families",
    "bias",
    "communities",
    "most nlp applications",
    "question",
    "we",
    "lexical bias",
    "queries",
    "properties",
    "multi-lingual communities",
    "nlp applications",
    "two language families",
    "cm queries",
    "process"
  ],
  "url": "https://aclanthology.org/W18-3204/",
  "provenance": {
    "collected_at": "2025-06-05 00:07:27",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}