{
  "id": "W18-3409",
  "title": "Semi-Supervised Learning with Auxiliary Evaluation Component for Large Scale e-Commerce Text Classification",
  "authors": [
    "Liu, Mingkuan  and\nWen, Musen  and\nKopru, Selcuk  and\nLiu, Xianjing  and\nLu, Alan"
  ],
  "year": "2018",
  "venue": "Proceedings of the Workshop on Deep Learning Approaches for Low-Resource {NLP}",
  "abstract": "The lack of high-quality labeled training data has been one of the critical challenges facing many industrial machine learning tasks. To tackle this challenge, in this paper, we propose a semi-supervised learning method to utilize unlabeled data and user feedback signals to improve the performance of ML models. The method employs a primary model Main and an auxiliary evaluation model Eval, where Main and Eval models are trained iteratively by automatically generating labeled data from unlabeled data and/or users’ feedback signals. The proposed approach is applied to different text classification tasks. We report results on both the publicly available Yahoo! Answers dataset and our e-commerce product classification dataset. The experimental results show that the proposed method reduces the classification error rate by 4% and up to 15% across various experimental setups and datasets. A detailed comparison with other semi-supervised learning approaches is also presented later in the paper. The results from various text classification tasks demonstrate that our method outperforms those developed in previous related studies.",
  "keywords": [
    "feedback",
    "rate",
    "the classification error rate",
    "we",
    "previous related studies",
    "training",
    "classification",
    "different text classification tasks",
    "learning",
    "various text classification tasks",
    "text",
    "our e-commerce product classification",
    "eval",
    "auxiliary evaluation component",
    "model"
  ],
  "url": "https://aclanthology.org/W18-3409/",
  "provenance": {
    "collected_at": "2025-06-05 00:08:32",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}