{
  "id": "W18-2607",
  "title": "A Systematic Classification of Knowledge, Reasoning, and Context within the {ARC} Dataset",
  "authors": [
    "Boratko, Michael  and\nPadigela, Harshit  and\nMikkilineni, Divyendra  and\nYuvraj, Pritish  and\nDas, Rajarshi  and\nMcCallum, Andrew  and\nChang, Maria  and\nFokoue-Nkoutche, Achille  and\nKapanipathi, Pavan  and\nMattei, Nicholas  and\nMusa, Ryan  and\nTalamadupula, Kartik  and\nWitbrock, Michael"
  ],
  "year": "2018",
  "venue": "Proceedings of the Workshop on Machine Reading for Question Answering",
  "abstract": "The recent work of Clark et al. (2018) introduces the AI2 Reasoning Challenge (ARC) and the associated ARC dataset that partitions open domain, complex science questions into easy and challenge sets. That paper includes an analysis of 100 questions with respect to the types of knowledge and reasoning required to answer them; however, it does not include clear definitions of these types, nor does it offer information about the quality of the labels. We propose a comprehensive set of definitions of knowledge and reasoning types necessary for answering the questions in the ARC dataset. Using ten annotators and a sophisticated annotation interface, we analyze the distribution of labels across the challenge set and statistics related to them. Additionally, we demonstrate that although naive information retrieval methods return sentences that are irrelevant to answering the query, sufficient supporting text is often present in the (ARC) corpus. Evaluating with human-selected relevant sentences improves the performance of a neural machine comprehension model by 42 points.",
  "keywords": [
    "a systematic classification",
    "we",
    "classification",
    "neural",
    "it",
    "naive information retrieval methods",
    "retrieval",
    "information",
    "science",
    "sufficient",
    "analysis",
    "text",
    "arc",
    "work",
    "knowledge"
  ],
  "url": "https://aclanthology.org/W18-2607/",
  "provenance": {
    "collected_at": "2025-06-05 00:06:38",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}