{
  "id": "W18-2303",
  "title": "Identifying Risk Factors For Heart Disease in Electronic Medical Records: A Deep Learning Approach",
  "authors": [
    "Chokwijitkul, Thanat  and\nNguyen, Anthony  and\nHassanzadeh, Hamed  and\nPerez, Siegfried"
  ],
  "year": "2018",
  "venue": "Proceedings of the {B}io{NLP} 2018 workshop",
  "abstract": "Automatic identification of heart disease risk factors in clinical narratives can expedite disease progression modelling and support clinical decisions. Existing practical solutions for cardiovascular risk detection are mostly hybrid systems entailing the integration of knowledge-driven and data-driven methods, relying on dictionaries, rules and machine learning methods that require a substantial amount of human effort. This paper proposes a comparative analysis on the applicability of deep learning, a re-emerged data-driven technique, in the context of clinical text classification. Various deep learning architectures were devised and evaluated for extracting heart disease risk factors from clinical documents. The data provided for the 2014 i2b2/UTHealth shared task focusing on identifying risk factors for heart disease was used for system development and evaluation. Results have shown that a relatively simple deep learning model can achieve a high micro-averaged F-measure of 0.9081, which is comparable to the best systems from the shared task. This is highly encouraging given the simplicity of the deep learning approach compared to the heavily feature-engineered hybrid approaches that were required to achieve state-of-the-art performances.",
  "keywords": [
    "deep",
    "classification",
    "clinical text classification",
    "learning",
    "analysis",
    "text",
    "machine learning methods",
    "dictionaries rules",
    "knowledge",
    "dictionaries",
    "evaluation results",
    "model",
    "machine",
    "various deep learning architectures",
    "human"
  ],
  "url": "https://aclanthology.org/W18-2303/",
  "provenance": {
    "collected_at": "2025-06-05 00:21:29",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}