{
  "id": "W19-4402",
  "title": "Predicting the Difficulty of Multiple Choice Questions in a High-stakes Medical Exam",
  "authors": [
    "Ha, Le An  and\nYaneva, Victoria  and\nBaldwin, Peter  and\nMee, Janet"
  ],
  "year": "2019",
  "venue": "Proceedings of the Fourteenth Workshop on Innovative Use of NLP for Building Educational Applications",
  "abstract": "Predicting the construct-relevant difficulty of Multiple-Choice Questions (MCQs) has the potential to reduce cost while maintaining the quality of high-stakes exams. In this paper, we propose a method for estimating the difficulty of MCQs from a high-stakes medical exam, where all questions were deliberately written to a common reading level. To accomplish this, we extract a large number of linguistic features and embedding types, as well as features quantifying the difficulty of the items for an automatic question-answering system. The results show that the proposed approach outperforms various baselines with a statistically significant difference. Best results were achieved when using the full feature set, where embeddings had the highest predictive power, followed by linguistic features. An ablation study of the various types of linguistic features suggested that information from all levels of linguistic processing contributes to predicting item difficulty, with features related to semantic ambiguity and the psycholinguistic properties of words having a slightly higher importance. Owing to its generic nature, the presented approach has the potential to generalize over other exams containing MCQs.",
  "keywords": [
    "question",
    "semantic",
    "we",
    "its generic nature",
    "properties",
    "information",
    "semantic ambiguity",
    "processing",
    "generic",
    "embeddings",
    "embedding types",
    "the psycholinguistic properties",
    "a large number",
    "best results",
    "the quality"
  ],
  "url": "https://aclanthology.org/W19-4402/",
  "provenance": {
    "collected_at": "2025-06-05 00:52:10",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}