{
  "id": "W19-5101",
  "title": "When the whole is greater than the sum of its parts: Multiword expressions and idiomaticity",
  "authors": [
    "Villavicencio, Aline"
  ],
  "year": "2019",
  "venue": "Proceedings of the Joint Workshop on Multiword Expressions and WordNet (MWE-WN 2019)",
  "abstract": "Multiword expressions (MWEs) feature prominently in the mental lexicon of native speakers (Jackendoff, 1997) in all languages and domains, from informal to technical contexts (Biber et al., 1999) with about four MWEs being produced per minute of discourse (Glucksberg, 1989). MWEs come in all shapes and forms, including idioms like rock the boat (as cause problems or disturb a situation) and compound nouns like monkey business (as dishonest behaviour). Their accurate detection and understanding may often require more than knowledge about individual words and how they can be combined (Fillmore, 1979), as they may display various degrees of idiosyncrasy, including lexical, syntactic, semantic and statistical (Sag et al., 2002; Baldwin and Kim, 2010), which provide new challenges and opportunities for language processing (Constant et al., 2017). For instance, while for some combinations the meaning can be inferred from their parts like olive oil (oil made of olives) this is not always the case, as in dark horse (meaning an unknown candidate who unexpectedly succeeds), and when processing a sentence some of the challenges are to identify which words form an expression (Ramisch, 2015), and whether the expression is idiomatic (Cordeiro et al., 2019). In this talk I will give an overview of advances on the identification and treatment of multiword expressions, in particular concentrating on techniques for identifying their degree of idiomaticity.",
  "keywords": [
    "opportunities",
    "overview",
    "semantic",
    "an overview",
    "processing",
    "i",
    "sum",
    "knowledge",
    "language",
    "minute",
    "idioms",
    "expression",
    "behaviour",
    "situation",
    "their degree"
  ],
  "url": "https://aclanthology.org/W19-5101/",
  "provenance": {
    "collected_at": "2025-06-05 01:02:02",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}