{
  "id": "W19-4112",
  "title": "Insights from Building an Open-Ended Conversational Agent",
  "authors": [
    "Gupta, Khyatti  and\nJoshi, Meghana  and\nChatterjee, Ankush  and\nDamani, Sonam  and\nNarahari, Kedhar Nath  and\nAgrawal, Puneet"
  ],
  "year": "2019",
  "venue": "Proceedings of the First Workshop on NLP for Conversational AI",
  "abstract": "Dialogue systems and conversational agents are becoming increasingly popular in modern society. We conceptualized one such conversational agent, Microsoft’s “Ruuh” with the promise to be able to talk to its users on any subject they choose. Building an open-ended conversational agent like Ruuh at onset seems like a daunting task, since the agent needs to think beyond the utilitarian notion of merely generating “relevant” responses and meet a wider range of user social needs, like expressing happiness when user’s favourite sports team wins, sharing a cute comment on showing the pictures of the user’s pet and so on. The agent also needs to detect and respond to abusive language, sensitive topics and trolling behaviour of the users. Many of these problems pose significant research challenges as well as product design limitations as one needs to circumnavigate the technical limitations to create an acceptable user experience. However, as the product reaches the real users the true test begins, and one realizes the challenges and opportunities that lie in the vast domain of conversations. With over 2.5 million real-world users till date who have generated over 300 million user conversations with Ruuh, there is a plethora of learning, insights and opportunities that we will talk about in this paper.",
  "keywords": [
    "opportunities",
    "conversations",
    "we",
    "dialogue",
    "one such conversational agent",
    "an open-ended conversational agent",
    "modern society",
    "an acceptable user experience",
    "experience",
    "society",
    "language",
    "conversational agents",
    "conversational",
    "comment",
    "notion"
  ],
  "url": "https://aclanthology.org/W19-4112/",
  "provenance": {
    "collected_at": "2025-06-05 00:27:06",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}