{
  "id": "W19-5402",
  "title": "Findings of the {WMT} 2019 Shared Task on Automatic Post-Editing",
  "authors": [
    "Chatterjee, Rajen  and\nFedermann, Christian  and\nNegri, Matteo  and\nTurchi, Marco"
  ],
  "year": "2019",
  "venue": "Proceedings of the Fourth Conference on Machine Translation (Volume 3: Shared Task Papers, Day 2)",
  "abstract": "We present the results from the 5th round of the WMT task on MT Automatic Post-Editing. The task consists in automatically correcting the output of a “black-box” machine translation system by learning from human corrections. Keeping the same general evaluation setting of the previous four rounds, this year we focused on two language pairs (English-German and English-Russian) and on domain-specific data (In-formation Technology). For both the language directions, MT outputs were produced by neural systems unknown to par-ticipants. Seven teams participated in the English-German task, with a total of 18 submitted runs. The evaluation, which was performed on the same test set used for the 2018 round, shows a slight progress in APE technology: 4 teams achieved better results than last year’s winning system, with improvements up to -0.78 TER and +1.23 BLEU points over the baseline. Two teams participated in theEnglish-Russian task submitting 2 runs each. On this new language direction, characterized by a higher quality of the original translations, the task proved to be particularly challenging. None of the submitted runs improved the very high results of the strong system used to produce the initial translations(16.16 TER, 76.20 BLEU).",
  "keywords": [
    "bleu",
    "the initial translations",
    "we",
    "translation",
    "neural",
    "ter",
    "76 20 bleu",
    "par",
    "bleu points",
    "formation",
    "general",
    "language",
    "machine",
    "human",
    "evaluation"
  ],
  "url": "https://aclanthology.org/W19-5402/",
  "provenance": {
    "collected_at": "2025-06-05 02:08:47",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}