{
  "id": "W19-3406",
  "title": "An Analysis of Emotion Communication Channels in Fan-Fiction: Towards Emotional Storytelling",
  "authors": [
    "Kim, Evgeny  and\nKlinger, Roman"
  ],
  "year": "2019",
  "venue": "Proceedings of the Second Workshop on Storytelling",
  "abstract": "Centrality of emotion for the stories told by humans is underpinned by numerous studies in literature and psychology. The research in automatic storytelling has recently turned towards emotional storytelling, in which characters’ emotions play an important role in the plot development (Theune et al., 2004; y Perez, 2007; Mendez et al., 2016). However, these studies mainly use emotion to generate propositional statements in the form “A feels affection towards B” or “A confronts B”. At the same time, emotional behavior does not boil down to such propositional descriptions, as humans display complex and highly variable patterns in communicating their emotions, both verbally and non-verbally. In this paper, we analyze how emotions are expressed non-verbally in a corpus of fan fiction short stories. Our analysis shows that stories written by humans convey character emotions along various non-verbal channels. We find that some non-verbal channels, such as facial expressions and voice characteristics of the characters, are more strongly associated with joy, while gestures and body postures are more likely to occur with trust. Based on our analysis, we argue that automatic storytelling systems should take variability of emotion into account when generating descriptions of characters’ emotions.",
  "keywords": [
    "these studies",
    "b",
    "form",
    "we",
    "numerous studies",
    "a",
    "analysis",
    "stories",
    "studies",
    "the stories",
    "time",
    "characters",
    "fan-fiction",
    "fan fiction",
    "characteristics"
  ],
  "url": "https://aclanthology.org/W19-3406/",
  "provenance": {
    "collected_at": "2025-06-05 01:03:51",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}