{
  "id": "W19-4226",
  "title": "The {SIGMORPHON} 2019 Shared Task: Morphological Analysis in Context and Cross-Lingual Transfer for Inflection",
  "authors": [
    "McCarthy, Arya D.  and\nVylomova, Ekaterina  and\nWu, Shijie  and\nMalaviya, Chaitanya  and\nWolf-Sonkin, Lawrence  and\nNicolai, Garrett  and\nKirov, Christo  and\nSilfverberg, Miikka  and\nMielke, Sabrina J.  and\nHeinz, Jeffrey  and\nCotterell, Ryan  and\nHulden, Mans"
  ],
  "year": "2019",
  "venue": "Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology",
  "abstract": "The SIGMORPHON 2019 shared task on cross-lingual transfer and contextual analysis in morphology examined transfer learning of inflection between 100 language pairs, as well as contextual lemmatization and morphosyntactic description in 66 languages. The first task evolves past years’ inflection tasks by examining transfer of morphological inflection knowledge from a high-resource language to a low-resource language. This year also presents a new second challenge on lemmatization and morphological feature analysis in context. All submissions featured a neural component and built on either this year’s strong baselines or highly ranked systems from previous years’ shared tasks. Every participating team improved in accuracy over the baselines for the inflection task (though not Levenshtein distance), and every team in the contextual analysis task improved on both state-of-the-art neural and non-neural baselines.",
  "keywords": [
    "cross",
    "knowledge",
    "language",
    "neural",
    "learning",
    "transfer",
    "analysis",
    "morphology examined transfer learning",
    "accuracy",
    "100 language pairs",
    "non-neural baselines",
    "morphology",
    "the inflection task",
    "a low-resource language",
    "shared tasks"
  ],
  "url": "https://aclanthology.org/W19-4226/",
  "provenance": {
    "collected_at": "2025-06-05 00:27:59",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}