{
  "id": "W19-4445",
  "title": "Application of an Automatic Plagiarism Detection System in a Large-scale Assessment of {E}nglish Speaking Proficiency",
  "authors": [
    "Wang, Xinhao  and\nEvanini, Keelan  and\nMulholland, Matthew  and\nQian, Yao  and\nBruno, James V."
  ],
  "year": "2019",
  "venue": "Proceedings of the Fourteenth Workshop on Innovative Use of NLP for Building Educational Applications",
  "abstract": "This study aims to build an automatic system for the detection of plagiarized spoken responses in the context of an assessment of English speaking proficiency for non-native speakers. Classification models were trained to distinguish between plagiarized and non-plagiarized responses with two different types of features: text-to-text content similarity measures, which are commonly used in the task of plagiarism detection for written documents, and speaking proficiency measures, which were specifically designed for spontaneous speech and extracted using an automated speech scoring system. The experiments were first conducted on a large data set drawn from an operational English proficiency assessment across multiple years, and the best classifier on this heavily imbalanced data set resulted in an F1-score of 0.761 on the plagiarized class. This system was then validated on operational responses collected from a single administration of the assessment and achieved a recall of 0.897. The results indicate that the proposed system can potentially be used to improve the validity of both human and automated assessment of non-native spoken English.",
  "keywords": [
    "classifier",
    "a recall",
    "english speaking proficiency",
    "classification",
    "proficiency measures",
    "the best classifier",
    "non-native speakers classification models",
    "an f1-score",
    "text",
    "recall",
    "proficiency",
    "human",
    "class",
    "e nglish speaking proficiency",
    "documents"
  ],
  "url": "https://aclanthology.org/W19-4445/",
  "provenance": {
    "collected_at": "2025-06-05 00:55:23",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}