{
  "id": "W19-4434",
  "title": "Content Customization for Micro Learning using Human Augmented {AI} Techniques",
  "authors": [
    "Shah, Ayush  and\nAbuelsaad, Tamer  and\nAhn, Jae-Wook  and\nDey, Prasenjit  and\nKokku, Ravi  and\nSharma Mittal, Ruhi  and\nVempaty, Aditya  and\nSharma, Mourvi"
  ],
  "year": "2019",
  "venue": "Proceedings of the Fourteenth Workshop on Innovative Use of NLP for Building Educational Applications",
  "abstract": "Visual content has been proven to be effective for micro-learning compared to other media. In this paper, we discuss leveraging this observation in our efforts to build audio-visual content for young learners’ vocabulary learning. We attempt to tackle two major issues in the process of traditional visual curation tasks. Generic learning videos do not necessarily satisfy the unique context of a learner and/or an educator, and hence may not result in maximal learning outcomes. Also, manual video curation by educators is a highly labor-intensive process. To this end, we present a customizable micro-learning audio-visual content curation tool that is designed to reduce the human (educator) effort in creating just-in-time learning videos from a textual description (learning script). This provides educators with control of the content while preparing the learning scripts, and in turn can also be customized to capture the desired learning objectives and outcomes. As a use case, we automatically generate learning videos with British National Corpus’ (BNC) frequently spoken vocabulary words and evaluate them with experts. They positively recommended the generated learning videos with an average rating of 4.25 on a Likert scale of 5 points. The inter-annotator agreement between the experts for the video quality was substantial (Fleiss Kappa=0.62) with an overall agreement of 81%.",
  "keywords": [
    "objectives",
    "end",
    "we",
    "the desired learning objectives",
    "learning",
    "visual",
    "generic",
    "-",
    "learner",
    "a learner",
    "process",
    "learners",
    "human",
    "time",
    "major"
  ],
  "url": "https://aclanthology.org/W19-4434/",
  "provenance": {
    "collected_at": "2025-06-05 00:55:04",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}