{
  "id": "W19-3203",
  "title": "Overview of the Fourth Social Media Mining for Health ({SMM}4{H}) Shared Tasks at {ACL} 2019",
  "authors": [
    "Weissenbacher, Davy  and\nSarker, Abeed  and\nMagge, Arjun  and\nDaughton, Ashlynn  and\nO{'}Connor, Karen  and\nPaul, Michael J.  and\nGonzalez-Hernandez, Graciela"
  ],
  "year": "2019",
  "venue": "Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task",
  "abstract": "The number of users of social media continues to grow, with nearly half of adults worldwide and two-thirds of all American adults using social networking. Advances in automated data processing, machine learning and NLP present the possibility of utilizing this massive data source for biomedical and public health applications, if researchers address the methodological challenges unique to this media. We present the Social Media Mining for Health Shared Tasks collocated with the ACL at Florence in 2019, which address these challenges for health monitoring and surveillance, utilizing state of the art techniques for processing noisy, real-world, and substantially creative language expressions from social media users. For the fourth execution of this challenge, we proposed four different tasks. Task 1 asked participants to distinguish tweets reporting an adverse drug reaction (ADR) from those that do not. Task 2, a follow-up to Task 1, asked participants to identify the span of text in tweets reporting ADRs. Task 3 is an end-to-end task where the goal was to first detect tweets mentioning an ADR and then map the extracted colloquial mentions of ADRs in the tweets to their corresponding standard concept IDs in the MedDRA vocabulary. Finally, Task 4 asked participants to classify whether a tweet contains a personal mention of one’s health, a more general discussion of the health issue, or is an unrelated mention. A total of 34 teams from around the world registered and 19 teams from 12 countries submitted a system run. We summarize here the corpora for this challenge which are freely available athttps://competitions.codalab.org/competitions/22521, and present an overview of the methods and the results of the competing systems.",
  "keywords": [
    "a more general discussion",
    "end",
    "overview",
    "we",
    "12 countries",
    "an overview",
    "learning",
    "processing",
    "text",
    "mining",
    "countries",
    "general",
    "language",
    "nlp",
    "machine"
  ],
  "url": "https://aclanthology.org/W19-3203/",
  "provenance": {
    "collected_at": "2025-06-05 00:25:55",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}