{
  "id": "W19-3513",
  "title": "At the Lower End of {L}anguage{---}{E}xploring the Vulgar and Obscene Side of {G}erman",
  "authors": [
    "Eder, Elisabeth  and\nKrieg-Holz, Ulrike  and\nHahn, Udo"
  ],
  "year": "2019",
  "venue": "Proceedings of the Third Workshop on Abusive Language Online",
  "abstract": "In this paper, we describe a workflow for the data-driven acquisition and semantic scaling of a lexicon that covers lexical items from the lower end of the German language register—terms typically considered as rough, vulgar or obscene. Since the fine semantic representation of grades of obscenity can only inadequately be captured at the categorical level (e.g., obscene vs. non-obscene, or rough vs. vulgar), our main contribution lies in applying best-worst scaling, a rating methodology that has already been shown to be useful for emotional language, to capture the relative strength of obscenity of lexical items. We describe the empirical foundations for bootstrapping such a low-end lexicon for German by starting from manually supplied lexicographic categorizations of a small seed set of rough and vulgar lexical items and automatically enlarging this set by means of distributional semantics. We then determine the degrees of obscenity for the full set of all acquired lexical items by letting crowdworkers comparatively assess their pejorative grade using best-worst scaling. This semi-automatically enriched lexicon already comprises 3,300 lexical items and incorporates 33,000 vulgarity ratings. Using it as a seed lexicon for fully automatic lexical acquisition, we were able to raise its coverage up to slightly more than 11,000 entries.",
  "keywords": [
    "end",
    "entries",
    "semantic",
    "we",
    "means",
    "semantic scaling",
    "semantics",
    "it",
    "anguage",
    "e",
    "the fine semantic representation",
    "manually supplied lexicographic categorizations",
    "fine",
    "g",
    "distributional semantics"
  ],
  "url": "https://aclanthology.org/W19-3513/",
  "provenance": {
    "collected_at": "2025-06-05 00:51:14",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}