{
  "id": "W19-3643",
  "title": "NLP} Automation to Read Radiological Reports to Detect the Stage of Cancer Among Lung Cancer Patients",
  "authors": [
    "Gupta, Khushbu  and\nThammasudjarit, Ratchainant  and\nThakkinstian, Ammarin"
  ],
  "year": "2019",
  "venue": "Proceedings of the 2019 Workshop on Widening NLP",
  "abstract": "A common challenge in the healthcare industry today is physicians have access to massive amounts of healthcare data but have little time and no appropriate tools. For instance, the risk prediction model generated by logistic regression could predict the probability of diseases occurrence and thus prioritizing patients’ waiting list for further investigations. However, many medical reports available in current clinical practice system are not yet ready for analysis using either statistics or machine learning as they are in unstructured text format. The complexity of medical information makes the annotation or validation of data very challenging and thus acts as a bottleneck to apply machine learning techniques in medical data. This study is therefore conducted to create such annotations automatically where the computer can read radiological reports for oncologists and mark the staging of lung cancer. This staging information is obtained using the rule-based method implemented using the standards of Tumor Node Metastasis (TNM) staging along with deep learning technology called Long Short Term Memory (LSTM) to extract clinical information from the Computed Tomography (CT) text report. The empirical experiment shows promising results being the accuracy of up to 85%.",
  "keywords": [
    "deep",
    "nlp automation",
    "the accuracy",
    "validation",
    "lstm",
    "current",
    "patients",
    "information",
    "format",
    "machine learning",
    "learning",
    "machine learning techniques",
    "analysis",
    "text",
    "patients waiting list"
  ],
  "url": "https://aclanthology.org/W19-3643/",
  "provenance": {
    "collected_at": "2025-06-05 01:38:25",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}