{
  "id": "W19-4220",
  "title": "Inverting and Modeling Morphological Inflection",
  "authors": [
    "Oseki, Yohei  and\nSudo, Yasutada  and\nSakai, Hiromu  and\nMarantz, Alec"
  ],
  "year": "2019",
  "venue": "Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology",
  "abstract": "Previous “wug” tests (Berko, 1958) on Japanese verbal inflection have demonstrated that Japanese speakers, both adults and children, cannot inflect novel present tense forms to “correct” past tense forms predicted by rules of existent verbs (de Chene, 1982; Vance, 1987, 1991; Klafehn, 2003, 2013), indicating that Japanese verbs are merely stored in the mental lexicon. However, the implicit assumption that present tense forms are bases for verbal inflection should not be blindly extended to morphologically rich languages like Japanese in which both present and past tense forms are morphologically complex without inherent direction (Albright, 2002). Interestingly, there are also independent observations in the acquisition literature to suggest that past tense forms may be bases for verbal inflection in Japanese (Klafehn, 2003; Murasugi et al., 2010; Hirose, 2017; Tatsumi et al., 2018). In this paper, we computationally simulate two directions of verbal inflection in Japanese, Present → Past and Past → Present, with the rule-based computational model called Minimal Generalization Learner (MGL; Albright and Hayes, 2003) and experimentally evaluate the model with the bidirectional “wug” test where humans inflect novel verbs in two opposite directions. We conclude that Japanese verbs can be computed online via some generalizations and those generalizations do depend on the direction of morphological inflection.",
  "keywords": [
    "some generalizations",
    "we",
    "those generalizations",
    "generalizations",
    "rich",
    "generalization",
    "learner",
    "model",
    "japanese verbal inflection",
    "both adults",
    "test",
    "previous",
    "directions",
    "rules",
    "2003 murasugi"
  ],
  "url": "https://aclanthology.org/W19-4220/",
  "provenance": {
    "collected_at": "2025-06-05 00:27:49",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}