{
  "id": "W19-3701",
  "title": "Unsupervised Induction of {U}krainian Morphological Paradigms for the New Lexicon: Extending Coverage for Named Entities and Neologisms using Inflection Tables and Unannotated Corpora",
  "authors": [
    "Babych, Bogdan"
  ],
  "year": "2019",
  "venue": "Proceedings of the 7th Workshop on Balto-Slavic Natural Language Processing",
  "abstract": "The paper presents an unsupervised method for quickly extending a Ukrainian lexicon by generating paradigms and morphological feature structures for new Named Entities and neologisms, which are not covered by existing static morphological resources. This approach addresses a practical problem of modelling paradigms for entities created by the dynamic processes in the lexicon: this problem is especially serious for highly-inflected languages in domains with specialised or quickly changing lexicon. The method uses an unannotated Ukrainian corpus and a small fixed set of inflection tables, which can be found in traditional grammar textbooks. The advantage of the proposed approach is that updating the morphological lexicon does not require training or linguistic annotation, allowing fast knowledge-light extension of an existing static lexicon to improve morphological coverage on a specific corpus. The method is implemented in an open-source package on a GitHub repository. It can be applied to other low-resourced inflectional languages which have internet corpora and linguistic descriptions of their inflection system, following the example of inflection tables for Ukrainian. Evaluation results shows consistent improvements in coverage for Ukrainian corpora of different corpus types.",
  "keywords": [
    "training",
    "it",
    "fast",
    "named entities",
    "ukrainian evaluation results",
    "knowledge",
    "entities",
    "evaluation",
    "new named entities",
    "approach",
    "advantage",
    "the example",
    "unsupervised",
    "corpus",
    "a github repository"
  ],
  "url": "https://aclanthology.org/W19-3701/",
  "provenance": {
    "collected_at": "2025-06-05 00:58:13",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}