{
  "id": "W19-5212",
  "title": "A High-Quality Multilingual Dataset for Structured Documentation Translation",
  "authors": [
    "Hashimoto, Kazuma  and\nBuschiazzo, Raffaella  and\nBradbury, James  and\nMarshall, Teresa  and\nSocher, Richard  and\nXiong, Caiming"
  ],
  "year": "2019",
  "venue": "Proceedings of the Fourth Conference on Machine Translation (Volume 1: Research Papers)",
  "abstract": "This paper presents a high-quality multilingual dataset for the documentation domain to advance research on localization of structured text. Unlike widely-used datasets for translation of plain text, we collect XML-structured parallel text segments from the online documentation for an enterprise software platform. These Web pages have been professionally translated from English into 16 languages and maintained by domain experts, and around 100,000 text segments are available for each language pair. We build and evaluate translation models for seven target languages from English, with several different copy mechanisms and an XML-constrained beam search. We also experiment with a non-English pair to show that our dataset has the potential to explicitly enable 17 × 16 translation settings. Our experiments show that learning to translate with the XML tags improves translation accuracy, and the beam search accurately generates XML structures. We also discuss trade-offs of using the copy mechanisms by focusing on translation of numerical words and named entities. We further provide a detailed human analysis of gaps between the model output and human translations for real-world applications, including suitability for post-editing.",
  "keywords": [
    "17 16 translation settings",
    "we",
    "translation",
    "structured documentation translation",
    "translation accuracy",
    "analysis",
    "human translations",
    "translation models",
    "text",
    "accuracy",
    "language",
    "model",
    "entities",
    "human",
    "translations"
  ],
  "url": "https://aclanthology.org/W19-5212/",
  "provenance": {
    "collected_at": "2025-06-05 01:54:38",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}