{
  "id": "W19-4705",
  "title": "Contextualized Diachronic Word Representations",
  "authors": [
    "Jawahar, Ganesh  and\nSeddah, Djam{\\'e}"
  ],
  "year": "2019",
  "venue": "Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change",
  "abstract": "Diachronic word embeddings play a key role in capturing interesting patterns about how language evolves over time. Most of the existing work focuses on studying corpora spanning across several decades, which is understandably still not a possibility when working on social media-based user-generated content. In this work, we address the problem of studying semantic changes in a large Twitter corpus collected over five years, a much shorter period than what is usually the norm in diachronic studies. We devise a novel attentional model, based on Bernoulli word embeddings, that are conditioned on contextual extra-linguistic (social) features such as network, spatial and socio-economic variables, which are associated with Twitter users, as well as topic-based features. We posit that these social features provide an inductive bias that helps our model to overcome the narrow time-span regime problem. Our extensive experiments reveal that our proposed model is able to capture subtle semantic shifts without being biased towards frequency cues and also works well when certain contextual features are absent. Our model fits the data better than current state-of-the-art dynamic word embedding models and therefore is a promising tool to study diachronic semantic changes over small time periods.",
  "keywords": [
    "bias",
    "extra",
    "semantic",
    "we",
    "norm",
    "current",
    "word",
    "semantic changes",
    "diachronic semantic changes",
    "diachronic studies",
    "topic",
    "an inductive bias",
    "attentional",
    "embeddings",
    "work"
  ],
  "url": "https://aclanthology.org/W19-4705/",
  "provenance": {
    "collected_at": "2025-06-05 01:01:07",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}