{
  "id": "W19-4712",
  "title": "Using Word Embeddings to Examine Gender Bias in {D}utch Newspapers, 1950-1990",
  "authors": [
    "Wevers, Melvin"
  ],
  "year": "2019",
  "venue": "Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change",
  "abstract": "Contemporary debates on filter bubbles and polarization in public and social media raise the question to what extent news media of the past exhibited biases. This paper specifically examines bias related to gender in six Dutch national newspapers between 1950 and 1990. We measure bias related to gender by comparing local changes in word embedding models trained on newspapers with divergent ideological backgrounds. We demonstrate clear differences in gender bias and changes within and between newspapers over time. In relation to themes such as sexuality and leisure, we see the bias moving toward women, whereas, generally, the bias shifts in the direction of men, despite growing female employment number and feminist movements. Even though Dutch society became less stratified ideologically (depillarization), we found an increasing divergence in gender bias between religious and social-democratic on the one hand and liberal newspapers on the other. Methodologically, this paper illustrates how word embeddings can be used to examine historical language change. Future work will investigate how fine-tuning deep contextualized embedding models, such as ELMO, might be used for similar tasks with greater contextual information.",
  "keywords": [
    "bias",
    "the bias",
    "elmo",
    "less stratified ideologically depillarization",
    "question",
    "we",
    "backgrounds",
    "information",
    "word",
    "men",
    "tuning",
    "stratified",
    "word embeddings",
    "dutch society",
    "biases"
  ],
  "url": "https://aclanthology.org/W19-4712/",
  "provenance": {
    "collected_at": "2025-06-05 01:01:20",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}