{
  "id": "W19-3211",
  "title": "Affective Behaviour Analysis of On-line User Interactions: Are On-line Support Groups More Therapeutic than {T}witter?",
  "authors": [
    "Tortoreto, Giuliano  and\nStepanov, Evgeny  and\nCervone, Alessandra  and\nDubiel, Mateusz  and\nRiccardi, Giuseppe"
  ],
  "year": "2019",
  "venue": "Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task",
  "abstract": "The increase in the prevalence of mental health problems has coincided with a growing popularity of health related social networking sites. Regardless of their therapeutic potential, on-line support groups (OSGs) can also have negative effects on patients. In this work we propose a novel methodology to automatically verify the presence of therapeutic factors in social networking websites by using Natural Language Processing (NLP) techniques. The methodology is evaluated on on-line asynchronous multi-party conversations collected from an OSG and Twitter. The results of the analysis indicate that therapeutic factors occur more frequently in OSG conversations than in Twitter conversations. Moreover, the analysis of OSG conversations reveals that the users of that platform are supportive, and interactions are likely to lead to the improvement of their emotional state. We believe that our method provides a stepping stone towards automatic analysis of emotional states of users of online platforms. Possible applications of the method include provision of guidelines that highlight potential implications of using such platforms on users’ mental health, and/or support in the analysis of their impact on specific individuals.",
  "keywords": [
    "support",
    "conversations",
    "we",
    "natural",
    "patients",
    "twitter conversations",
    "analysis",
    "processing",
    "osg conversations",
    "work",
    "language",
    "nlp",
    "states",
    "multi",
    "state"
  ],
  "url": "https://aclanthology.org/W19-3211/",
  "provenance": {
    "collected_at": "2025-06-05 00:26:08",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}