{
  "id": "W19-5110",
  "title": "Without lexicons, multiword expression identification will never fly: A position statement",
  "authors": [
    "Savary, Agata  and\nCordeiro, Silvio  and\nRamisch, Carlos"
  ],
  "year": "2019",
  "venue": "Proceedings of the Joint Workshop on Multiword Expressions and WordNet (MWE-WN 2019)",
  "abstract": "Because most multiword expressions (MWEs), especially verbal ones, are semantically non-compositional, their automatic identification in running text is a prerequisite for semantically-oriented downstream applications. However, recent developments, driven notably by the PARSEME shared task on automatic identification of verbal MWEs, show that this task is harder than related tasks, despite recent contributions both in multilingual corpus annotation and in computational models. In this paper, we analyse possible reasons for this state of affairs. They lie in the nature of the MWE phenomenon, as well as in its distributional properties. We also offer a comparative analysis of the state-of-the-art systems, which exhibit particularly strong sensitivity to unseen data. On this basis, we claim that, in order to make strong headway in MWE identification, the community should bend its mind into coupling identification of MWEs with their discovery, via syntactic MWE lexicons. Such lexicons need not necessarily achieve a linguistically complete modelling of MWEs’ behavior, but they should provide minimal morphosyntactic information to cover some potential uses, so as to complement existing MWE-annotated corpora. We define requirements for such minimal NLP-oriented lexicon, and we propose a roadmap for the MWE community driven by these requirements.",
  "keywords": [
    "we",
    "properties",
    "information",
    "analysis",
    "text",
    "such minimal nlp-oriented lexicon",
    "its distributional properties",
    "nlp",
    "semantically-oriented downstream applications",
    "uses",
    "mind",
    "expression",
    "existing mwe-annotated corpora",
    "the mwe phenomenon",
    "state"
  ],
  "url": "https://aclanthology.org/W19-5110/",
  "provenance": {
    "collected_at": "2025-06-05 01:02:17",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}