{
  "id": "W19-3510",
  "title": "A Hierarchically-Labeled {P}ortuguese Hate Speech Dataset",
  "authors": [
    "Fortuna, Paula  and\nRocha da Silva, Jo{\\~a}o  and\nSoler-Company, Juan  and\nWanner, Leo  and\nNunes, S{\\'e}rgio"
  ],
  "year": "2019",
  "venue": "Proceedings of the Third Workshop on Abusive Language Online",
  "abstract": "Over the past years, the amount of online offensive speech has been growing steadily. To successfully cope with it, machine learning are applied. However, ML-based techniques require sufficiently large annotated datasets. In the last years, different datasets were published, mainly for English. In this paper, we present a new dataset for Portuguese, which has not been in focus so far. The dataset is composed of 5,668 tweets. For its annotation, we defined two different schemes used by annotators with different levels of expertise. Firstly, non-experts annotated the tweets with binary labels (‘hate’ vs. ‘no-hate’). Secondly, expert annotators classified the tweets following a fine-grained hierarchical multiple label scheme with 81 hate speech categories in total. The inter-annotator agreement varied from category to category, which reflects the insight that some types of hate speech are more subtle than others and that their detection depends on personal perception. This hierarchical annotation scheme is the main contribution of the presented work, as it facilitates the identification of different types of hate speech and their intersections. To demonstrate the usefulness of our dataset, we carried a baseline classification experiment with pre-trained word embeddings and LSTM on the binary classified data, with a state-of-the-art outcome.",
  "keywords": [
    "we",
    "a baseline classification experiment",
    "lstm",
    "classification",
    "it",
    "machine learning",
    "word",
    "learning",
    "sufficiently large annotated datasets",
    "the binary classified data",
    "this hierarchical annotation scheme",
    "categories",
    "-",
    "81 hate speech categories",
    "work"
  ],
  "url": "https://aclanthology.org/W19-3510/",
  "provenance": {
    "collected_at": "2025-06-05 00:51:09",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}