{
  "id": "W19-4437",
  "title": "On Understanding the Relation between Expert Annotations of Text Readability and Target Reader Comprehension",
  "authors": [
    "Vajjala, Sowmya  and\nLucic, Ivana"
  ],
  "year": "2019",
  "venue": "Proceedings of the Fourteenth Workshop on Innovative Use of NLP for Building Educational Applications",
  "abstract": "Automatic readability assessment aims to ensure that readers read texts that they can comprehend. However, computational models are typically trained on texts created from the perspective of the text writer, not the target reader. There is little experimental research on the relationship between expert annotations of readability, reader’s language proficiency, and different levels of reading comprehension. To address this gap, we conducted a user study in which over a 100 participants read texts of different reading levels and answered questions created to test three forms of comprehension. Our results indicate that more than readability annotation or reader proficiency, it is the type of comprehension question asked that shows differences between reader responses - inferential questions were difficult for users of all levels of proficiency across reading levels. The data collected from this study will be released with this paper, which will, for the first time, provide a collection of 45 reader bench marked texts to evaluate readability assessment systems developed for adult learners of English. It can also potentially be useful for the development of question generation approaches in intelligent tutoring systems research.",
  "keywords": [
    "question",
    "we",
    "it",
    "adult learners",
    "text",
    "question generation approaches",
    "proficiency",
    "language",
    "generation",
    "learners",
    "time",
    "reader proficiency",
    "assessment",
    "tutoring",
    "responses"
  ],
  "url": "https://aclanthology.org/W19-4437/",
  "provenance": {
    "collected_at": "2025-06-05 00:55:09",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}