{
  "id": "W19-4404",
  "title": "Computationally Modeling the Impact of Task-Appropriate Language Complexity and Accuracy on Human Grading of {G}erman Essays",
  "authors": [
    "Weiss, Zarah  and\nRiemenschneider, Anja  and\nSchr{\\\"o}ter, Pauline  and\nMeurers, Detmar"
  ],
  "year": "2019",
  "venue": "Proceedings of the Fourteenth Workshop on Innovative Use of NLP for Building Educational Applications",
  "abstract": "Computational linguistic research on the language complexity of student writing typically involves human ratings as a gold standard. However, educational science shows that teachers find it difficult to identify and cleanly separate accuracy, different aspects of complexity, contents, and structure. In this paper, we therefore explore the use of computational linguistic methods to investigate how task-appropriate complexity and accuracy relate to the grading of overall performance, content performance, and language performance as assigned by teachers. Based on texts written by students for the official school-leaving state examination (Abitur), we show that teachers successfully assign higher language performance grades to essays with higher task-appropriate language complexity and properly separate this from content scores. Yet, accuracy impacts teacher assessment for all grading rubrics, also the content score, overemphasizing the role of accuracy. Our analysis is based on broad computational linguistic modeling of German language complexity and an innovative theory- and data-driven feature aggregation method inferring task-appropriate language complexity.",
  "keywords": [
    "accuracy impacts teacher assessment",
    "we",
    "it",
    "science",
    "educational science",
    "analysis",
    "accuracy",
    "language",
    "human",
    "modeling",
    "content scores",
    "higher language performance grades",
    "state",
    "computational linguistic methods",
    "assessment"
  ],
  "url": "https://aclanthology.org/W19-4404/",
  "provenance": {
    "collected_at": "2025-06-05 00:52:14",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}