{
  "id": "W19-4723",
  "title": "Spatio-Temporal Prediction of Dialectal Variant Usage",
  "authors": [
    "Jeszenszky, P{\\'e}ter  and\nSiriaraya, Panote  and\nStoeckle, Philipp  and\nJatowt, Adam"
  ],
  "year": "2019",
  "venue": "Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change",
  "abstract": "The distribution of most dialectal variants have not only spatial but also temporal patterns. Based on the ‘apparent time hypothesis’, much of dialect change is happening through younger speakers accepting innovations. Thus, synchronic diversity can be interpreted diachronically. With the assumption of the ‘contact effect’, i.e. contact possibility (contact and isolation) between speaker communities being responsible for language change, and the apparent time hypothesis, we aim to predict the usage of dialectal variants. In this paper we model the contact possibility based on two of the most important factors in sociolinguistics to be affecting language change: age and distance. The first steps of the approach involve modeling contact possibility using a logistic predictor, taking the age of respondents into account. We test theglobal, and thelocalrole of age for variation where the local level means spatial subsets around each survey site, chosen based onknearest neighbors. The prediction approach is tested on Swiss German syntactic survey data, featuring multiple respondents from different age cohorts at survey sites. The results show the relative success of the logistic prediction approach and the limitations of the method, therefore further proposals are made to develop the methodology.",
  "keywords": [
    "communities",
    "we",
    "i",
    "age",
    "language",
    "speaker communities",
    "time",
    "younger",
    "approach",
    "german",
    "language change age",
    "survey",
    "the assumption",
    "most dialectal variants",
    "the approach"
  ],
  "url": "https://aclanthology.org/W19-4723/",
  "provenance": {
    "collected_at": "2025-06-05 01:01:38",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}