{
  "id": "W19-5057",
  "title": "L}asige{B}io{TM} at {MEDIQA} 2019: Biomedical Question Answering using Bidirectional Transformers and Named Entity Recognition",
  "authors": [
    "Lamurias, Andre  and\nCouto, Francisco M"
  ],
  "year": "2019",
  "venue": "Proceedings of the 18th BioNLP Workshop and Shared Task",
  "abstract": "Biomedical Question Answering (QA) aims at providing automated answers to user questions, regarding a variety of biomedical topics. For example, these questions may ask for related to diseases, drugs, symptoms, or medical procedures. Automated biomedical QA systems could improve the retrieval of information necessary to answer these questions. The MEDIQA challenge consisted of three tasks concerning various aspects of biomedical QA. This challenge aimed at advancing approaches to Natural Language Inference (NLI) and Recognizing Question Entailment (RQE), which would then result in enhanced approaches to biomedical QA. Our approach explored a common Transformer-based architecture that could be applied to each task. This approach shared the same pre-trained weights, but which were then fine-tuned for each task using the provided training data. Furthermore, we augmented the training data with external datasets and enriched the question and answer texts using MER, a named entity recognition tool. Our approach obtained high levels of accuracy, in particular on the NLI task, which classified pairs of text according to their relation. For the QA task, we obtained higher Spearman’s rank correlation values using the entities recognized by MER.",
  "keywords": [
    "variety",
    "transformers",
    "question",
    "we",
    "training",
    "the entities",
    "bidirectional transformers",
    "the mediqa challenge",
    "natural",
    "a common transformer-based architecture",
    "retrieval",
    "information",
    "a variety",
    "mediqa 2019 biomedical question",
    "the retrieval"
  ],
  "url": "https://aclanthology.org/W19-5057/",
  "provenance": {
    "collected_at": "2025-06-05 00:57:14",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}