{
  "id": "W19-4707",
  "title": "GASC}: Genre-Aware Semantic Change for {A}ncient {G}reek",
  "authors": [
    "Perrone, Valerio  and\nPalma, Marco  and\nHengchen, Simon  and\nVatri, Alessandro  and\nSmith, Jim Q.  and\nMcGillivray, Barbara"
  ],
  "year": "2019",
  "venue": "Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change",
  "abstract": "Word meaning changes over time, depending on linguistic and extra-linguistic factors. Associating a word’s correct meaning in its historical context is a central challenge in diachronic research, and is relevant to a range of NLP tasks, including information retrieval and semantic search in historical texts. Bayesian models for semantic change have emerged as a powerful tool to address this challenge, providing explicit and interpretable representations of semantic change phenomena. However, while corpora typically come with rich metadata, existing models are limited by their inability to exploit contextual information (such as text genre) beyond the document time-stamp. This is particularly critical in the case of ancient languages, where lack of data and long diachronic span make it harder to draw a clear distinction between polysemy (the fact that a word has several senses) and semantic change (the process of acquiring, losing, or changing senses), and current systems perform poorly on these languages. We develop GASC, a dynamic semantic change model that leverages categorical metadata about the texts’ genre to boost inference and uncover the evolution of meanings in Ancient Greek corpora. In a new evaluation framework, our model achieves improved predictive performance compared to the state of the art.",
  "keywords": [
    "ancient",
    "extra",
    "semantic change",
    "a new evaluation framework",
    "semantic",
    "we",
    "current",
    "semantic change phenomena",
    "semantic search",
    "gasc genre-aware semantic change",
    "ancient greek",
    "it",
    "retrieval",
    "information",
    "rich"
  ],
  "url": "https://aclanthology.org/W19-4707/",
  "provenance": {
    "collected_at": "2025-06-05 01:01:11",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}