{
  "id": "W19-4616",
  "title": "Construction and Annotation of the {J}ordan Comprehensive Contemporary {A}rabic Corpus ({JCCA})",
  "authors": [
    "Sawalha, Majdi  and\nAlshargi, Faisal  and\nAlShdaifat, Abdallah  and\nYagi, Sane  and\nQudah, Mohammad A."
  ],
  "year": "2019",
  "venue": "Proceedings of the Fourth Arabic Natural Language Processing Workshop",
  "abstract": "To compile a modern dictionary that catalogues the words in currency, and to study linguistic patterns in the contemporary language, it is necessary to have a corpus of authentic texts that reflect current usage of the language. Although there are numerous Arabic corpora, none claims to be representative of the language in terms of the combination of geographical region, genre, subject matter, mode, and medium. This paper describes a 100-million-word corpus that takes the British National Corpus (BNC) as a model. The aim of the corpus is to be balanced, annotated, comprehensive, and representative of contemporary Arabic as written and spoken in Arab countries today. It will be different from most others in not being heavily-dominated by the news or in mixing the classical with the modern. In this paper is an outline of the methodology adopted for the design, construction, and annotation of this corpus. DIWAN (Alshargi and Rambow, 2015) was used to annotate a one-million-word snapshot of the corpus. DIWAN is a dialectal word annotation tool, but we upgraded it by adding a new tag-set that is based on traditional Arabic grammar and by adding the roots and morphological patterns of nouns and verbs. Moreover, the corpus we constructed covers the major spoken varieties of Arabic.",
  "keywords": [
    "varieties",
    "we",
    "current",
    "it",
    "tag",
    "word",
    "arab countries",
    "mode",
    "countries",
    "language",
    "model",
    "the major spoken varieties",
    "major",
    "currency",
    "corpus"
  ],
  "url": "https://aclanthology.org/W19-4616/",
  "provenance": {
    "collected_at": "2025-06-05 01:04:35",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}