{
  "id": "W19-5017",
  "title": "First Steps towards Building a Medical Lexicon for {S}panish with Linguistic and Semantic Information",
  "authors": [
    "Campillos-Llanos, Leonardo"
  ],
  "year": "2019",
  "venue": "Proceedings of the 18th BioNLP Workshop and Shared Task",
  "abstract": "We report the work-in-progress of collecting MedLexSp, an unified medical lexicon for the Spanish language, featuring terms and inflected word forms mapped to Unified Medical Language System (UMLS) Concept Unique Identifiers (CUIs), semantic types and groups. First, we leveraged a list of term lemmas and forms from a previous project, and mapped them to UMLS terms and CUIs. To enrich the lexicon, we used both domain-corpora (e.g. Summaries of Product Characteristics and MedlinePlus) and natural language processing techniques such as string distance methods or generation of syntactic variants of multi-word terms. We also added term variants by mapping their CUIs to missing items available in the Spanish versions of standard thesauri (e.g. Medical Subject Headings and World Health Organization Adverse Drug Reactions terminology). We enhanced the vocabulary coverage by gathering missing terms from resources such as the Anatomical Therapeutical Classification, the National Cancer Institute (NCI) Dictionary of Cancer Terms, OrphaData, or the Nomenclátor de Prescripción for drug names. Part-of-Speech information is being included in the lexicon, and the current version amounts up to 76 454 lemmas and 203 043 inflected forms (including conjugated verbs, number and gender variants), corresponding to 30 647 UMLS CUIs. MedLexSp is distributed freely for research purposes.",
  "keywords": [
    "linguistic and semantic information",
    "the anatomical therapeutical classification",
    "unique identifiers",
    "semantic",
    "we",
    "current",
    "classification",
    "natural",
    "identifiers",
    "unified",
    "information",
    "semantic types",
    "word",
    "processing",
    "an unified medical lexicon"
  ],
  "url": "https://aclanthology.org/W19-5017/",
  "provenance": {
    "collected_at": "2025-06-05 00:56:07",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}