{
  "id": "W19-3616",
  "title": "Using Attention-based Bidirectional {LSTM} to Identify Different Categories of Offensive Language Directed Toward Female Celebrities",
  "authors": [
    "Sharifirad, Sima  and\nMatwin, Stan"
  ],
  "year": "2019",
  "venue": "Proceedings of the 2019 Workshop on Widening NLP",
  "abstract": "Social media posts reflect the emotions, intentions and mental state of the users. Twitter users who harass famous female figures may do so with different intentions and intensities. Recent studies have published datasets focusing on different types of online harassment, vulgar language, and emotional intensities. We trained, validate and test our proposed model, attention-based bidirectional neural network, on the three datasets:”online harassment”, “vulgar language” and “valance” and achieved state of the art performance in two of the datasets. We report F1 score for each dataset separately along with the final precision, recall and macro-averaged F1 score. In addition, we identify ten female figures from different professions and racial backgrounds who have experienced harassment on Twitter. We tested the trained models on ten collected corpuses each related to one famous female figure to predict the type of harassing language, the type of vulgar language and the degree of intensity of language occurring on their social platforms. Interestingly, the achieved results show different patterns of linguistic use targeting different racial background and occupations. The contribution of this study is two-fold. From the technical perspective, our proposed methodology is shown to be effective with a good margin in comparison to the previous state-of-the-art results on one of the two available datasets. From the social perspective, we introduce a methodology which can unlock facts about the nature of offensive language targeting women on online social platforms. The collected dataset will be shared publicly for further investigation.",
  "keywords": [
    "precision",
    "macro-averaged f1 score",
    "we",
    "lstm",
    "intensities",
    "backgrounds",
    "neural",
    "racial backgrounds",
    "the final precision recall",
    "different racial background",
    "background",
    "categories",
    "the achieved results",
    "recent studies",
    "celebrities"
  ],
  "url": "https://aclanthology.org/W19-3616/",
  "provenance": {
    "collected_at": "2025-06-05 01:21:40",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}