{
  "id": "W19-3609",
  "title": "Learning and Understanding Different Categories of Sexism Using Convolutional Neural Network{'}s Filters",
  "authors": [
    "Sharifirad, Sima  and\nJacovi, Alon"
  ],
  "year": "2019",
  "venue": "Proceedings of the 2019 Workshop on Widening NLP",
  "abstract": "Sexism is very common in social media and makes the boundaries of free speech tighter for female users. Automatically flagging and removing sexist content requires niche identification and description of the categories. In this study, inspired by social science work, we propose three categories of sexism toward women as follows: “Indirect sexism”, “Sexual sexism” and “Physical sexism”. We build classifiers such as Convolutional Neural Network (CNN) to automatically detect different types of sexism and address problems of annotation. Even though inherent non-interpretability of CNN is a challenge for users who detect sexism, as the reason classifying a given speech instance with regard to sexism is difficult to glance from a CNN. However, recent research developed interpretable CNN filters for text data. In a CNN, filters followed by different activation patterns along with global max-pooling can help us tease apart the most important ngrams from the rest. In this paper, we interpret a CNN model trained to classify sexism in order to understand different categories of sexism by detecting semantic categories of ngrams and clustering them. Then, these ngrams in each category are used to improve the performance of the classification task. It is a preliminary work using machine learning and natural language techniques to learn the concept of sexism and distinguishes itself by looking at more precise categories of sexism in social media along with an in-depth investigation of CNN’s filters.",
  "keywords": [
    "cnn s filters",
    "the categories",
    "more precise categories",
    "classifiers",
    "semantic",
    "we",
    "convolutional",
    "classification",
    "neural",
    "cnn",
    "natural",
    "it",
    "the boundaries",
    "a cnn",
    "science"
  ],
  "url": "https://aclanthology.org/W19-3609/",
  "provenance": {
    "collected_at": "2025-06-05 01:21:29",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}