{
  "id": "W19-4809",
  "title": "Detecting Political Bias in News Articles Using Headline Attention",
  "authors": [
    "Gangula, Rama Rohit Reddy  and\nDuggenpudi, Suma Reddy  and\nMamidi, Radhika"
  ],
  "year": "2019",
  "venue": "Proceedings of the 2019 ACL Workshop BlackboxNLP: Analyzing and Interpreting Neural Networks for NLP",
  "abstract": "Language is a powerful tool which can be used to state the facts as well as express our views and perceptions. Most of the times, we find a subtle bias towards or against someone or something. When it comes to politics, media houses and journalists are known to create bias by shrewd means such as misinterpreting reality and distorting viewpoints towards some parties. This misinterpretation on a large scale can lead to the production of biased news and conspiracy theories. Automating bias detection in newspaper articles could be a good challenge for research in NLP. We proposed a headline attention network for this bias detection. Our model has two distinctive characteristics: (i) it has a structure that mirrors a person’s way of reading a news article (ii) it has attention mechanism applied on the article based on its headline, enabling it to attend to more critical content to predict bias. As the required datasets were not available, we created a dataset comprising of 1329 news articles collected from various Telugu newspapers and marked them for bias towards a particular political party. The experiments conducted on it demonstrated that our model outperforms various baseline methods by a substantial margin.",
  "keywords": [
    "bias",
    "theories",
    "we",
    "parties",
    "our views",
    "means",
    "some parties",
    "it",
    "attention mechanism",
    "political bias",
    "a subtle bias",
    "views",
    "biased",
    "bias detection",
    "viewpoints"
  ],
  "url": "https://aclanthology.org/W19-4809/",
  "provenance": {
    "collected_at": "2025-06-05 00:57:36",
    "source": "ACL Anthology",
    "version": "1.0"
  }
}